label tentacle_shop_scene:
    show screen shop_screen
    if tent_scroll:
        "Ты уже являешься владельцем этого свитка"
        call screen shop_screen
    if whoring <= 15:
        m "Что находится в этом свитке?"
        ger "Не беспокойтесь об этом."
        m "Почему?"
        ger "Вы еще не готовы узнать, что в этом свитке."
        m "Ты еще больше заставляешь меня, хотеть узнать, что в нем."
        ger "Печально это слышать."
        call screen shop_screen
    m "Что это за свиток?"
    fre "Это рецепт мощного и запрещенного зелья."
    ger "Я мог бы добавить, приобретенный - совершенно законно!"
    m "Что оно делает?"
    fre "Он превращает вас в любое волшебное существо, которое вы пожелаете."
    m "Например?"
    fre "Во все, что вы возьмете за образец."
    ger "Могущественный Феникс, ужасающая Горгона, смертоносный Василиск или внушающий благоговение дракон."
    m "Не уверен, что я действительно хочу превратиться в кого-то из них..."
    ger "Ну тогда, возможно, есть существо, которое подойдет вам и вашим \"увлечениям\"."
    m "Например?"
    fre "Ходят слухи о \"растении\", спрятанном где-то на территории школы"
    m "Растение? Почему я должен захотеть быть растением?"
    ger "Это не обычное растение, у него быстрые и мощные конечности, которые невероятно чувствительны"
    m "Так это монстр с щупальцами?"
    ger "В некоторой степени, как бы то ни было. Мы не уверены, где оно растет."
    fre "Понятия не имею!"
    ger "Конечно, не на чердаке!"
    m "Хорошо, сколько стоит свиток?"
    ger "300 галлеонов."
    m "300! Почему так дорого?"
    fre "Запретная магия довольно рискованное и дорогое начинание профессора, мы продадим его не менее чем за 300."
    menu:
        "-Купить свиток- (300)" if gold >= 300:
            m "Хорошо, вот деньги."
            ger "Большое спасибо"
            $ gold -= 300
            $ tent_scroll = True
            $ attic_open = True
            call screen shop_screen
        "-Нет, спасибо-":
            m "Нет, спасибо, не сейчас"
            fre "Возможно, позже"
            call screen shop_screen

label tentacle_scene_intro: #Public tentacle scene
    show screen blkfade
    spo "На сегодняшнем уроке директор попросил меня научить вас растению под названием \"Дьявольская Ловушка\"."
    spo "Это невероятно опасное растение, которое, как известно, сжимает и убивает добычу с помощью быстрых и мощных усиков."
    spo "Они встречаются, естественно, в пещерах и болотах, поскольку они любят темные и влажные места и ненавидят солнечный свет."
    her "Разве дьявольская ловушка, не опасна?"
    spo "Это верно, мисс Грейнджер, поэтому профессор Дамблдор предоставил нам несколько недавно выращенных образцов."
    spo "Им едва исполнилась неделя, они едва смогут погладить тебя своими усиками, не говоря уже о том, чтобы задушить тебя."
    spo "Теперь передаем друг другу образцы, чтобы вы все могли хорошо рассмотреть."
    her "Профессор Спраут, они должны иметь рты?"
    spo "Да, мисс Грейнджер, а то как бы они съедали свою добычу после удушения."
    her "Хорошо, а для чего эти глаза? Я думала, они чувствуют свою добычу на ощупь?"
    spo "О чем ты говоришь, у дьявольской ловушки нет глаз."
    her "Что оно делает..."
    ">Внезапно ты вырываешься наружу толстыми зелеными щупальцами"
    her "Что происходит?!!"
    ">Ты быстро сковываешь ее запястья и живот..."
    her "Я не могу пошевелится!"
    ">Затем поднимаешь ее в воздух своими мощными щупальцами."
    spo "Успокойтесь, мисс Грейнджер, дьявольская Ловушка отпустит тебя, если ты не будешь двигаться"
    ">Просовываешь свои слизистые щупальца под ее топ и юбку."
    her "О нет..."
    ">Ты разрываешь ее хлопковую рубашку с большими пуговицами."
    her "Ааааа"
    ">Просунув щупальца между ног, ты медленно начинаешь раздвигать ее ноги."
    ">Гермиона борется с тобой, но ее усилия напрасны."
    her "Пожалуйста, нет... Не здесь."
    ">Щупальца медленно стягивают ее трусики, показывая все прелести классу"
    mal "Вау..."
    fem "Это ужасно, кто-то должен что-то сделать"
    mal2 "Профессор Спраут говорит, что если она не будет шевелится, то она освободится."
    ">Ты подносишь к ее голове большое щупальце с цветами."
    her "Что это такое?"
    ">Он внезапно открывается, чтобы показать длинный тонкий придаток с набухшим основанием"
    her "Что это? Он выглядит как..."
    ">Пока она сосредоточена на болтающейся конечности над ней, ты двигаешь шесть меньших щупалец к ее талии"
    her "О боже, нет, кто-нибудь, пожалуйста, помогите мне! Профессор Спраут, сделайте что-нибудь!"
    spo "Ок студенты, отойдите!"
    ">Профессор Спраут произносит заклинание на массу извивающихся щупалец"
    spo "Confringo!"
    ">Это сильно поражает растение, но ничего не меняется."
    spo "Что? Это должно было убить его. Оно должно быть магически защищено."
    ">Ты двигаешь три щупальца к ее влагалищу и начинаешь поглаживать губы."
    her "Пожалуйста, профессор Спраут, сделайте что-нибудь! Что угодно!"
    spo "Я не уверена, что могу, оно имеет мощное магическое заклинание, защищающее его"
    spo "Если я попробую что-то более сильное, чем заклинание, которое только что произнесла, я могу причинить тебе боль."
    ">Ты двигаешь двумя маленькими щупальцами к ее анусу и начинаете массировать колечко, медленно расширяя его"
    her "Ну и что я должна делать?"
    spo "Просто оставайся как можно спокойнее, это должно в конечном итоге, освободить тебя..."
    ">Ты перемещаешь щупальце со ртом на правую грудь и впиваешься в сосок."
    her "Пожалуйста, я не смогу оставаться спокойной, если это будет продолжаться"
    ">Три щупальца, которые у ее влагалища ты резко всовываешь в нее"
    $ tentacle_cosmetic = True
    if lock_public_favors == False:
        jump tentacle_1
    jump tentacle_2


label tentacle_1: #Public tentacle scene
    $ cg("images/28_cg/p1.png")
    hide screen blkfade
    with d3
    her "Какого черта?"
    ">Ты начинаешь медленно двигать щупальцами в ее влагалище"
    $ cg("images/28_cg/p2.png")
    her "Oh..."
    ">Ты подносишь маленькое щупальце со ртом к ее уху, чтобы только она могла тебя слышать."
    m "Наслаждаешься шлюха?"
    her "Профессор!"
    spo "Просто расслабься, дорогая. Уверена, скоро тебя оно отпустит."
    m "Правильно, делай, как говорит твой профессор, просто расслабься."
    her "Как я должна расслабиться?!"
    m "Ну, если ты не собираешься расслабляться, хотя бы попробуй насладиться..."
    ">Ты начинаешь вращать щупальца в ее влагалище."
    $ cg("images/28_cg/p3.png")
    her "..."
    spo "Что случилось, мисс Грейнджер?"
    her "Ничего страшного... это просто очень непривычно..."
    m "Ты уверена, что тебе непривычно? Судя по тому, насколько ты мокрая, я бы сказал, что наоборот."
    m "Кто-то может даже подумать, что тебе это нравится."
    her "Они не станут..."
    mal "С кем она разговаривает?"
    mal2 "Я без понятия."
    m "Ты уверена? Думаешь, сможешь заглушить каждый свой стон?"
    ">Ты глубже продавливаешь в нее 3 щупальца."
    her "!!!"
    $ cg("images/28_cg/p4.png")
    m "Как ты думаешь, ты долго сможешь не показывать им, как тебе это нравится?"
    ">Ты делаешь еще один мощный толчок."
    her "{size=-6}мммм{/size}"
    m "Ты правда думаешь, что сможешь удержаться от того, чтобы не начать умолять меня о большем?"
    ">Ты увеличиваешь темп."
    her "{size=-3}ммммммм{/size}"
    m "Я не думаю, что ты это сделаешь. На самом деле я уверен, что ты этого не сделаешь."
    m "Потому что я знаю, кто ты. Шлюха."
    m "Шлюха, которая думает только о том, чтобы кончить, пока ее трахает монстр перед ее одноклассниками."
    ">Ты перестаешь шевелить щупальцами."
    m "Теперь скажи им, кто ты такая."
    her "Ч-ч-что? Нет, пожалуйста, не останавливайтесь."
    m "Скажи им, кто ты, и я продолжу."
    her "Я не могу... Просто, продолжайте..."
    m "Скажи это."
    her "{size=-3}Я шлюха.{/size}"
    ">Ты начинаешь медленно вращать щупальца в ее влагалище."
    m "Что ты сказала? Я не думаю, что они тебя услышали. Почему бы тебе не сказать это еще раз, и с чувством."
    her "Я шлюха!"
    ">Ты начинаешь яростно трахать ее влагалище."
    her "Да, да, я чертова шлюха. Трахните меня жестче."
    m "Видишь, это было не так сложно. Как насчет небольшой награды."
    her "Чт-"
    $ cg("images/28_cg/p5.png")
    ">Ты одним движением воткнул ребристое щупальце глубоко в ее задницу."
    her "!!!"
    her "Оно у меня в попе... Я-я кончаю."
    ">Ты принимаешься чередовать толчки по очереди, засовывая в ее задницу и киску."
    her "Я кончаю! Это слишком..."
    $ cg("images/28_cg/p6.png")
    ">Ты чувствуешь, как ее тело содрогается, когда оргазм ее накрывает."
    ">Это только подстегивает тебя трахать ее сильнее."
    her "Пожалуйста... не надо больше... Я упаду в обморок..."
    ">Ты начинаешь чувствовать странную энергию, протекающей через щупальцы, двигаясь к кончикам."
    m "Итак девочка, приготовься."
    her "...приготовиться?..."
    $ cg("images/28_cg/p7.png")
    ">С последним толчком ты в порыве выпускаешь накопившуюся энергию белого сока на нее.."
    m "О боги, каждое щупальце кончает. Это потрясающе..."
    ">Ощущения оказались слишком большими для Гермионы и она падает в обморок, прямо на твоих щупальцах."
    mal "Какая шлюха..."
    fem "Что я тебе говорила."
    mal2 "Эй, думаю мне прийдется проситься в Гриффиндор."
    ">Ты ложишь Гермиону на стол, когда как растение, которым ты маскировался, медленно увядает и умирает."
    ">Профессор Спраут быстро подбегает."
    spo "Мисс Грейнджер, ты в порядке?"
    her "..."
    spo "Быстро, кто-нибудь отведите ее в больницу."
    mal "Мы должны ее накрыть?"
    spo "О да, я полагаю, нужно."
    $ tentacle_cosmetic = False
    hide screen cg
    $ hermione_takes_classes = True
    jump day_main_menu

    #enter vagina
    #put flower to ear
    #call her a slut
    #make her call out to class mates
    #have class mates comment
    #continue fucking her
    #have her talk about how enjoyable it is

label tentacle_2: #Enjoyable tentacle scene
    $ cg("images/28_cg/p1.png")
    hide screen blkfade
    with d3
    her "Какого хрена это растение делает?"
    ">Ты начинаешь медленно двигать щупальца в ее влагалище."
    her "О..."
    ">Ты подносишь маленькое щупальце со ртом к ее уху, чтобы только она могла тебя слышать."
    m "Наслаждаешься [hermione_name]?"
    her "Профес-"
    $ cg("images/28_cg/e2.png")
    ">Ты быстро вставляешь другое щупальце ей в рот"
    m "Так, так [hermione_name], ты же не хочешь, чтобы кто-нибудь узнал, как ты нынче зарабатываешь столько очков?"
    her "ммммммеее."
    m "Хорошо, тогда просто сделай то, что говорит профессор Спраут, и оставайся на месте."
    m "Просто веди себя так, будто это какой-то ужасный несчастный случай, что ты просто жертва."
    m "Вместо шлюхи, какой ты являешься на самом деле..."
    ">Ты начинаешь вращать щупальцами в ее влагалище."
    m "мммммм"
    mal "Вау, я думаю ей начинает нравиться это."
    fem "Гермиона? Ни в коем случае, вероятно, она просто пытается закричать."
    mal2 "Я не знаю, но она не выглядит так, как будто это ненавидит."
    ">Ты увеличиваешь скорость щупалец во влагалище."
    m "Слышишь это [hermione_name]? Твои одноклассники начинают понимать, какая ты на самом деле шлюха."
    her "мммммееее аааа мммммеееее ааааааяяяааа"
    m "Что? Быстрее?"
    $ cg("images/28_cg/e3.png")
    ">Ты начинаешь трахать Гермиону сильней"
    her "ммммм..."
    "Ощущение трахать Гермиону в две разные дырки восхитительно"
    m "Бьюсь об заклад, тебе нравится каждая секунда..."
    m "Трахаться на глазах у одноклассников."
    m "Пытаясь притворяться, что ты ненавидишь это."
    ">Ты перемещаешь ребристое щупальце к ее заднице"
    her "мм ммммееее ммее ууууувввввааааа!"
    $ cg("images/28_cg/e4.png")
    ">Ты входишь в ее тугую задницу. Невероятное чувство, быть в каждой дырочке одновременно."
    her "мммммммм"
    ">Гермиона едва успевает стонать. Ее захлестнули ощущения удовольствия, которое она испытывает."
    m "Признай это. Тебе это нравится, не так ли?"
    m "Кончить перед одноклассниками, как шлюха."
    m "Продолжай говорить. Скажи мне, кто ты такая."
    her "Ааааа ююююююююфффффааааа."
    m "Что это было, что то я это по звуку не смог понять, как будто у тебя рот занят."
    her "Ааааа ююююююююфффффааааа!"
    m "Один раз. Скажи так, как будто ты серьезна."
    $ cg("images/28_cg/e5.png")
    ">На выдохе ты быстро достанешь щупальце из ее рта."
    her "{size=+5}Я шлюха!{/size}"
    ">Осознание того, что только что произошло, поражает ее, как тонна упавших кирпичей."
    her "Я-я кончаю... Профес-"
    $ cg("images/28_cg/e6.png")
    ">Ты быстро вставляешь щупальце обратно ей в рот, заставляя замолчать."
    m "Хорошая девочка. Время для твоей награды."
    ">Ты ускоряешь темп, поскольку она бьется в конвульсиях под тобой."
    $ cg("images/28_cg/e7.png")
    ">Ты взрываешься соком из каждого щупальца. Стреляя на ее тело и в каждую ее дырочку."
    mal "Я же говорил, что она шлюха."
    fem "Я думаю, ты был прав..."
    ">Ты помещаешь Гермиону обратно на стол, когда как растение, которым ты маскировался, медленно увядает и умирает."
    ">Профессор Спраут быстро подбегает."
    spo "Мисс Грейнджер, ты в порядке?"
    her "..."
    spo "Быстро, кто-нибудь отведите ее в больницу и прикройте."
    $ tentacle_cosmetic = False
    hide screen cg
    $ hermione_takes_classes = True
    jump day_main_menu



###COSTUME SCENES
label costume_scene_1: #Maid role-play
    call her_main("Костюм? Для чего вам нужно, чтобы я наряжалась?","angry","wide")
    m "[hermione_name], ты когда-нибудь слышала о ролевых играх?"
    call her_main("Ролевых играх?","smile","glance")
    m "Это когда ты притворяешься тем, кем не являешься."
    call her_main("Понятно, но зачем мне это делать?","smile","glance")
    m "Потому что это может быть весело!"
    call her_main("Хммм. И кем бы я стала в ролевой игре?","smile","glance")
    m "Ну, я тут подумал, раз уж я купил тебе этот прекрасный новый костюм уборщицы."
    m "Ты могла бы сыграть роль моей личной горничной."
    if whoring < 17:
        call her_main("И сколько будет эта \"личная горничная\" зарабатывать?","smile","glance")
        m "Думаю 35 очков, звучит справедливо."
    call her_main("...","smile","glance")
    call her_main("Сэр, позвольте мне переодеться.","smile","glance")
    $ stockings = 1
    $ custom_outfit_old = 1
    call her_main("","smile","glance")
    pause
    call her_main("Ну?","smile","glance")
    m "Ты, конечно, выглядишь соответствующе. Вопрос сможешь ли ты сыграть эту роль?"
    call her_main("Играть? Я думала, вы просто хотите, чтобы я почистила ваш кабинет?","smile","glance")
    m "И что в этом интересного? Если бы я хотел чистый кабинет, я бы просто заставил этих уродливых гномов сделать это."
    call her_main("Домашних эльфов.","smile","glance")
    m "Без разницы. В любом случае, я хочу, чтобы ты вела себя как сексуальная французская горничная."
    her "Почему она должна быть французской?"
    m "Я должен все объяснять?"
    call her_main("Хорошо...","smile","glance")
    call her_main("Вам нужно что-нибудь почистить сегодня, сэр?","smile","glance")
    m "Хотя бы попробуй изобразить акцент."
    call her_main("...","smile","glance")
    call her_main("Месье, вам нюжно, сегодня, что-нибудь почистить?","mad","angry",cheeks="blush")
    m "Намного лучше."
    call her_main("Мерси боку, месье.","smile","glance")
    m "Теперь, что касается твоей уборки, я думаю, что камин, неплохо бы почистить от пыли."
    call her_main("Как прикажете, месье!","smile","glance")
    ">Гермиона стоит на носочках, чтобы добраться до каминной полки, при этом тебе открывается прекрасный вид ее чулок."
    m "Вот так, только немного выше."
    ">Ты нащупываешь под столом и начинаешь гладить свой член."
    her "..."
    her "Оу-ля-ля, вы слючайно не делать ничего такого под столом, месье?"
    m "Конечно нет, мадемуазель, это просто зуд, а теперь вернись к уборке."
    her "Конечно, бьен сю."
    ">Она продолжает вытирать пыль с камина, забираясь на этот раз еще выше."
    ">Теперь ты можешь разглядеть нижнюю часть ее попки."
    her "Гран Дю! Когда в последний раз тут убирать?"
    m "Я не могу сказать..."
    her "Тут так грязно! Мне придется приложить все усилия."
    ">Она начинает делать небольшие прыжки добираясь до пыли, над книгами."
    m "Вот отлично. Я думаю, что ты могла пропустить пятно внизу."
    her "Муа? А как насчет этого."
    ">Она наклоняется перед тобой, давая тебе четкий вид под свою юбку."
    m "Вот так."
    ">Ты извергаешься под столом, стреляя в его крышку, а затем на пол."
    her "Месье! Вы такой озорник!"
    her "Разводите беспорядок, в то время как я убираю этот очень грязный кабинет."
    her "Такими темпами я никогда не закончить!"
    m "Ну, ты же и стала ответственной за этот бардак."
    her "Полагаю, вы как всегда правы, месье, мне лучше сразу же, все убрать."
    ">Гермиона падает на колени и начинает вытирать сперму."
    her "Такой гран беспорадок!"
    ">Гермиона убирает сперму с пола и стола."
    her "Ну как, я хорошо сыграла?"
    m "Очень хорошо! Ты играешь в ролевые игры, как утка в воде."
    m "40 очков до Гирффиндору."
    her "Спасибо, [genie_name]."
