

#Blowjob in front of Luna
#Genie tells Hermione to go fetch a student and that she will be sucking him off while he talks to them

#Three variants, each with a differing level of exhibitionism
#1 Hermione is as silent as possible, Luna almost completely unaware
#2 Hermione quite loud, Luna actively aware that something is wrong
#3 Hermione crawls out from under the desk covered in Genie's cum trying to pass it off
label hg_ps_HiddenBlowjob:
    jump hg_ps_HiddenBlowjob_1


label hg_ps_HiddenBlowjob_1:
    m "[hermione_name], у меня есть интересное предложение для тебя."
    her "Секс?"
    m "Не совсем."
    her "Тогда, что?"
    m "Ну, оно предполагает, что ты приведешь подругу."
    her "Подругу?!"
    her "Я не могу позволить кому-нибудь из моих друзей узнать, что мы здесь делаем!"
    m "Не волнуйся, дело не в том, что они узнают."
    her "Тогда в чем?"
    m "Речь идет о том, чтобы ты научилась чувствовать себя более комфортно в кругу своих сверстников."
    her "Комфортно?"
    m "Да. Для этого мне нужно, чтобы ты привела свою подругу в мой кабинет."
    her "Зачем?"
    m "Чтобы я мог поговорить с ней."
    her "Звучит не так уж плохо..."
    m "В то время, пока ты у меня отсасываешь."
    her "Что?! Я ни за что этого не сделаю!"
    m "Почему нет?"
    her "Почему нет? Потому что моя репутация будет разрушена! Я не буду сосать у вас на глазах других студентов, не говоря уже о на глазах своей подруги!"
    m "А что если они не узнают, что ты здесь?"
    her "Как? Я не могу прятаться за вами, пока вы смотрите на шкаф..."
    m "Ну, пространства под моим столом довольно много."
    her "Хммммм, я не уверена, а что если меня услышат?"
    m "Просто делай это тихо"
    her "Я не могу, я собираюсь делать это правильно."
    #Needs more dialogue where Genie convinces her to accept, and Hermione agrees.
    m "Ну, конечно, у тебя есть мысли, кто будет подходящей кандидатурой для этого?"
    her "Хммм"
    her "Бинго!"
    m "Ты вспомнила, что одна из твоих подруг глухонемая?"
    her "Лучше [genie_name], Полумна Лавгуд."
    m "Лавгуд? Это ее настоящая фамилия?"
    her "Она подходит."
    m "А почему именно она?"
    her "Давайте просто предположим, что другие с меньшей вероятностью поверят ей, если она попытается распространять слухи."
    m "Хммм, я не уверен, если я согласе-"
    her "Она блондинка с большими сиськами."
    m "Отлично! Зови ее в мой кабинет."
    her "Как только вы скажете мне, что ей надо сказать."
    m "Скажи ей, что я хотел бы обсудить поведение некоторых студентов в школе"
    her "Хорошо, я скажу ей, чтобы она пришла к вам в кабинет, примерно, через 10 минут."
    her "Чтобы я успела прийти к вам раньше."
    #Hermione walks out fade to black
    her "Под крошечный стол!"
    m "С чего ты взяла, что он крошечный, там, довольно, просторно!"
    her "Ну, не с вашими ногами."
    "*Тук* *Тук* *Тук*"
    m "{size=-5}ОНААА, она здесь!{/size}"
    her "Что мне делать?"
    m "Полезай!"
    #Luna walks in
    "Как только Полумна входит, ты хватаешь за затылок Гермиону и начинаешь засовывать свой член ей в рот."
    her "!!!!"
    lun "Здравствуйте, профессор. Гермиона Грейнджер сказала, что вы хотели меня видеть?"
    m "Ах, да, мисс Лавгуд (пфффт), ты вовремя."
    "Ты убираешь руку с затылка Гермионы, позволяя ей двигаться в своем собственном ритме."
    her "мммм"
    lun "О чем вы хотели со мной поговорить, сэр?"

    m "Я хотел бы поговорить с тобой о том, как изменяется школьная форма, в нашей школе."
    lun "Вы имеете в виду Мисс Грейнджер, профессор?"
    "Ты чувствуешь, как Гермиона напрягается под столом."
    m "Да."
    "Ты скользишь бедрами вперед, прижимая голову Гермионы между своим членом и дальней стенкой стола."
    m "Ты заметила какую-нибудь разницу в форме мисс Грейнджер?"
    lun "Да, сэр."
    m "Пожалуйста, опиши эти изменения мне подробно, у меня такое чувство, что она может изменить то, что носит."
    lun "Ну, ее юбка довольно короткая!"
    m "Насколько короткая?"
    lun "Вы можете увидеть ее трусики, сэр!"
    "Ты быстрее водишь бедрами"
    m "Это так?"
    lun "Это так, хотя, только в некоторых случаях."
    her "*glck*"
    m "В некоторых случаях?"
    lun "Ну в других случаях она даже не носит их."
    "Ты чувствуешь, что Гермиона начинает ускоряться."
    m "Правда?"
    lun "Правда. Даже не заставляйте меня говорить о ее верхе."
    "Ты тянешься под стол и хватаешь за затылок Гермиону."
    lun "Все в порядке, сэр?"
    m "Да, да, просто нога чешится, пожалуйста, продолжай."
    lun "Ну, иногда она носит только свой школьный жилет."
    m "Я не вижу ничего неадекватного."
    lun "Она хвастается большим декольте, сэр."
    m "Это проблематично."
    "Ты тянешь ее вперед, пока не почувствовал, как ее нос прижимается к твоему лобку."
    her "!!!"
    m "И как ты думаешь, мисс Грейнджер должна быть наказана?"
    "Ты позволил Гермионе вздохнуть."
    her "*slurp*"
    lun "Ну она завязывает его в узел, так что едва ли можно что-то разглядеть!"
    m ""

    #Hermione says goodbye bla bla bla
    "Гермиона ушла из твоего кабинета."

    jump hg_ps_HiddenBlowjob_complete




label hg_ps_HiddenBlowjob_complete:
    jump hg_ps_HiddenBlowjob_complete_1


label hg_ps_HiddenBlowjob_complete_1:

    jump end_hg_pf
