# TODO: Translation updated at 2018-11-09 09:09

# game/__Renpy__/general/books_waifu.rpy:117
translate russian waifu_b91fc50d:

    # m "Ох, это одна из \"тех\" книг. Хорошо, поглядим..."
    m "Ох, это одна из \"тех\" книг. Хорошо, поглядим..."

# game/__Renpy__/general/books_waifu.rpy:121
translate russian waifu_b9c43933:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решаете пойти на выпускной и с удивлением увидели \"библиотекаршу\" здесь. Она приглашает вас на танец и целует. Вы заметили Ши смотрящую на вас с недоверием.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решаете пойти на выпускной и с удивлением увидели \"библиотекаршу\" здесь. Она приглашает вас на танец и целует. Вы заметили Ши смотрящую на вас с недоверием.{/size}"

# game/__Renpy__/general/books_waifu.rpy:122
translate russian waifu_92398bf5:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}\"Библиотекарша\" выводит вас на улицу. Она начинает целовать вас и, хватая ваш член, начинает дрочить вам. Вдруг из-за угла появляется Ши.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}\"Библиотекарша\" выводит вас на улицу. Она начинает целовать вас и, хватая ваш член, начинает дрочить вам. Вдруг из-за угла появляется Ши.{/size}"

# game/__Renpy__/general/books_waifu.rpy:123
translate russian waifu_817601ae:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши злится и начинает кричать на девушку, которая все еще дрочит вам. На крики Ши, прибегает мисс Стивенс и видит вас со спущенными штанами.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши злится и начинает кричать на девушку, которая все еще дрочит вам. На крики Ши, прибегает мисс Стивенс и видит вас со спущенными штанами.{/size}"

# game/__Renpy__/general/books_waifu.rpy:124
translate russian waifu_30c708b5:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Смущаясь, вы натягиваете свои брюки. Она спокойно обходит свою машину и зовет всех вас. Вы садитесь и она увозит вас в мотель. Она снова замечает ваши спущенные брюки и показывает на них.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Смущаясь, вы натягиваете свои брюки. Она спокойно обходит свою машину и зовет всех вас. Вы садитесь и она увозит вас в мотель. Она снова замечает ваши спущенные брюки и показывает на них.{/size}"

# game/__Renpy__/general/books_waifu.rpy:125
translate russian waifu_fb96ffdb:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}В комнате она хватает вас за член и начинает дрочить его. В это время Ши стоит в шоке, а \"библиотекарша\" начинает вас целовать.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}В комнате она хватает вас за член и начинает дрочить его. В это время Ши стоит в шоке, а \"библиотекарша\" начинает вас целовать.{/size}"

# game/__Renpy__/general/books_waifu.rpy:126
translate russian waifu_0154ee54:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Неохотно Ши присоединяется к вам. Вы решаете трахнуть в первую очередь свою сводную сестренку, конечно же в попку. \"Библиотекарша\" будет следующей, а за ней и мисс Стивенс{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Неохотно Ши присоединяется к вам. Вы решаете трахнуть в первую очередь свою сводную сестренку, конечно же в попку. \"Библиотекарша\" будет следующей, а за ней и мисс Стивенс{/size}"

# game/__Renpy__/general/books_waifu.rpy:127
translate russian waifu_2db2e417:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда вы просыпаетесь, то обнаруживаете, что все, кроме Ши ушли. Ваша сестренка еще спит. Вы раздвигаете ее попку и вставляете свой утренний стояк в ее сладкую попку. -Конец-{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда вы просыпаетесь, то обнаруживаете, что все, кроме Ши ушли. Ваша сестренка еще спит. Вы раздвигаете ее попку и вставляете свой утренний стояк в ее сладкую попку. -Конец-{/size}"

# game/__Renpy__/general/books_waifu.rpy:128
translate russian waifu_d66eee3f:

    # "\"Эпилог\"" "{size=-2}Спустя год. Мисс Стивенс все так же работает в школе и встречается с темноволосой девушкой... у вас нет предположений, что с ней стало.{/size}"
    "\"Эпилог\"" "{size=-2}Спустя год. Мисс Стивенс все так же работает в школе и встречается с темноволосой девушкой... у вас нет предположений, что с ней стало.{/size}"

# game/__Renpy__/general/books_waifu.rpy:129
translate russian waifu_46321c66:

    # "\"Эпилог\"" "{size=-2}Вы и Ши вместе учитесь в одном университете...{/size}"
    "\"Эпилог\"" "{size=-2}Вы и Ши вместе учитесь в одном университете...{/size}"

# game/__Renpy__/general/books_waifu.rpy:130
translate russian waifu_18a0e3d1:

    # "\"Эпилог\"" "{size=-2}Вы были вместе в том отеле, но вам нужно хранить это в секрете. Единственное, что вас заботит, так это бешеный аппетит вашей сестренки к анальному сексу. -КОНЕЦ-{/size}"
    "\"Эпилог\"" "{size=-2}Вы были вместе в том отеле, но вам нужно хранить это в секрете. Единственное, что вас заботит, так это бешеный аппетит вашей сестренки к анальному сексу. -КОНЕЦ-{/size}"

# game/__Renpy__/general/books_waifu.rpy:131
translate russian waifu_658bb1e9:

    # "\"Эпилог\"" "{size=-2}-Концовка 05 из 05-{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 05 из 05-{/size}"

# game/__Renpy__/general/books_waifu.rpy:138
translate russian waifu_ff8bdd07:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}"

# game/__Renpy__/general/books_waifu.rpy:139
translate russian waifu_05413b4e:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы говорите мисс Стивенс о своем решении пропустить выпускной. Она злится, хватает вас за промежность и шепчет, что позволит кончит ей на лицо если вы передумаете.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы говорите мисс Стивенс о своем решении пропустить выпускной. Она злится, хватает вас за промежность и шепчет, что позволит кончит ей на лицо если вы передумаете.{/size}"

# game/__Renpy__/general/books_waifu.rpy:140
translate russian waifu_9b7603b1:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вечером того же дня вы приходите на выпускной. Вы танцуете с мисс Стивенс, она отводит вас к шкавчику дворника и начинает дрочить вам. Вы кончаете ей на лицо.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вечером того же дня вы приходите на выпускной. Вы танцуете с мисс Стивенс, она отводит вас к шкавчику дворника и начинает дрочить вам. Вы кончаете ей на лицо.{/size}"

# game/__Renpy__/general/books_waifu.rpy:142
translate russian waifu_2f844435:

    # "\"Эпилог\"" "{size=-2}Спустя год... Вы пытались оставатся в контакте с мисс Стивенс, но похоже после того как вы перестали быть ее учеником она потеряла к вам интерес.{/size}"
    "\"Эпилог\"" "{size=-2}Спустя год... Вы пытались оставатся в контакте с мисс Стивенс, но похоже после того как вы перестали быть ее учеником она потеряла к вам интерес.{/size}"

# game/__Renpy__/general/books_waifu.rpy:143
translate russian waifu_e6ea5fa5:

    # "\"Эпилог\"" "{size=-2}Но этот опыт мотивировал вас следовать за своей мечтой стать художником в журнале для взрослых. Теперь вы посещаете школу искусств и вы счастливы.{/size}"
    "\"Эпилог\"" "{size=-2}Но этот опыт мотивировал вас следовать за своей мечтой стать художником в журнале для взрослых. Теперь вы посещаете школу искусств и вы счастливы.{/size}"

# game/__Renpy__/general/books_waifu.rpy:144
translate russian waifu_f82a7e6a:

    # "\"Эпилог\"" "{size=-2}-Концовка 03 из 05-{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 03 из 05-{/size}"

# game/__Renpy__/general/books_waifu.rpy:147
translate russian waifu_ff8bdd07_1:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}"

# game/__Renpy__/general/books_waifu.rpy:148
translate russian waifu_63f641de:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она замечает вас. Вы говорите ей о своем решении пропустить выпускной, но ее видимо это совсем не заботит.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она замечает вас. Вы говорите ей о своем решении пропустить выпускной, но ее видимо это совсем не заботит.{/size}"

# game/__Renpy__/general/books_waifu.rpy:149
translate russian waifu_c56ad184:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"

# game/__Renpy__/general/books_waifu.rpy:153
translate russian waifu_395ee71a:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Нашли время...{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Нашли время...{/size}"

# game/__Renpy__/general/books_waifu.rpy:154
translate russian waifu_c56ad184_1:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"

# game/__Renpy__/general/books_waifu.rpy:159
translate russian waifu_d875f060:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению, Ши тоже осталась дома. Затем внезапно она приглашает вас пойти с ней на выпускной.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению, Ши тоже осталась дома. Затем внезапно она приглашает вас пойти с ней на выпускной.{/size}"

# game/__Renpy__/general/books_waifu.rpy:160
translate russian waifu_2b27f0b8:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Выпускной проходит в общем нормально. Вы танцуете со сводной сестрой и все вокруг думают, что это потому, что она сжалилась над вами.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Выпускной проходит в общем нормально. Вы танцуете со сводной сестрой и все вокруг думают, что это потому, что она сжалилась над вами.{/size}"

# game/__Renpy__/general/books_waifu.rpy:161
translate russian waifu_4ca41de4:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда выпускной заканчивается вы с Ши возвращаетесь домой. Этой ночью вы лишили свою сестренку девственности. Так же вам повезло и она попросила испробовать ее попку.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда выпускной заканчивается вы с Ши возвращаетесь домой. Этой ночью вы лишили свою сестренку девственности. Так же вам повезло и она попросила испробовать ее попку.{/size}"

# game/__Renpy__/general/books_waifu.rpy:162
translate russian waifu_4f6fdfc6:

    # "\"Эпилог\"" "{size=-2}Спустя год. Вы и Ши пошли в один и тот же университ, хотя вы и выбрали разные специальности, но вы попрежнему вместе и счастливы. -КОНЕЦ-{/size}"
    "\"Эпилог\"" "{size=-2}Спустя год. Вы и Ши пошли в один и тот же университ, хотя вы и выбрали разные специальности, но вы попрежнему вместе и счастливы. -КОНЕЦ-{/size}"

# game/__Renpy__/general/books_waifu.rpy:164
translate russian waifu_335f31db:

    # "\"Эпилог\"" "{size=-2}-Концовка 02 из 05-{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 02 из 05-{/size}"

# game/__Renpy__/general/books_waifu.rpy:167
translate russian waifu_8dea8e93:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению Ши тоже осталась дома. Ваш генератор идей предлагает вам позвать ее на выпускной, но вы не способны на это.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению Ши тоже осталась дома. Ваш генератор идей предлагает вам позвать ее на выпускной, но вы не способны на это.{/size}"

# game/__Renpy__/general/books_waifu.rpy:168
translate russian waifu_abb902df:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши идет на выпускной с другим парнем, а вы остаетесь дома.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши идет на выпускной с другим парнем, а вы остаетесь дома.{/size}"

# game/__Renpy__/general/books_waifu.rpy:172
translate russian waifu_6f7f8e7a:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома и не ходить на выпускной.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома и не ходить на выпускной.{/size}"

# game/__Renpy__/general/books_waifu.rpy:177
translate russian waifu_7f77eb3d:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Вы идете к своему обычному месту. Вы удивлены увидев брюнетку под своим столом.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Вы идете к своему обычному месту. Вы удивлены увидев брюнетку под своим столом.{/size}"

# game/__Renpy__/general/books_waifu.rpy:178
translate russian waifu_cdf596a4:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Двое мужчин в черных костюмах появляются как раз тогда, когда она засовывает твой член себе в рот. Они забирают ее, а ты просто стоишь там ошеломленный и запутавшийся со спущенными штанами. Какого черта?{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Двое мужчин в черных костюмах появляются как раз тогда, когда она засовывает твой член себе в рот. Они забирают ее, а ты просто стоишь там ошеломленный и запутавшийся со спущенными штанами. Какого черта?{/size}"

# game/__Renpy__/general/books_waifu.rpy:179
translate russian waifu_0a85c3a3:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Рано утром на вашем пороге появляется девушка. Она говорит, что находится под программой защиты свидетелей, но из-за вас ее прикрытие под угрозой.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Рано утром на вашем пороге появляется девушка. Она говорит, что находится под программой защиты свидетелей, но из-за вас ее прикрытие под угрозой.{/size}"

# game/__Renpy__/general/books_waifu.rpy:181
translate russian waifu_989785f4:

    # "\"Эпилог\"" "{size=-2}Спустя два года. Вы и \"девушка из библиотеки\" поженились. Вы живете в пляжном домике, в секретном месте, с новыми именами.{/size}"
    "\"Эпилог\"" "{size=-2}Спустя два года. Вы и \"девушка из библиотеки\" поженились. Вы живете в пляжном домике, в секретном месте, с новыми именами.{/size}"

# game/__Renpy__/general/books_waifu.rpy:182
translate russian waifu_569a3e82:

    # "\"Эпилог\"" "{size=-2}Вы очень ее любите и оставили ради нее, все свое прошлое позади, она так благодарна вам, что часто делает вам потрясающий минет. -Конец-{/size}"
    "\"Эпилог\"" "{size=-2}Вы очень ее любите и оставили ради нее, все свое прошлое позади, она так благодарна вам, что часто делает вам потрясающий минет. -Конец-{/size}"

# game/__Renpy__/general/books_waifu.rpy:183
translate russian waifu_f6efcbd5:

    # "\"Эпилог\"" "{size=-2}-Концовка 04 из 05-{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 04 из 05-{/size}"

# game/__Renpy__/general/books_waifu.rpy:186
translate russian waifu_da67dd73:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Внезапно появляется девушка из неоткуда и садится рядом с вами.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Внезапно появляется девушка из неоткуда и садится рядом с вами.{/size}"

# game/__Renpy__/general/books_waifu.rpy:187
translate russian waifu_14ff742a:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она начинает говорить с вами, говорит что ее зовут Лина, но вдруг появляются двое мужчин в черных костюмах. Вы видете страх в ее глазах, когда они забирают ее. Вы хотели бы сделать что-то...{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она начинает говорить с вами, говорит что ее зовут Лина, но вдруг появляются двое мужчин в черных костюмах. Вы видете страх в ее глазах, когда они забирают ее. Вы хотели бы сделать что-то...{/size}"

# game/__Renpy__/general/books_waifu.rpy:191
translate russian waifu_e3e2b9bd:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Через некоторое время вы уходите домой и ложитесь спать.{/size}"
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Через некоторое время вы уходите домой и ложитесь спать.{/size}"

# game/__Renpy__/general/books_waifu.rpy:201
translate russian school_ended_c26d5efe:

    # "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьные занятия закончены. Как бы вы хотели провести остаток дня?{/size}" nointeract
    "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьные занятия закончены. Как бы вы хотели провести остаток дня?{/size}" nointeract

# game/__Renpy__/general/books_waifu.rpy:214
translate russian school_ended_183a7505:

    # "ASS"
    "ASS"

# game/__Renpy__/general/books_waifu.rpy:232
translate russian epilogue_b8a53c7b:

    # "\"Эпилог\"" "{size=-2}Многое произошло за этот год. Вы поступили в университет за рубежом и вам нравится учиться, так что вы редко думаете о прошлом и возлагаете большие надежды на будущее.{/size}"
    "\"Эпилог\"" "{size=-2}Многое произошло за этот год. Вы поступили в университет за рубежом и вам нравится учиться, так что вы редко думаете о прошлом и возлагаете большие надежды на будущее.{/size}"

# game/__Renpy__/general/books_waifu.rpy:233
translate russian epilogue_73f8fdaa:

    # "\"Эпилог\"" "{size=-2}-Концовка 01 из 04-{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 01 из 04-{/size}"

# game/__Renpy__/general/books_waifu.rpy:239
translate russian waifu_completed_2971d23a:

    # m "Ух ты! Какая замечательная книга! Это было круто!"
    m "Ух ты! Какая замечательная книга! Это было круто!"

# game/__Renpy__/general/books_waifu.rpy:243
translate russian waifu_completed_43c92829:

    # m "Хм...?"
    m "Хм...?"

# game/__Renpy__/general/books_waifu.rpy:244
translate russian waifu_completed_ce2cebd9:

    # m "А это что такое?... Закладка?"
    m "А это что такое?... Закладка?"

# game/__Renpy__/general/books_waifu.rpy:246
translate russian waifu_completed_3b81d51e:

    # m "Хм..."
    m "Хм..."

# game/__Renpy__/general/books_waifu.rpy:253
translate russian waifu_completed_25c3931b:

    # m "Не плохо. Я действительно вырос, чтобы заботиться о той девочке Ши..."
    m "Не плохо. Я действительно вырос, чтобы заботиться о той девочке Ши..."

# game/__Renpy__/general/books_waifu.rpy:254
translate russian waifu_completed_8bec0d9b:

    # g9 "Ну... о ней и ее анальной дырочке..."
    g9 "Ну... о ней и ее анальной дырочке..."

# game/__Renpy__/general/books_waifu.rpy:257
translate russian waifu_completed_61b9aa49:

    # m "Значит, я снова встречаюсь с Ши, да?"
    m "Значит, я снова встречаюсь с Ши, да?"

# game/__Renpy__/general/books_waifu.rpy:258
translate russian waifu_completed_4de25447:

    # m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"
    m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"

# game/__Renpy__/general/books_waifu.rpy:261
translate russian waifu_completed_6c982733:

    # m "Не плохо, не плохо. Эта леди, мисс Стивенс оказалась такой развратной шлюхой..."
    m "Не плохо, не плохо. Эта леди, мисс Стивенс оказалась такой развратной шлюхой..."

# game/__Renpy__/general/books_waifu.rpy:264
translate russian waifu_completed_69e1707a:

    # m "Так я снова оказался с мисс Стивенс?"
    m "Так я снова оказался с мисс Стивенс?"

# game/__Renpy__/general/books_waifu.rpy:265
translate russian waifu_completed_4de25447_1:

    # m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"
    m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"

# game/__Renpy__/general/books_waifu.rpy:268
translate russian waifu_completed_48b9501a:

    # g9 "Мило! Обожаю счастливые развязки!"
    g9 "Мило! Обожаю счастливые развязки!"

# game/__Renpy__/general/books_waifu.rpy:271
translate russian waifu_completed_228ae8e6:

    # m "Значит, я снова оказался с этой блондинкой?"
    m "Значит, я снова оказался с этой блондинкой?"

# game/__Renpy__/general/books_waifu.rpy:272
translate russian waifu_completed_4de25447_2:

    # m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"
    m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"

# game/__Renpy__/general/books_waifu.rpy:275
translate russian waifu_completed_60d08316:

    # m "Хм... Какой разочаровывающий финал..."
    m "Хм... Какой разочаровывающий финал..."

# game/__Renpy__/general/books_waifu.rpy:283
translate russian waifu_completed_7cc08102:

    # ">Ваше воображение улучшилось."
    ">Ваше воображение улучшилось."

translate russian strings:

    # __Renpy__\general\books_waifu.rpy:134
    old "Что бы вы хотели сделать в оставшуюся часть дня?"
    new "Что бы вы хотели сделать в оставшуюся часть дня?"

    # __Renpy__\general\books_waifu.rpy:134
    old "- Бродить около школы (Страница 78) -"
    new "- Бродить около школы (Страница 78) -"

    # __Renpy__\general\books_waifu.rpy:134
    old "- Остаться дома (Страница 51) -"
    new "- Остаться дома (Страница 51) -"

    # __Renpy__\general\books_waifu.rpy:134
    old "- Бродить вокруг библиотеки (Страница 97) -"
    new "- Бродить вокруг библиотеки (Страница 97) -"

    # __Renpy__\general\books_waifu.rpy:201
    old "- Бродить у школы (Страница [page_03]) -"
    new "- Бродить у школы (Страница [page_03]) -"

    # __Renpy__\general\books_waifu.rpy:201
    old "- Идти домой (Страница [page_01]) -"
    new "- Идти домой (Страница [page_01]) -"

    # __Renpy__\general\books_waifu.rpy:201
    old "- Идти к библиотеке (Страница [page_02]) -"
    new "- Идти к библиотеке (Страница [page_02]) -"

