###FAVOURS###------------------------------------------------------

label luna_favour_1: ###TALK TO ME
    m "{size=-4}(Все, что я сделаю, это мило побеседую с ней...){/size}"
    if luna_corruption == 0: #FIRST TIME
            $ luna_corruption += 1
            call play_music("chipper_doodle") 
            m "Хорошо..."
            m "Расскажи мне немного о себе, [luna_name]."
            call luna_main("*Хм* Я полагаю, что вы станете платить мне за это, [l_genie_name].", 7, 1, 2, 2) 
            menu:
                "-5 галлеонов-":
                    m "Что на счет звона 5 галлеонов, [luna_name]?"
                    call luna_main("Пять монет! Кем вы меня считаете!", 8, 1, 2, 4) 
                    m "Студентом без источника дохода."
                    call luna_main("Я Полумна Лавгуд! Вы должны заплатить 100 галлеонов просто за то, что бы посмотреть на меня!", 9, 2, 3, 3) 
                    m "Как насчет десяти?"
                    call luna_main("Возможно, если бы вы предложили это сразу...", 7, 1, 2, 2) 
                    call luna_main("Но теперь я слишком расстроена, чтобы продолжать разговор за такую малую сумму.", 7, 2, 2, 4) 
                    m "Двадцать галлеонов успокоят тебя?"
                    call luna_main("Ну, я предполагаю, что да.", 3, 3, 1, 1) 
                    $ current_payout = 20
                    m "Хорошо, теперь, когда мы с этим разобрались..."
                "-10 галлеонов-":
                    m "Хватит ли десяти галлеонов для разговора с директором?"
                    call luna_main("Я думаю да...", 6, 1, 1, 2) 
                    call luna_main("Просто не делайте ничего странного.", 7, 2, 2, 3) 
                    $ current_payout = 10
                    m "Честное пионерское. Теперь..."
                "-50 галлеонов-":
                    $ current_payout = 50
                    m "Что на счет звона 50 галлеонов, [luna_name]?"
                    call luna_main("{size=+10}(ПЯТЬДЕСЯТ ГАЛЛЕОНОВ!){/size}", 4, 1, 1, 17) 
                    call luna_main("*Хм* Я полагаю, это честная сумма.", 2, 3, 1, 1) 
                    call luna_main("Просто не думайте, будто столько позволит вам что-то кроме беседы.", 7, 1, 2, 2) 
                    m "Конечно, нет. Рассказывай..."
            call luna_main("Хорошо, хорошо, я начинаю...", 3, 3, 1, 2) 
            call luna_main("Моя школьная жизнь, до сих пор, была мучительно скучной.", 1, 1, 2, 3) 
            call luna_main("Я была недооценена всеми в этом проклятом месте.", 1, 2, 2, 2) 
            call luna_main("Никто не воспринимает меня всерьез...", 7, 3, 2, 2) 
            menu: 
                "-Дрочить, пока она говорит-": # offended and stops unless you paid her 50 or offer to pay her more
                    hide screen luna
                    hide screen blktone
                    with d3
                    ">Ты убираешь руки под стол и обхватываешь свой член..."
                    hide screen blktone8
                    with d3
                    hide screen genie
                    show screen genie_jerking_off
                    with d3
                    pause                    
                    call luna_main("Что вы делаете, [l_genie_name]?!", 9, 1, 5, 3) 
                    m "Да ничего, просто поправляю свою мантию, вот и все."
                    if current_payout < 50:
                        call luna_main("Это именно то, что я имела в виду!", 8, 1, 3, 3) 
                        call luna_main("Даже директор этой чертовой школы считает, что ему сойдет с рук трогать себя предо мной всего за [current_payout] галлеонов!", 8, 2, 3, 3) 
                        show screen genie
                        with d3
                        "Ты быстро прячешь свой член обратно в мантию."
                        m "Уверяю тебя, я не делал ничего подобного!"
                        call luna_main("Достаточно... Я ухожу", 8, 2, 3, 3) 
                        m "Что? Уже?"
                        call luna_main("Вы бы предпочли, что бы я осталась и доложила в Министерство Магии, [l_genie_name]?", 8, 1, 3, 3) 
                        m "Справедливо."
                        call luna_main("Я имею в виду, что если вы хотите попробовать так сделать, вы могли предложить мне хотя бы немного больше, чем [current_payout] галлеонов...", 9, 1, 2, 4) 
                        jump luna_away
                    call luna_main("...", 6, 2, 1, 2) 
                    call luna_main("{size=-5}(Ну, предложим 50 монет..){/size}", 6, 2, 1, 1) 
                    call luna_main("Как я уже говорила, никто, кажется, не замечает меня.", 7, 1, 2, 2) 
                    call luna_main("Учителя слишком заняты, играя в фаворитов с \"Гриффиндорскими\" и \"Слизеринскими\" студентами.", 7, 2, 2, 4) 
                    call luna_main("Всех девушек объяла корысть.", 7, 3, 2, 3) 
                    m "И не говори."
                    call luna_main("И мальчики гоняются за всем, что покажет им хоть немного обнаженной кожи...", 8, 2, 2, 3) 
                    m "Ну, может быть, ты должна выбить клин клином?."
                    call luna_main("Что?! И выставить себя на показ, как шлюха?", 4, 2, 2, 6) 
                    m "{size=-4}(Да... Гадкая маленькая шлюха!){/size}"
                    call luna_main("Готова поспорить, вам бы это понравилось, [l_genie_name]...", 5, 1, 2, 1) 
                    m "{size=-4}(Да...){/size}"
                    call luna_main("Еще один ваш драгоценный студент оденется как проститутка.", 5, 2, 1, 1) 
                    m "{size=-2}(Да......){/size}"
                    call luna_main("Демонстрировать свое тело всем тем, кто будет смотреть.", 6, 2, 2, 11) 
                    m "{size=+2}(Да.........){/size}"
                    call luna_main("Вы, наверное, хотите, что бы я вела себя как \"Слизеринская\" шлюха...", 6, 1, 2, 1) 
                    m "{size=+4}(Да! Даа!){/size}"
                    call luna_main("Готовая показать всю себя за несколько очков...", 6, 1, 2, 5) 
                    g4 "{size=+4}(Почти готов...){/size}"
                    call luna_main("Это то, что вы хотите, [l_genie_name]? Отличную маленькую Слизеринскую шлюху?", 6, 1, 2, 1) 
                    g4 "{size=+4}(ДА! ДА! ДАААА!) *Аргх!*{/size}"
                    hide screen luna
                    with d3
                    show screen white 
                    pause.1
                    hide screen white
                    pause.2
                    show screen white 
                    pause .1
                    hide screen white
                    with hpunch
                    g4 "АРГХ! ДАА!"
                    hide screen luna
                    with d3
                    hide screen bld1
                    with d3
                    show screen genie_jerking_sperm
                    with d3
                    show screen bld1
                    with d3
                    call luna_main("Вот так, [l_genie_name], просто выпустите все...", 5, 1, 1, 1) 
                    show screen genie_jerking_sperm_02
                    with d3
                    g4 "Что? Нет, я просто... Ох, черт, это приятно..."
                    show screen genie
                    hide screen bld1
                    #show screen genie_jerking_off
                    with d3
                    call luna_main("Вы не могли ничего с собой поделать?", 5, 2, 5, 1) 
                    m "Ох... Я думаю, нет."
                    call luna_main("Что ж, я жду бонусы.", 2, 2, 5, 2) 
                    m "Я уже заплатил тебе пятьдесят галлеонов!"
                    call luna_main("Это было только за разговор. Если вы ожидаете, что я буду стоять здесь и смотреть, как вы кончаете на себя, это будет стоить дороже.", 8, 2, 3, 3) 
                    m "Хорошо, я дам 70 галлеонов."
                    $ current_payout = 70
                    call luna_main("Ну, я рада, что хоть кто-то ценит меня.", 5, 2, 5, 1) 
                    call luna_main("(Даже если это грязный старый извращенец...)", 3, 2, 5, 2) 
                "-Принять участие в беседе-":
                    m "Я не понимаю, почему..."
                    call luna_main("Даже мой отец не обращается со мной так, как должен.", 7, 2, 2, 2) 
                    m "Как это?"
                    call luna_main("Я вроде принцессы!", 5, 1, 1, 4) 
                    m "(Только не снова...)"
                    call luna_main("Поскольку он едва ли продает сколько-нибудь копий своей газеты.", 8, 2, 3, 3) 
                    call luna_main("Это несправедливо! Я должна быть осыпана подарками и деньгами...", 9, 2, 3, 2) 
            call luna_main("Кстати, об этом...", 5, 1, 2, 2) 
            m "Хорошо, хорошо. Вот твои галлеоны."
            $ gold -= current_payout
            $ luna_gold += current_payout
            ">Ты даешь Полумне [current_payout] галлеонов."
            call luna_main("Благодарю, [l_genie_name].", 5, 2, 1, 1) 
            ">Полумна покидает твой кабинет."  



    elif luna_corruption == 1: #SECOND TIME 
        if luna_corruption <= 1:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "Хорошо, тогда..."
        m "Как дела в школе, [luna_name]."
        call luna_main("Разве мы, для начала, не собираемся обсудить, в первую очередь, сколько вы мне заплатите, [l_genie_name]?", 7, 1, 2, 2) 
        menu:
            "-10 галлеонов-": #just conversation (very short)
                $ current_payout = 10
                m "Как на счет 10 галлеонов?"
                call luna_main("*Хм* Хорошо...", 3, 3, 1, 2) 
                m "Про твою школьную жизнь..."
                call luna_main("В школе скучно. Все, что я делаю - это хожу на занятия.", 1, 1, 2, 3) 
                call luna_main("Могу ли я сейчас уйти?", 1, 2, 2, 2) 
                g9 "Что? Это было всего лишь одно предложение!"
                call luna_main("И десять монет - это только лишь плата!", 1, 2, 2, 2) 
                m "Я бы сказал, что это справедливая плата за немного праздной болтовни."
                call luna_main("Ну, это все, что есть. Если вы хотите большего, то и платите больше...", 1, 1, 3, 2) 
            "-20 галлеонов-": #Slightly flirty, still short
                $ current_payout = 20
                m "Хватит ли тебе двадцати монет, [luna_name]?"
                call luna_main("Я думаю, если...", 6, 1, 1, 2) 
                call luna_main("Вы не станете трогать себя...", 7, 2, 2, 3) 
                m "А сколько это будет стоить?"
                call luna_main("...{p}Больше, чем двадцать галлеонов...", 7, 2, 2, 3) 
                m "Ну, мы могли бы поговорить об этом позже, а пока расскажи мне о школе."
                call luna_main("Школа - это скучно...", 1, 1, 2, 3) 
                m "..."
                call luna_main("Но, происходит несколько интересных вещей... ", 5, 1, 5, 1) 
                m "Продолжай..."
                call luna_main("Ну, есть какие-то слухи о призраке Пивзе...", 5, 2, 5, 1) 
                m "Какого рода?"
                call luna_main("Ну, я слышала, будто он прикасался к некоторым девушкам...", 5, 1, 4, 2) 
                m "И почему я не слышал жалоб?"
                call luna_main("Ну, насколько я слышала... После этого у девушек нет жалоб...", 5, 1, 5, 1) 
                m "Ох... Что-то еще?"
                call luna_main("Хммм... ничего не приходит на ум.", 6, 3, 2, 2) 
                m "Достаточно честно, думаю, это стоило двадцати галлеонов."
            "-100 галлеонов-": #JOI
                $ current_payout = 100
                m "Как насчет ста галлеонов?"
                call luna_main("Хорошо...", 5, 2, 2, 2) 
                call luna_main("...", 6, 1, 2, 2) 
                call luna_main("......", 6, 1, 5, 3) 
                call luna_main("Ну, вы собираетесь начать?", 8, 2, 3, 3) 
                m "Начать чего? Ты единственная, кому следует говорить."
                call luna_main("О, пожалуйста... Думаете, я поверю в то, что вы готовы заплатить студенту 100 монет за обычный разговор?", 7, 1, 5, 3) 
                m "Ну, я полагаю, что да-"
                call luna_main("Просто начните уже гладить свой член, [l_genie_name].", 5, 1, 1, 2) 
                hide screen blktone
                with d3
                ">Ты протягиваешь руку под стол и берешься за член..."
                hide screen blktone8
                with d3
                hide screen genie
                show screen genie_jerking_off
                with d3
                pause  
                call luna_main("Разве так не лучше?", 5, 1, 5, 1) 
                m "..."
                call luna_main("Так что, вы платите еще кому-нибудь за то, что бы он смотрел, как вы сидите там и дрочите свой старый мерзкий член?", 5, 1, 2, 3) 
                m "{size=-4}(Мне кажется, что на самом деле я не плачу Гермионе...){/size}"
                m "Ааа... нет..."
                call luna_main("Хорошо...", 5, 2, 1, 1) 
                m "Хорошо?"
                call luna_main("Ну... Мы же не можем позволить вам тратить деньги на любых других маленьких шлюх, да?", 8, 1, 3, 3) 
                menu:
                    "-Подыграть-": #act submissive
                        $ luna_dom += 1
                        $ current_payout = 150
                        m "Ох... Конечно нет..."
                        call luna_main("Вот именно... Зачем беспокоиться о них, когда здесь я, что бы поговорить с вами...", 8, 1, 3, 1) 
                        m "{size=-4}(Да...){/size}"
                        call luna_main("Так вот, продолжайте гладить себя, [l_genie_name].", 6, 1, 2, 2) 
                        m "{size=-4}(Да... Да...){/size}"
                        call luna_main("Наверное, мне приятно от того, что я вижу, как вы осушаете свои яйца.", 6, 2, 2, 2) 
                        call luna_main("В противном случае, кто знает, кого вы можете позвать сюда, чтобы спустить пар...", 7, 1, 2, 4) 
                        m "{size=-4}(Ммммм... Да...){/size}"
                        call luna_main("Вы, вероятно, даже делали бы это перед первогодками, не так ли?", 9, 1, 2, 1) 
                        ">Ты перестаешь гладить свой член."
                        m "Я бы никогда не-"
                        call luna_main("Вы хоть знаете, сколько мне лет?", 9, 1, 5, 1) 
                        m "Конечно..."
                        call luna_main("*Хм* Вы в этом уверены?", 9, 1, 5, 14) 
                        m "..."
                        call luna_main("Возвращайтесь к поглаживаниям, [l_genie_name]...", 9, 1, 3, 1) 
                        ">Ты снова начинаете гладить свой член."
                        call luna_main("Разве так не лучше?", 9, 2, 3, 1) 
                        m "{size=-4}(Аргх... Да...){/size}"
                        call luna_main("Скажите это вслух.", 8, 1, 3, 1) 
                        m "{size=-4}Да...{/size}"
                        call luna_main("Хорошо. Теперь кончите для меня.", 9, 1, 2, 1) 
                        m "{size=-2}(Что?){/size}"
                        call luna_main("Давайте...", 9, 1, 4, 1) 
                        g4 "{size=+4}(Агх... Почти кончаю...){/size}"
                        call luna_main("Кончайте для своей маленькой девочки...", 9, 1, 3, 14) 
                        g4 "{size=+4}(ДА! ДА! ДА!) *Агрх!*{/size}"
                        hide screen luna
                        with d3
                        show screen white 
                        pause.1
                        hide screen white
                        pause.2
                        show screen white 
                        pause .1
                        hide screen white
                        with hpunch
                        g4 "Аргх! ДА!"
                        hide screen luna
                        with d3
                        hide screen bld1
                        with d3
                        show screen genie_jerking_sperm
                        with d3
                        show screen bld1
                        with d3
                        call luna_main("Вот и все, [l_genie_name], так просто...", 5, 1, 1, 1) 
                        show screen genie_jerking_sperm_02
                        with d3
                        g4 "Что? Нет, я думал о... а, черт, я чувствую себя слишком хорошо..."
                        show screen genie
                        hide screen bld1
                        #show screen genie_jerking_off
                        with d3
                        call luna_main("Вы очень гадкий старик.", 5, 2, 5, 1) 
                        m "А..."
                        call luna_main("Не волнуйтесь. Я никому не скажу...", 5, 1, 5, 1) 
                        m "Благодарю..."
                        call luna_main("Однако, я ожидаю справедливой компенсации...", 7, 2, 2, 1) 
                        m "Не волнуйся, я добавлю еще 50 галлеонов сверху."
                        call luna_main("Это меньшее, что вы можете сделать, [l_genie_name]...", 9, 2, 5, 1) 



                    "-Пусть она узнает свое место-": #note that he could get more for less from those tarts
                        $ luna_sub += 1
                        m "Ну, теперь, когда ты упомянула об этом, я уверен, что эти маленькие шлюшки, вероятно, будут брать намного меньше за разговор..."
                        call luna_main("*Хмм* Вы получаете то, за что платите...", 7, 2, 3, 3) 
                        m "И что именно я получу от тебя за свои деньги?"
                        call luna_main("Возможность смотреть на меня в то время, пока вы дрочите свой старый член... Думаю, вполне достаточно.", 7, 1, 3, 2) 
                        m "Ну, тебе придется простить мои старые глаза, так как я едва тебя различаю..."
                        menu: 
                            "-Попросить ее снять рубашку-":
                                $ luna_sub += 1
                                m "Возможно, ты могла бы расстегнуть пуговицу или две, что бы мне было лучше видно."
                                call luna_main("Вы серьезно? Вы считаете, что я буду выставлять себя напоказ, как дешевая шлюха?", 8, 1, 2, 2) 
                                m "Нет, я жду, что ты выставишь себя напоказ, словно принцесса, которой себя называешь..."
                                call luna_main("...", 7, 2, 2, 2) 
                                m "Я жду..."
                                call luna_main("... {size=-8}(Прекрасно...){/size}", 6, 3, 4, 3) 
                                ">Полумна снимает галстук и слегка растегивает рубашку..."
                                hide screen luna 
                                with d3
                                $ luna_top_level = 2
                                call luna_main("...", 6, 3, 4, 2) 
                                m "Почему бы тебе, с этого момента, не носить рубашку, вот так..."
                                call luna_main("...", 6, 2, 4, 3) 
                            "-Попросить ее подойти ближе-":
                                m "Возможно, тебе стоит подойти ближе."
                                call luna_main("Правда? Вы хотите, что бы я подошла ближе, пока вы...?", 6, 1, 3, 2) 
                                m "Ну, я же \"старый\"..."
                                call luna_main("...", 7, 2, 2, 2) 
                                m "Я жду..."
                                call luna_main("... {size=-8}(Прекрасно...){/size}", 6, 3, 4, 3) 
                                hide screen luna_chibi
                                with d3
                                ">Полумна подходит к тебе и встает прямо перед столом..."
                                $ luna_chibi_xpos = 450
                                show screen luna_chibi 
                                with d3 
                                m "Отлично. Думаю, тебе теперь всегда стоит стоять так близко..."
                                call luna_main("...", 6, 2, 4, 3) 


                        call luna_main("Это все, что вы хотите?", 6, 3, 4, 3) 
                        call luna_main("Унизить меня...", 6, 1, 3, 3) 
                        m "{size=-4}(Мммм... Да...){/size}"
                        call luna_main("Вам это нравится, не так ли...", 7, 1, 2, 2) 
                        ">Ты начинаешь дрочить быстрее."
                        call luna_main("Что я вынуждена делать...", 7, 3, 3, 2) 
                        call luna_main("Просто чтобы выжить...", 6, 3, 4, 3) 
                        m "..."
                        call luna_main("Ну, не беспокойтесь об этом...", 8, 1, 3, 2) 
                        call luna_main("Просто продолжайте дрочить.", 8, 2, 3, 1) 
                        m "{size=-4}(Агрх... да...){/size}"
                        call luna_main("Вы отвратительный старик.", 8, 1, 3, 1) 
                        m "{size=-4}Да...{/size}"
                        call luna_main("Ваши деньги имеют цену...", 9, 1, 3, 3) 
                        m "{size=-2}(Ммммм...){/size}"
                        call luna_main("Продолжайте...", 9, 1, 2, 1) 
                        g4 "{size=+4}(Агх... Почти кончил...){/size}"
                        call luna_main("Для бедных студентов...", 9, 1, 4, 1) 
                        g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                        hide screen luna
                        with d3
                        show screen white 
                        pause.1
                        hide screen white
                        pause.2
                        show screen white 
                        pause .1
                        hide screen white
                        with hpunch
                        g4 "Argh! ДА!"
                        hide screen luna
                        with d3
                        hide screen bld1
                        with d3
                        show screen genie_jerking_sperm
                        with d3
                        show screen bld1
                        with d3
                        call luna_main("Вот так, просто кончайте...", 8, 1, 3, 3) 
                        show screen genie_jerking_sperm_02
                        with d3
                        g4 "Хорошая работа, шлюха... А, черт, я чувствую себя так хорошо..."
                        show screen genie
                        hide screen bld1
                        #show screen genie_jerking_off
                        with d3
                        call luna_main("Вы гадкий старик...", 9, 1, 5, 1) 
                        m "Ах..."
                        call luna_main("Заставляете меня смотреть, как вы это делаете...", 9, 2, 3, 1) 
                        m "А... Я не заставляю тебя ничего делать..."
                        call luna_main("Хмм... Эм, я ожидаю оплаты...", 8, 1, 2, 2) 
                        m "Не волнуйся, я дам тебе 100 галлеонов."
                        call luna_main("*Хм* Прекрасно...{p}(Ничего сверху...?)", 8, 2, 2, 3) 


        call luna_main("Кстати говоря...", 5, 1, 2, 2) 
        m "Хорошо, хорошо, вот твои монеты."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты отдаешь Полумне [current_payout] галлеонов."
        call luna_main("Благодарю вас, [l_genie_name].", 5, 2, 1, 1) 
        ">Полумна покидает твой кабинет."  

    elif luna_corruption >= 2 and luna_corruption < 13: #THIRD TIME 
        if luna_corruption <= 2:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "Скажи мне, [luna_name]..."
        m "Как у тебя дела дома?"
        call luna_main("Моя домашняя жизнь?", 7, 2, 5, 2) 
        call luna_main("В одно слово, [l_genie_name], неподходящая.", 7, 1, 2, 4) 
        m "Неподходящая?"
        call luna_main("Да! Люди, вроде меня, должны быть осыпаны деньгами и подарками.", 8, 2, 2, 4) 
        call luna_main("Вместо этого, я живу в шахматной фигуре, в то время, как мой глупый бесполезный отец изо всех сил пытается продать хотя бы десяток копий своей глупой газеты!", 8, 3, 3, 3) 
        m "Наверняка он продает больше, чем десять копий?"
        call luna_main("Едва...", 7, 2, 2, 2) 
        call luna_main("Сейчас он изо всех сил ищет любые учреждения, что бы они закупали тираж... С тех пор, как Министерство перестало его скупать.", 6, 2, 2, 2) 
        menu:
            "-Ничего не говорить-": #act submissive
                if luna_dom <= 1:
                    $ luna_dom += 1
                $ current_payout = 150
                call luna_main("Подождите... Придумала!", 5, 1, 2, 1) 
                m "Что?"
                call luna_main("Почему бы вам не начать покупать \"Задиру\", [l_genie_name]?.", 5, 1, 1, 1) 
                m "Я не думаю, что один человек сможет что-то изменить."
                call luna_main("Не вы лично, [l_genie_name], Хогвартс!", 8, 1, 2, 2) 
                call luna_main("Только представьте, сколько копий могла бы купить вся школа!", 1, 2, 2, 11) 
                m "Хммм... Я подумаю об этом..."
                call luna_main("Вы {size=+4}подумаете{/size} об этом?", 9, 1, 3, 3) 
                call luna_main("*Хмм* Может быть, мне просто придется {size=+4}подумать{/size} о том, как мой отец напишет историю...", 9, 2, 3, 3) 
                call luna_main("Про старого директора-извращенца, который любит заманивать молодых девушек в свой кабинет...", 9, 2, 5, 3) 
                call luna_main("Что бы смотреть на них, в то время, пока гладит свой старый мерзкий член...", 9, 1, 2, 3) 
                m "..."
                call luna_main("Я уверена, это бы помогло продать несколько дополнительных копий...", 8, 2, 5, 3) 
                call luna_main("Ну?", 9, 1, 3, 2) 
                m "Хорошо, хорошо. Я попрошу кого-нибудь заказать дополнительные экземпляры для библиотеки."
                call luna_main("Ну вот, видите как мы быстро договорились?", 5, 2, 2, 1) 
                m "Да..."
                call luna_main("Хорошо. Теперь, в виде награды, я позволю вам потрогать свой мерзкий старый член.", 7, 1, 2, 1) 
                m "..."
                call luna_main("Начинайте, [l_genie_name]...", 9, 1, 4, 1) 
                hide screen blktone
                with d3
                ">Ты убираешь руки под стол и достаешь член..."
                hide screen blktone8
                with d3
                hide screen genie
                show screen genie_jerking_off
                with d3
                pause  
                call luna_main("Так ведь лучше, не правда ли?", 9, 1, 2, 1) 
                call luna_main("Просто слушайте мой голос, пока трогаете себя...", 9, 2, 2, 1) 
                m "..."
                call luna_main("Только представьте, как я буду счастлива, когда отец станет уважаемым членом общества.", 8, 1, 3, 1) 
                call luna_main("Подумайте о том, как вам нравится делать меня счастливой...", 8, 2, 3, 1) 
                m "{size=-4}(Агрх... да...){/size}"
                call luna_main("Вы же любите делать меня счастливой, не так ли, [l_genie_name]...", 8, 1, 3, 1) 
                m "{size=-4}Да...{/size}"
                call luna_main("Скажите громче...", 8, 1, 3, 1) 
                m "Да..."
                call luna_main("Вам же очень хорошо, не так ли... ?", 9, 1, 3, 1) 
                m "{size=-2}(Ммммм...){/size}"
                m "{size=+2}Да...{/size}"
                call luna_main("Может быть, я даже заставлю вас поцеловать мои ноги... Это сделает меня очень счастливой.", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх...){/size}"
                g4 "{size=+4}Да...{/size}"
                call luna_main("Вот так, [l_genie_name], кончите для своей принцессы...", 9, 1, 4, 1) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                g4 "{size=+4}(Агх... почти кончаю...){/size}"
                call luna_main("Кончайте...", 9, 1, 3, 14) 
                call luna_main("{size=+4}Кончайте!{/size}", 9, 1, 3, 14) 
                g4 "{size=+4}(Да! Да! ДА!) *Аргх!*{/size}"
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх! ДА!"
                hide screen luna
                with d3
                hide screen bld1
                with d3
                show screen genie_jerking_sperm
                with d3
                show screen bld1
                with d3
                call luna_main("Вот так, [l_genie_name], очень просто...", 8, 1, 2, 2) 
                show screen genie_jerking_sperm_02
                with d3
                g4 "Ах.. Вот дерьмо, почему мне так хорошо..."
                show screen genie
                hide screen bld1
                #show screen genie_jerking_off
                with d3
                call luna_main("Отвратительно...", 5, 2, 1, 6) 
                m "Ох..."
                call luna_main("...", 8, 1, 2, 2) 
                m "Спасибо..."
                call luna_main("Спасибо...?", 9, 1, 3, 3) 
                m "Благодарю тебя, принцесса..."
                if luna_name == "Мисс Лавгуд":
                    $ luna_name = "Принцесса"
                call luna_main("Так лучше, [l_genie_name]...", 7, 1, 2, 1) 
                call luna_main("Теперь, как принцесса, я ожидаю подарок за то, что должна была смотреть на такой мерзкий поступок...", 7, 2, 2, 1) 

            "-Заключить сделку-": #exchange quibbler purchase
                if luna_sub <= 1:
                    $ luna_sub += 1
                $ current_payout = 50
                m "Эээ, я уверен, что мог бы поговорить с сотрудником библиотеки на счет его запасов..."
                call luna_main("Правда? Вы сделаете это?", 4, 1, 1, 1) 
                m "Конечно."
                if l_genie_name == "Старик":
                    $ l_genie_name = "Профессор"
                call luna_main("Огромное спасибо, [l_genie_name]!", 2, 1, 1, 1) 
                m "Я подумал, что ты могла бы отблагодарить меня за столь щедрое предложение и другим способом..."
                call luna_main("Ох...{p}", 7, 2, 3, 3) 
                m "Это не проблема, [luna_name]?"
                call luna_main("Конечно нет... Что вы имеете в виду?", 6, 3, 4, 2) 
                m "Ну, для начала..."
                hide screen blktone
                with d3
                ">Ты убираешь руку под стол и берешься за член..."
                hide screen blktone8
                with d3
                hide screen genie
                show screen genie_jerking_off
                with d3
                pause  
                menu: 
                    "-Попросить ее укоротить юбку-":
                        if luna_sub <= 2:
                            $ luna_sub += 1
                        m "Давай поговорим о твоей юбке..."
                        call luna_main("Что с ней?", 8, 1, 2, 2) 
                        m "Ты когда-нибудь думала носить юбку... Покороче?"
                        call luna_main("...", 7, 2, 2, 2) 
                        m "Я жду..."
                        call luna_main("...Насколько короче?", 6, 3, 4, 3) 
                        m "Всего на дюйм выше или около того."
                        call luna_main("...", 6, 3, 4, 3) 
                        call luna_main("(Мой отец должен это оценить...)", 6, 3, 4, 3) 
                        ">Полумна слегка подтягивает юбку, а затем подворачивает ее вверх..."
                        hide screen luna 
                        with d3
                        $ luna_skirt_level = 2
                        call luna_main("...", 6, 3, 4, 3) 
                        m "{size=-4}(Мммм... Да...){/size}"
                        m "Начиная с этого момента, почему бы тебе, теперь не носить ее так..."
                        call luna_main("Да, [l_genie_name].", 6, 2, 4, 3) 

                    "-Заставить ее, называть тебя \"Сэр\"-":
                        $ l_genie_name = "Сэр"
                        m "Что на счет того, что бы выказывать мне уважение, которое я заслуживаю?"
                        call luna_main("...", 6, 1, 3, 2) 
                        m "Отныне я хочу, что бы ты обращалась ко мне сэр."
                        call luna_main("...", 7, 2, 2, 2) 
                        m "Это понятно?"
                        call luna_main("...Да...{size=-8}Сэр{/size}", 6, 3, 4, 3) 
                        m "Повтори, [luna_name]..."
                        call luna_main("Да, сэр...", 6, 2, 4, 3) 
                        m "{size=-4}(Да...){/size}"


                call luna_main("Вы знаете, что это неправильно, не так ли?", 6, 3, 4, 3) 
                call luna_main("То, что вы заставляете меня делать...", 6, 1, 3, 3) 
                m "{size=-4}(Мммм... Да...){/size}"
                m "Я не помню, что бы принуждал тебя к чему-то, [luna_name]..."
                call luna_main("*Хм*...", 7, 1, 2, 2) 
                ">Ты начинаешь дрочить быстрее."
                call luna_main("Ну...", 7, 3, 3, 2) 
                call luna_main("Просто заканчивайте с этим...", 6, 3, 4, 3) 
                m "{size=-4}Ох...{/size}"
                call luna_main("Да продолжайте себя трогать...", 8, 1, 3, 2) 
                m "{size=-4}(Аргх... Да...){/size}"
                call luna_main("Я буду продолжать на вас, смотреть...", 8, 1, 3, 5) 
                m "{size=-4}Да...{/size}"
                call luna_main("Вашей студенткой...", 9, 1, 3, 3) 
                m "{size=-2}(Ммммм...){/size}"
                call luna_main("Давайте...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Уже почти...){/size}"
                call luna_main("Сделайте это для своей маленькой принцессы...", 9, 1, 4, 1) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Агрх!*{/size}"
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Argh! ДА!"
                hide screen luna
                with d3
                hide screen bld1
                with d3
                show screen genie_jerking_sperm
                with d3
                show screen bld1
                with d3
                call luna_main("Угх... Ее так много...", 8, 1, 3, 3) 
                show screen genie_jerking_sperm_02
                with d3
                g4 "Хорошая работа, шлюха... Вот черт, мне так хорошо..."
                show screen genie
                hide screen bld1
                #show screen genie_jerking_off
                with d3
                call luna_main("Пол...", 7, 3, 2, 2) 
                call luna_main("Он покрыт...", 7, 2, 2, 2) 
                m "Ох... Ты умница, [luna_name]..."
                call luna_main("Хм... Ну, а теперь я жду оплаты...", 8, 1, 2, 2) 


        m "Хорошо, хорошо. Вот твое золото."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты протягиваешь Полумне [current_payout] галлеонов."
        call luna_main("Благодарю, [l_genie_name].", 5, 2, 1, 2) 
        if current_payout <= 50:
            call luna_main("(Всего [current_payout]?) *Хммм*", 8, 2, 2, 3) 
        ">Полумна покидает твой кабинет."  
    
    else: #HERMIONE INVOLVED
        play music "music/Chipper Doodle v2.mp3" fadein 1 fadeout 1 
        m "Расскажи мне, [luna_name]..."
        m "Как продвигается твое обучение с мисс Грейнджер?"
        call luna_main("Мои уроки с Гермионой?", 7, 2, 2, 2) 
        call luna_main("Если честно... Они великолепны.", 1, 3, 1, 1) 
        m "Правда?"
        call luna_main("Да... По началу, я думала, что это пустая трата времени...", 8, 2, 4, 2) 
        call luna_main("Но, на самом деле, они очень помогают.", 1, 1, 4, 1) 
        m "Ммммм... То, как ты сосала мой член - отличное тому доказательство..."
        call luna_main("*Хм* Я имела в виду свои оценки...", 7, 2, 2, 2) 
        call luna_main("Хотя, она так же оказала большую помощь в сексе...", 5, 3, 2, 1) 
        call luna_main("По факту... Почему бы вам не вызвать ее сюда?", 5, 1, 2, 1) 
        m "Что?"
        call luna_main("Ну, я полагаю, мы оба знаем, что вы начали этот разговор для того, что бы вы могли гладить свой мерзкий член, пока я говорю...", 7, 1, 2, 1) 
        m "Может быть..."
        call luna_main("Так почему бы не привести сюда Гермиону, что бы немного увеличить удовольствие?", 8, 1, 2, 1) 
        call luna_main("Мы могли бы даже позволить вам кое-что подсмотреть...", 5, 2, 2, 1) 
        m "Идет!"
        ">Ты быстренько вызываешь Гермиону в свой кабинет."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте, профессор!","base","happyCl") 
        call her_main("Привет, Полумна! Что он сейчас хочет? Еще один минет?","grin","baseL") 
        call luna_main("Нет, он просто хочет поговорить...", 5, 1, 2, 1) 
        call her_main("Действительно?","upset","wink") 
        call luna_main("Я имею в виду, что он просит говорить...", 7, 2, 3, 2) 
        call luna_main("Но, мне кажется, мы обе знаем, что он хочет сидеть и трогать свой мерзкий старый член в то время, пока мы разговариваем.", 5, 1, 2, 1) 
        call her_main("Как всегда...","base","down") 
        call her_main("Так зачем вы меня сюда позвали?","base","glance") 
        call luna_main("Я подумала, что ты можешь помочь... Плюс, так нам обеим заплатят.", 7, 2, 2, 2) 
        call her_main("Оу, это так мило, Полумна!","base","worriedCl") 
        call luna_main("Ну, это больше похоже на то, что мне потребуется урок пошлых разговоров...", 8, 2, 4, 2) 
        call her_main("То, что вы говорите... Теперь мне кажется, что сейчас самое время, что бы вы начали трогать себя, не так ли, [genie_name]?","base","glance") 
        $ luna_flip = 1
        call luna_main("Да, давайте, [l_genie_name]...", 5, 1, 4, 1) 
        m "Я, разве, собираюсь отказываться?"
        hide screen blktone
        with d3
        ">Ты убираешь руку под стол и хватаешь член..."
        hide screen blktone8
        with d3
        hide screen genie
        show screen genie_jerking_off
        with d3
        pause  
        call luna_main("Так лучше, не правда ли?", 7, 1, 4, 2) 
        call luna_main("Просто слушайте наши голоса, пока трогаете себя...", 8, 1, 2, 1) 
        call her_main("Ммммм.... Он любит, когда ты рассказываешь ему истории...","base","suspicious") 
        call luna_main("Правда? Какого рода?", 5, 2, 4, 1) 
        call her_main("Что на счет того случая, когда нас чуть не поймали во время практики минета...","base","down") 
        $ luna_flip = -1
        call luna_main("Что? Не тот раз!", 4, 1, 4, 15) 
        m "Что случилось?"
        $ luna_flip = 1
        call luna_main("Это слишком неловко! Я не говорила ему, про тот раз!", 4, 2, 4, 15) 
        call her_main("Ну, я не возражаю...","open","baseL") 
        $ luna_flip = -1
        call luna_main("Пожалуйста, Гермиона...", 4, 1, 4, 2) 
        call her_main("Тссс...","open","closed") 
        m "Продолжай..."
        ">Ты ускоряешь движения."
        call her_main("Вчера вечером, после занятий, мы с Полумной, как обычно, были заняты учебой...","soft","squintL") 
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png" 
        $ luna_flip = 1
        call luna_main("...", 4, 3, 4, 3) 
        m "..."
        call her_main("Мы, только что закончили проверку основных заклинаний, поэтому, как обычно, перешли на минет...","open","baseL") 
        call luna_main("...", 4, 2, 4, 2) 
        m "{size=-2}(Ммммм...){/size}"
        call her_main("Все шло отлично, когда вдруг несколько второгодников вошли в общую комнату...","angry","wink") 
        call luna_main("Ты сказала, что там никого не будет!", 4, 8, 4, 2) 
        call her_main("Это было невероятно, сэр... Она проглотила все...","base","down") 
        g4 "{size=+4}(Агх...){/size}"
        g4 "{size=+4}Да...{/size}"
        call her_main("Она спрятала все 6 дюймов в рот... Прямо в горло...","base","glance") 
        call her_main("Только таким образом о нас и не узнали...","base","suspicious") 
        $ luna_flip = -1
        call luna_main("Ну, а что еще мне оставалось делать...", 4, 1, 4, 15) 
        g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
        g4 "{size=+4}(Агх... Уже почти...){/size}"
        $ luna_flip = 1
        call her_main("Она держала его там почти минуту...","open","baseL") 
        call her_main("Кое-кто из них даже поздоровались с нами...","soft","squintL") 
        call her_main("Они ничего не заподозрили...","soft","ahegao") 
        call luna_main("Пока ты не начала трогать меня под столом!", 4, 2, 2, 2) 
        g4 "{size=+4}*Аргх!* Да, шлюшки!{/size}"
        hide screen luna
        with d3
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "Аргх! ДАА!"
        hide screen luna
        with d3
        hide screen bld1
        with d3
        show screen genie_jerking_sperm
        with d3
        show screen bld1
        with d3
        call luna_main("...", 5, 1, 4, 1) 
        call her_main("Я же говорила, что он любит истории...","base","glance") 
        show screen genie_jerking_sperm_02
        with d3
        g4 "Вот черт... Почему мне так хорошо..."
        show screen genie
        hide screen bld1
        #show screen genie_jerking_off
        with d3
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png" 
        call luna_main("В следующий раз просто сделайте разок вверх...", 5, 2, 2, 3) 
        m "Ох..."
        call her_main("Давай, Полумна, мы должны забрать нашу оплату за эти разговоры...","base","suspicious") 

        m "Хорошо, хорошо. Вот ваши галлеоны и очки."
        $ gryffindor += 15
        $ ravenclaw += 15
        m "15 очков \"Гриффиндору\" и \"Когтеврану\"."
        $ gold -= 50
        $ luna_gold += 25
        m "И вот ваше золото."
        ">Ты вручаешь по 25 галлеонов Полумне и Гермионе."
        call her_main("Спасибо, [genie_name]!","base","base") 
        call luna_main("...Благодарю вас, сэр.", 5, 2, 4, 2) 
        ">Полумна и Гермиона покидают твой кабинет, разговаривая на ходу."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        hide screen luna
        hide screen luna_chibi
        $ luna_busy = True
        hide screen genie_jerking_sperm_02     
        jump end_hg_pf

    hide screen genie_jerking_sperm_02     
    jump luna_away










label luna_favour_2: ###SIT ON MY LAP
    m "{size=-4}(Я просто попрошу ее посидеть у меня на коленях...){/size}"
    if luna_corruption <= 3: #FIRST TIME 
        if luna_corruption <= 3:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "Прежде, чем мы начнем, не хочешь ли присесть, [luna_name]?"
        call luna_main("Я бы хотела, но тут нет стула, [l_genie_name]...", 7, 1, 5, 2) 
        m "Как насчет того, что бы сесть мне на колени?"
        call luna_main("...", 9, 1, 2, 3) 
        m "Давай, это будет как будто с Санта-Клаусом."
        call luna_main("...", 9, 2, 2, 3) 
        call luna_main("Вам лучше назвать цену, [l_genie_name]...", 8, 2, 2, 3) 
        m "Не волнуйся, я уверен, что бы будешь очень довольна своей \'наградой\'."
        call luna_main("...", 6, 1, 2, 3) 
        show screen blkfade
        with d3 
        ">Полумна обходит твой стол и встает перед тобой."
        #chibi stuff
        $ luna_flip = -1
        $ luna_xpos = 120
        $ luna_chibi_xpos = 300
        hide screen blkfade
        with d3 
        menu:
            "-Затащить ее к себе на колени-" if luna_sub >= 2:
                if luna_sub <= 3:
                    $ luna_sub += 1
                $ luna_grope = True
                call luna_main("...", 6, 2, 2, 3) 
                call luna_main("Вообще-то, я не уверена, что...", 8, 2, 1, 2) 
                ">Ты хватаешь Полумну за талию и тянешь ее к себе на колени."
                call luna_main("Профессор! Что вы делаете?", 4, 2, 5, 3) 
                m "Просто протягиваю тебе руку помощи..."
                ">Ты начинаешь медленно тереться промежностью о ее мягкую попку."
                m "Мммм, вот так..."
                call luna_main("...", 6, 3, 4, 2) 
                call luna_main("(Это так унизительно...)", 6, 3, 4, 3) 

                jump luna_lap_dance

            "-Сказать ей сесть-":
                $ luna_grope = False
                m "Давай же, [luna_name]..."
                call luna_main("...", 8, 2, 2, 3) 
                call luna_main("Мне действительно нужно это делать?", 8, 2, 2, 3) 
                m "Просто сядь, [luna_name]..."
                call luna_main("...", 8, 2, 2, 3) 
                ">Полумна мягко усаживается к тебе на колени."
                m "Ммммм..."
                call luna_main("...", 6, 2, 4, 2) 
                call luna_main("(Ух.. Какой он твердый...)", 6, 3, 4, 6) 

                label luna_lap_dance:
                    m "Вот и все, теперь просто начни двигать талией."
                ">Полумна постепенно начинает тереться своей попкой об тебя."
                m "Ууух, вот так...."
                call luna_main("...", 8, 3, 2, 3) 
                call luna_main("Теперь вы счастливы?", 8, 2, 3, 3) 
                m "Очень..."
                call luna_main("Я уже могу уйти?", 8, 1, 2, 3) 
                m "Что? Мы же только начали!"
                call luna_main("Ну, я не могу так сидеть весь день.", 8, 2, 2, 3) 
                m "Хмм... Я подумаю, что можно сделать, что бы ускорить это..." 
                menu:
                    "-Схватить ее за талию-":
                        ">Ты берешь ее за талию."
                        call luna_main("!!!", 4, 1, 1, 6) 
                        call luna_main("Я не думаю, что прикосновения были частью соглашения, [l_genie_name]...", 7, 2, 3, 7) 
                        $ current_payout = 75
                        m "Не волнуйся, [luna_name], ты будешь вознаграждена."
                        ">Ты прижимаешь ее к своей промежности, потирая член между ее ягодиц."
                        call luna_main("...", 6, 3, 4, 5) 
                        m "Ну вот, [luna_name], еще немного."
                        call luna_main(".......", 8, 2, 2, 3) 
                        m "Ммммм, почти закончил..."
                        call luna_main("ЧТО?!!!", 4, 2, 3, 3) 
                        show screen blkfade
                        with d3 
                        "Полумна быстро отстраняется от тебя и встает на ноги."
                        #chibi stuff
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        hide screen blkfade
                        with d3 
                        call luna_main("Профессор!", 9, 1, 3, 14) 
                        m "И ради чего ты остановилась?"
                        call luna_main("Сидеть на коленях - это одно.", 8, 2, 2, 3) 
                        call luna_main("Но позволять вам делать это...", 9, 1, 3, 2) 
                        call luna_main("Я просто отказываюсь!", 8, 2, 3, 6) 
                        m "Прекрасно, прекрасно."
                        call luna_main("Честно, [l_genie_name], за кого вы меня принимаете?", 7, 1, 2, 2) 
                        call luna_main("Я думаю, что я бы хотела, что бы мне заплатили сейчас...", 7, 2, 2, 2) 
                    "-Пощупать ее-" if luna_grope:
                        ">Ты начинаешь пробегать своими руками по ее бедрам, вплоть до талии, а затем и по животу."
                        call luna_main("!!!", 4, 1, 1, 6) 
                        m "Ммммм... Прекрасно."
                        ">Ты продолжаешь тереться членом вдоль ее ягодиц."
                        m "Да, именно так, [luna_name]."
                        $ current_payout = 40
                        call luna_main("......", 6, 3, 4, 6) 
                        m "Боги, у тебя такая приятная попка."
                        ">Ты начинаешь медленно пододвигать руки к ее груди.."
                        call luna_main(".........", 6, 2, 4, 3) 
                        m "Ну вот, [luna_name], просто наслаждайся."
                        call luna_main("..................", 6, 2, 4, 2) 
                        ">Твои руки примерно, на дюйм ниже ее груди..."
                        m "Мммммм... Почти..."
                        call luna_main("..........................", 4, 2, 4, 2) 
                        ">Ты практически достиг ее груди......"
                        call luna_main("!!!!", 4, 1, 3, 6) 
                        show screen blkfade
                        with d3 
                        "Полумна быстро отскакивает от тебя и встает на ноги."
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        hide screen blkfade
                        with d3 
                        call luna_main("Профессор!", 4, 1, 3, 7) 
                        m "И почему ты остановилась?"
                        call luna_main("Сидеть на коленях - это одно!", 9, 1, 2, 3) 
                        call luna_main("Но, позволить вам прикасаться ко мне там...", 8, 2, 3, 2) 
                        call luna_main("Я не пойду на это!", 8, 2, 2, 3) 
                        m "Хорошо..."
                        call luna_main("Честно, [l_genie_name], вам действительно нужно научиться самоконтролю.", 8, 1, 3, 9) 
                        call luna_main("Я думаю, что хотела бы, чтобы мне прямо сейчас заплатили...", 8, 2, 2, 3) 



            "-Ничего не делать-" if luna_dom < 2:
                call luna_main("...", 7, 2, 2, 2) 
                call luna_main("......", 8, 2, 2, 3) 
                call luna_main("Я думаю, тогда начну...", 6, 2, 2, 2) 
                ">Полумна слегка присаживается на твои колени."
                m "Ммммм"
                call luna_main("...", 7, 1, 2, 2) 
                call luna_main("......", 8, 2, 2, 3) 
                call luna_main(".........", 8, 2, 3, 3) 
                call luna_main("Хорошо, время вышло!", 1, 2, 1, 2) 
                ">Полумна встает с твоих колен"
                m "Что? Ты же почти даже и не села!"
                call luna_main("*Хмм* Считайте, что вам повезло, вы получили то, что хотели, [l_genie_name]!", 8, 2, 2, 3) 
                m "Ты могла хотя бы немного подвигаться."
                call luna_main("Что? Да за кого вы меня принимаете? За какую-то блудницу, которая позволит вам тереться о нее столько, сколько вы захотите?", 9, 2, 2, 6) 
                m "Ну, я ожидал, по-крайней мере, нескольких минут."
                call luna_main("Ну, если вы столь безнадежны...", 5, 2, 1, 1) 
                ">Полумна шлепается своей попой на твою промежность."
                m "Ох..."
                call luna_main("Печально...", 5, 2, 2, 3) 
                ">Она начинает раскачиваться вперед-назад на твоих коленях."
                call luna_main("Вы и правда отвратительны, [l_genie_name]...", 5, 2, 1, 14) 
                m "Ммммм."
                call luna_main("Упрашивать своих студентов танцевать на коленях...", 8, 2, 3, 3) 
                m "Да, да..."
                call luna_main("А вам лучше доплатить сверху за это...", 7, 2, 1, 2) 
                m "Конечно..."
                call luna_main("...", 5, 3, 1, 2) 
                ">Полумна начинает двигать бедрами немного быстрее."
                call luna_main("Много доплатить...", 9, 2, 3, 3) 
                m "Конечно, [luna_name]..."
                call luna_main("Ну вот, [l_genie_name]. Просто наслаждайтесь...", 5, 2, 1, 1) 
                m "Ммммм, чуть сильнее..."
                call luna_main("...", 8, 3, 5, 3) 
                m "Да... Почти..."
                call luna_main("Время вышло!", 5, 2, 2, 1) 
                show screen blkfade
                with d3 
                ">Полумна быстро встает."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                m "Что!"
                call luna_main("Время {p}вышло...", 8, 1, 2, 2) 
                m "Ух, прекрасно."
                call luna_main("Рада, что вы понимаете,{p} теперь о моей оплате...", 8, 2, 2, 3) 
                $ current_payout = 120


            "-Ничего не делать-" if luna_dom >= 2:
                if luna_dom <= 3:
                    $ luna_dom += 1
                call luna_main("...", 7, 1, 2, 2) 
                call luna_main("......", 8, 2, 2, 3) 
                call luna_main("Наверное, я могу начать...", 6, 2, 2, 2) 
                ">Слегка присаживается к тебе на колени."
                m "Мммммм."
                ">Ты начинаешь ощущать, как член твердеет рядом с ее попкой."
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("Вы жалкий...", 5, 2, 2, 3) 
                call luna_main("Величайший волшебник в мире...", 5, 2, 1, 1) 
                call luna_main("Больше похоже на величайшего извращеница.", 9, 2, 2, 3) 
                if l_genie_name == "Старик":
                    $ l_genie_name = "Извращенец"
                ">Полумна медленно подпрыгивает на твоих коленях, поднимаясь и опускаясь на промежность."
                m "Да... Вот так."
                call luna_main("*Хммм* Вам ведь даже не стыдно, так?", 5, 2, 1, 14) 
                m "Чего?"
                call luna_main("Что? Умолять свою студентку танцевать на коленях.", 8, 2, 2, 3) 
                m "Не припоминаю, что бы я умолял."
                call luna_main("Хмммм...", 7, 2, 1, 2) 
                ">Полумна медленно встает."
                call luna_main("Ну, тогда...", 8, 2, 2, 3) 
                m "Что?"
                call luna_main("Умоляйте...", 5, 2, 3, 3) 
                menu:
                    "-Умолять-":
                        pass
                    "-Отказаться-":
                        m "Я так не думаю, [luna_name]."
                        call luna_main("*Хм* Прекрасно...", 9, 2, 2, 4) 
                        show screen blkfade
                        with d3
                        ">Полумна подходит к твоему столу."
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        hide screen blkfade
                        with d3 
                        call luna_main("Я хотела бы, что бы вы заплатили мне сейчас, [l_genie_name]...", 8, 1, 3, 3) 
                        $ current_payout = 100
                        m "Хорошо, хорошо. Вот твои галлеоны."
                        $ gold -= current_payout
                        $ luna_gold += current_payout
                        ">Ты отдаешь Полумне [current_payout] галлеонов."
                        call luna_main("Спасибо, [l_genie_name].", 7, 2, 2, 2) 
                        ">Полумна покидает твой кабинет."
                m "Пожалуйста..."
                call luna_main("Пожалуйста, что?", 5, 2, 1, 2) 
                m "Пожалуйста, продолжай, [luna_name]..."
                ">Полумна медленно опускается к тебе на колени."
                call luna_main("Так лучше, не правда ли?", 7, 2, 2, 1) 
                ">Она начинает качаться на твоих коленях вперед-назад."
                call luna_main("У вас такой твердый...", 5, 3, 1, 2) 
                m "Мммм..."
                call luna_main("Бьюсь об заклад, вы бы кончили, если бы я продолжила, не так ли...", 5, 2, 5, 2) 
                m "Да..."
                call luna_main("Хорошо, вы должны быть готовы доплатить за такую привилегию...", 7, 2, 2, 2) 
                m "Конечно..."
                call luna_main("...", 8, 2, 2, 3) 
                ">Полумна начинает покачивать бедрами вперед-назад, твой член зажат между ее ягодиц."
                m "Ах..."
                call luna_main("А {size=+5}много{/size} доплатите..?", 5, 2, 3, 3) 
                m "Конечно, [luna_name]..."
                call luna_main("Хорошо. Тогда просто наслаждайтесь...", 2, 2, 1, 1) 
                m "Ммм, еще немного..."
                call luna_main("...[l_genie_name]", 5, 2, 2, 2) 
                ">Полумна начинает сильнее тереться о твои колени."
                m "{size=-2}(Мммм...){/size}"
                call luna_main("Давайте же...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Уже почти...){/size}"
                call luna_main("Кончите на вашу маленькую девочку...", 9, 1, 4, 1) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                ">Ты начинаешь кончать на внутреннюю часть своей мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх! ДА!"
                call luna_main("Угх... Жалко...", 5, 2, 3, 1) 
                call luna_main("...", 8, 2, 2, 3) 
                call luna_main("......", 8, 3, 5, 2) 
                call luna_main(".........", 8, 3, 3, 3) 
                call luna_main("Хорошо, время вышло!", 5, 2, 2, 1) 
                ">Полумна встает с твоих колен."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                call luna_main("*хмпф* Вы, [l_genie_name]!", 9, 1, 2, 2) 
                m "Ты вряд ли можешь винить меня за это."
                call luna_main("Что? Это вы умоляли об этом, конечно это ваша вина...", 7, 2, 3, 3) 
                m "Ну, ты не должна была быть так хороша в этом."
                call luna_main("Я просто хотела убедиться, что заслужу награду.", 8, 1, 2, 3) 
                call luna_main("Кстати, говоря о ней...", 5, 2, 1, 1) 
                $ current_payout = 200


  
        m "Хорошо, хорошо. Вот твое золото."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты даешь Полумне [current_payout] галлеонов."
        if current_payout <= 50:
            call luna_main("(Только [current_payout]?) *хмпф*", 8, 2, 2, 3) 
            call luna_main("Спасибо вам, [l_genie_name].", 6, 2, 2, 2) 
        else:
            call luna_main("Спасибо вам, [l_genie_name].", 5, 2, 1, 1) 
        ">Полумна покидает твой кабинет."  

    elif luna_corruption <= 4: #SECOND TIME 
        if luna_corruption <= 4:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "Могу я предложить тебе другое место, [luna_name]?"
        if luna_sub > luna_dom:
            call luna_main("...", 1, 3, 4, 2) 
            call luna_main("Хорошо, [l_genie_name]...", 1, 2, 4, 2) 
            m "Хорошая девочка."
            call luna_main("...", 1, 3, 4, 3) 
        else:
            call luna_main("Хорошо...", 1, 2, 2, 2) 
            call luna_main("Но я рассчитываю на справедливую компенсацию, [l_genie_name]...", 7, 1, 2, 2) 
            m "Да, да..."
            call luna_main("...", 7, 2, 2, 2) 
        show screen blkfade
        with d3 
        ">Полумна обходит стол и встает перед тобой."
        #chibi stuff
        $ luna_flip = -1
        $ luna_xpos = 120
        $ luna_chibi_xpos = 300
        hide screen blkfade
        with d3 
        menu:
            "-Попросить ее для начала снять юбку-" if luna_sub >= 2:
                if luna_sub <= 3:
                    $ luna_sub += 1
                $ luna_grope = True
                m "Как насчет того, чтобы ты сняла свою юбку, прежде чем мы начнем?"
                call luna_main("!!!", 4, 2, 4, 2) 
                call luna_main("Вы ведь не серьезно, правда?", 6, 2, 4, 2) 
                m "Серьезно, [luna_name], или ты не хочешь, чтобы Хогвартс продолжал закупать новые копии \"Придиры\"?" 
                call luna_main("...", 6, 3, 4, 2) 
                call luna_main("......", 6, 2, 4, 2) 
                m "Я жду."
                call luna_main("Хорошо...", 6, 3, 4, 6) 
                hide screen luna 
                show screen blkfade
                with d3
                $ luna_wear_skirt = False
                ">Полумна медленно снимает юбку, обнажая черные шелковые трусики."
                show screen luna
                hide screen blkfade
                with d3
                m "Мне нравятся твои трусики..."
                call luna_main("...", 6, 3, 4, 2) 
                call luna_main("(Это так унизительно.)", 6, 3, 4, 6) 
                m "А теперь садись..."
                call luna_main("Да, [l_genie_name]...", 6, 2, 4, 2) 
                ">Полумна нежно усаживается к тебе на колени."
                call luna_main("...", 6, 3, 4, 3) 
                jump luna_lap_dance_2

            "-Попросить ее сесть-" if luna_sub >= luna_dom:
                $ luna_grope = False
                m "Давай же..."
                call luna_main("...", 8, 2, 4, 3) 
                call luna_main("......", 8, 2, 4, 3) 
                m "Садись, [luna_name]."
                call luna_main("...", 8, 2, 4, 3) 
                ">Полумна нежно усаживается к тебе на колени."
                m "Ммммм..."
                call luna_main("...", 6, 2, 4, 2) 
                call luna_main("(Угх, он такой твердый...)", 6, 3, 4, 6) 

                label luna_lap_dance_2:
                    m "Вот и все, теперь просто начинай двигать бедрами."
                ">Полумна постепенно начинает тереться талией об тебя."
                m "Угхх, да..."
                call luna_main("...", 8, 3, 4, 3) 
                call luna_main("Все в порядке?", 5, 2, 4, 2) 
                m "Да, просто продолжай..."
                call luna_main("Как долго?", 8, 1, 4, 3) 
                m "Столько, сколько потребуется, [luna_name]."
                call luna_main("Хорошо...", 8, 2, 4, 3) 
                call luna_main("...", 8, 3, 4, 3) 
                call luna_main("..........", 9, 3, 4, 3) 
                call luna_main("Можно ли как то ускорить этот процесс?", 6, 2, 4, 2) 
                menu:
                    "-Наслаждаться-":
                        $ current_payout = 65
                        m "Просто продолжай делать то, что делаешь..."
                        call luna_main("...", 6, 3, 4, 6) 
                        call luna_main("А как начет этого?", 5, 2, 4, 2) 
                        ">Полумна начинает слегка покачивать попкой, пока двигается назад-вперед."
                        m "Мммм, да!"
                        ">Ты начинаешь сильнее прижимать ее."
                        call luna_main("...", 6, 3, 4, 5) 
                        m "Вот так, [luna_name], осталось недолго."
                        call luna_main(".......", 5, 2, 4, 2) 
                        m "Мммм, уже почти..."
                        call luna_main("Уже?", 4, 2, 4, 3) 
                        m "Почти... Это очень приятно..."
                        call luna_main("Это?", 5, 2, 4, 1) 
                        m "Да, просто продолжай двигать своей прекрасной попкой...."
                        call luna_main("...", 5, 2, 4, 1) 
                        call luna_main("Вот так?", 5, 3, 4, 5) 
                        ">Она начинает двигаться вперед-назад на коленях."
                        m "Мммммм."
                        call luna_main("Вы такой твердый, [l_genie_name]...", 5, 3, 4, 1) 
                        m "Мммм"
                        call luna_main("Вы, уже почти?", 5, 2, 4, 2) 
                        m "Да..."
                        call luna_main("Ну, я ожидаю-", 5, 2, 2, 3) 
                        m "Тссс, не порти момент."
                        call luna_main("...", 8, 2, 4, 3) 
                        ">Полумна начинает качать бедрами вперед-назад, зажав твой член меж ягодиц."
                        m "Ах..."
                        call luna_main("...", 5, 2, 4, 3) 
                        m "Продолжай, [luna_name]..."
                        call luna_main("........", 3, 2, 4, 1) 
                        m "Ммм, еще немного..."
                        call luna_main("...[l_genie_name]...", 7, 3, 4, 2) 
                        ">Полумна начинает усиленно тереться о твои колени."
                        m "{size=-2}(Мммм...){/size}"
                        call luna_main("......", 6, 1, 4, 1) 
                        g4 "{size=+4}(Агх... Почти...){/size}"
                        $ luna_tears = 1
                        call luna_main("............", 9, 1, 4, 1) 
                        g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                        ">Ты начинаешь кончать во внутреннюю сторону мантии."
                        hide screen luna
                        with d3
                        show screen white 
                        pause.1
                        hide screen white
                        pause.2
                        show screen white 
                        pause .1
                        hide screen white
                        with hpunch
                        g4 "Argh! ДА!"
                        $ luna_tears = 0
                        call luna_main("Угх...", 5, 2, 4, 1) 
                        call luna_main("...", 8, 2, 4, 3) 
                        call luna_main("......", 8, 3, 4, 2) 
                        call luna_main(".........", 5, 3, 4, 3) 
                        call luna_main("Вы закончили, [l_genie_name]?", 5, 2, 4, 1) 
                        m "Почти... Просто останься еще не надолго..."
                        call luna_main("......", 5, 2, 4, 1) 
                        ">Полумна ждет еще несколько секунд, прежде чем встать."
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        $ luna_wear_skirt = True
                        hide screen blkfade
                        with d3 
                        call luna_main("Это все, [l_genie_name]?", 9, 1, 4, 2) 
                        m "Да, спасибо тебе, [luna_name]."
                        call luna_main("Пожалуйста, [l_genie_name].", 7, 2, 4, 3) 
                        call luna_main("Тогда мне лучше пойти на занятия..", 8, 1, 4, 3) 
                        m "Не хочешь сперва получить оплату?"
                        call luna_main("Ох, верно...", 5, 2, 4, 1) 
                    "-Пощупать ее-" if luna_grope:
                        $ current_payout = 35
                        ">Ты начинаешь двигать руками вдоль ее бедер."
                        call luna_main("...", 4, 1, 4, 6) 
                        m "Мммм, великолепно."
                        ">Ты продолжаешь тереться членом о ее попку."
                        call luna_main("....", 5, 2, 4, 6) 
                        m "Да, вот так, [luna_name]."
                        "Ты двигаешь руками до ее талии."
                        call luna_main("......", 6, 3, 4, 6) 
                        m "Господи, какая у тебя замечательная задница."
                        $ luna_tears = 1
                        call luna_main("С-спасибо, [l_genie_name]...", 2, 2, 4, 3) 
                        ">Ты начинаешь медленно двигать руками вверх по ее гладкому животику."
                        call luna_main(".........", 6, 2, 4, 3) 
                        m "Вот так, [luna_name], просто наслаждайся..."
                        $ luna_tears = 0
                        call luna_main("..................", 6, 2, 4, 2) 
                        ">Твои руки примерно на дюйм ниже ее груди..."
                        m "Мммм, почти..."
                        call luna_main("..........................", 4, 2, 4, 2) 
                        ">Ты быстро поднимаешь руки и хватаешь ее упругие груди через жилет."
                        call luna_main("!!!!", 4, 1, 3, 6) 
                        "Полумна быстро пытается оторваться от тебя."
                        menu: 
                            "-Отпустить ее-":
                                $ current_payout = 55
                                ">Полумна быстро вскакивает и отбегает за стол."
                                $ luna_flip = 1
                                $ luna_xpos = 600
                                $ luna_chibi_xpos = 500
                                $ luna_wear_skirt = True
                                hide screen blkfade
                                with d3 
                                call luna_main("Профессор!", 4, 1, 3, 7) 
                                call luna_main("Хватать меня не было частью сделки!", 8, 2, 3, 2) 
                                m "Я просто не смог устоять..."
                                call luna_main("*хмпф*", 8, 2, 2, 3) 
                                m "Мои извинения, [luna_name]."
                                call luna_main("Все в порядке... Просто не хватайте меня снова!", 8, 1, 3, 9) 
                                call luna_main("Думаю, я хочу чтобы вы заплатили мне сейчас ...", 8, 2, 2, 3) 
                            "-Держать ее-":
                                if luna_sub <= 4:
                                    $ luna_sub += 1
                                call luna_main("Профессор!", 4, 1, 3, 7) 
                                call luna_main("Я ухожу!", 8, 2, 3, 2) 
                                m "Подожди немного, [luna_name]..."
                                ">Ты начинаешь тереться своим твердым членом между ее просторными ягодиц."
                                call luna_main("!!!", 4, 3, 4, 3) 
                                call luna_main("Я настаиваю, чтобы вы меня отпустили!", 4, 2, 3, 4) 
                                m "Если ты сейчас уйдешь, то можешь забыть о том, что Хогвартс закупит газету твоего отца, [luna_name]."
                                call luna_main("...", 6, 3, 4, 3) 
                                $ luna_tears = 1
                                call luna_main("Вы отвратительны, [l_genie_name]...", 8, 2, 2, 3) 
                                ">Ты пару раз сильно сжимаешь ее сиськи..."
                                call luna_main("Ах{image=textheart}...", 7, 3, 4, 3) 
                                call luna_main("Это неправильно...", 7, 2, 4, 3) 
                                m "Я знаю, знаю... Но устоять сложно..."
                                call luna_main(".................", 5, 3, 4, 2) 
                                call luna_main("....................Ах...{image=textheart}", 5, 3, 4, 14) 
                                call luna_main("[l_genie_name], вам нужно остановиться...", 7, 2, 4, 3) 
                                m "Еще немного..."
                                $ luna_tears = 2
                                call luna_main("Пожалуйста...", 7, 3, 4, 3) 
                                m "Мммм, думаю, да..."
                                ">Ты в последний раз сжимаешь ее грудь..."
                                call luna_main("Ах...", 7, 3, 4, 3) 
                                ">Полумна быстро встает и отходит к столу."
                                $ luna_flip = 1
                                $ luna_tears = 1
                                $ luna_xpos = 600
                                $ luna_chibi_xpos = 500
                                $ luna_wear_skirt = True
                                hide screen blkfade
                                with d3 
                                call luna_main("Профессор!", 4, 1, 3, 7) 
                                call luna_main("Хватать меня не было частью сделки!", 8, 2, 3, 2) 
                                m "Прости, [luna_name], я не мог с собой ничего поделать.."
                                call luna_main(".......в следующий раз попытайтесь удержать себя в руках...", 8, 1, 3, 9) 
                                m "Так ты хочешь следующего раза?"
                                call luna_main("До тех пор, пока мне платят.", 8, 2, 2, 3) 
                                call luna_main("Говоря об этом...", 8, 1, 2, 3) 
                                call luna_main("Могу я получить свою плату?", 8, 3, 4, 3) 


            "-Ничего не делать-" if luna_sub <= luna_dom:
                call luna_main("...", 7, 1, 2, 2) 
                call luna_main("......", 8, 2, 2, 3) 
                call luna_main("Полагаю, мне нужно начинать...", 6, 2, 2, 2) 
                ">Полумна слегка присаживается на колени."
                m "Мммм."
                ">Ты начинаешь чувствовать, что снова твердеешь из-за ее попки."
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("Вы такой жалкий...", 5, 2, 2, 3) 
                call luna_main("Величайший волшебник мира...", 5, 2, 1, 1) 
                call luna_main("Больше похож на величайшего во всем мире извращенца.", 9, 2, 2, 3) 
                if luna_name == "Мисс Лавгуд":
                    $ luna_name = "Принцесса"
                ">Полумна медленно подпрыгивает на твоих коленях, поднимаясь и опускаясь на тебя."
                m "Да... вот так."
                call luna_main("*Хмпф*. Вам ведь даже не стыдно, правда?", 5, 2, 3, 14) 
                m "О чем ты?"
                call luna_main("О чем? О попрошайничестве танцев вашего ученика на коленях.", 8, 2, 2, 3) 
                m "Не припоминаю, чтобы умолял."
                call luna_main("Хммм...", 7, 2, 1, 2) 
                ">Полумна медленно встает."
                call luna_main("Тогда...", 8, 2, 2, 3) 
                m "Что?"
                call luna_main("Умоляйте...", 5, 2, 3, 3) 
                m "Пожалуйста..."
                call luna_main("Что пожалуйста?", 5, 2, 1, 2) 
                m "Пожалуйста, продолжай, [luna_name]..."
                ">Полумна медленно садиться обратно на колени."
                call luna_main("Так лучше, не так ли?", 7, 2, 2, 1) 
                ">Она начала качаться вперед-назад на твоих коленях."
                call luna_main("Угх, вы такой твердый...", 9, 3, 3, 3) 
                m "Мммм."
                call luna_main("Уверена, вы кончите, если я продолжу, не так ли?...", 5, 2, 2, 1) 
                m "Да..."
                call luna_main("Ну, тогда будьте готовы доплачивать за такую привилегию...", 7, 2, 2, 2) 
                m "Конечно..."
                call luna_main("...", 8, 2, 2, 3) 
                ">Полумна начинает раскачивать своими бедрами вперед-назад, зажав твой член меж ягодиц."
                m "Ах..."
                call luna_main(" {size=+5}Много{/size} дополнительных..?", 5, 2, 3, 1) 
                m "Конечно, [luna_name]..."
                call luna_main("Хорошо. Тогда просто наслаждайтесь...", 2, 2, 1, 1) 
                m "Ммм, еще немного..."
                call luna_main("...[l_genie_name]", 5, 2, 2, 1) 
                ">Полумна начинает сильнее тереться о твои колени."
                m "{size=-2}(Мммм...){/size}"
                call luna_main("Давай...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Почти...){/size}"
                call luna_main("Кончите для своей принцессы...", 9, 1, 4, 1) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                ">Ты начинаешь кончать во внутреннюю сторону мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх! ДА!"
                call luna_main("Мммм... Жалко...", 5, 2, 3, 1) 
                call luna_main("...", 7, 2, 2, 3) 
                call luna_main("......", 8, 3, 3, 2) 
                call luna_main(".........", 9, 3, 3, 3) 
                call luna_main("Хорошо, время вышло!", 5, 2, 2, 1) 
                ">Полумна встает с твоих коленей."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                call luna_main("*Хмпф* Вы противны, [l_genie_name]!", 9, 1, 2, 2) 
                m "Вряд ли ты можешь меня винить за это."
                call luna_main("Что? Это вы умоляли меня об этом, конечно ваша вина.", 7, 2, 3, 3) 
                m "Ну, ты не должна была быть так хороша в этом."
                call luna_main("Я просто хотела убедиться, что получу награду.", 8, 1, 2, 1) 
                call luna_main("Говоря о ней...", 5, 2, 1, 1) 
                $ current_payout = 200


            "-Попросить вежливо-" if luna_dom >= 2:
                if luna_dom <= 3:
                    $ luna_dom += 1
                m "Можешь присесть на мои колени, пожалуйста, [luna_name]?"
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Ну, раз уж вы так вежливо попросили...", 6, 2, 1, 1) 
                ">Полумна слегка присела на твои колени."
                m "Мммм"
                ">Ты начинаешь чувствовать, что снова твердеешь из-за ее попки."
                call luna_main("...", 5, 3, 2, 1) 
                call luna_main("Вы такой жалкий...", 5, 2, 2, 1) 
                call luna_main("Величайший волшебник мира...", 5, 2, 1, 1) 
                call luna_main("Больше похож на величайшего во всем мире извращенца.", 9, 3, 2, 1) 
                if l_genie_name == "Старик":
                    $ l_genie_name = "Извращенец"
                ">Полумна медленно подпрыгивает на твоих коленях, приподнимаясь на корточках."
                m "Да... Вот так."
                call luna_main("*Хмпф* Вам ведь даже не стыдно, правда?", 5, 3, 2, 14) 
                m "О чем ты?"
                call luna_main("О чем? О попрошайничестве танцев вашего ученика на коленях.", 8, 2, 2, 1) 
                m "Не припоминаю, чтобы умолял."
                call luna_main("Хммм...", 5, 2, 2, 1) 
                ">Полумна медленно встает."
                call luna_main("Тогда...", 8, 2, 2, 3) 
                m "Что?"
                call luna_main("Умоляйте...", 5, 2, 3, 3) 
                m "Пожалуйста..."
                call luna_main("Что пожалуйста?", 5, 1, 5, 1) 
                m "Пожалуйста, продолжай, [luna_name]..."
                ">Полумна медленно садиться обратно на колени."
                call luna_main("Так лучше, не правда ли?", 7, 2, 2, 1) 
                ">Она начала качаться вперед-назад на твоих коленях."
                call luna_main("Вы такой твердый...", 5, 3, 3, 1) 
                m "Мммм."
                call luna_main("Уверена, вы кончите, если я продолжу, не так ли?...", 5, 2, 5, 1) 
                m "Да..."
                call luna_main("Ну, тогда будьте готовы доплачивать за такую привилегию...", 7, 2, 2, 1) 
                m "Конечно..."
                call luna_main("...", 8, 2, 2, 1) 
                ">Полумна начинает раскачивать своими бедрами вперед-назад, твой член зажат между ее ягодиц."
                m "Ах..."
                call luna_main(" {size=+5}Много{/size} дополнительных..?", 5, 3, 3, 1) 
                m "Конечно, [luna_name]..."
                call luna_main("Хорошо. Тогда просто наслаждайтесь...", 2, 2, 2, 1) 
                m "Ммм, еще немного..."
                call luna_main("...[l_genie_name]", 5, 2, 1, 1) 
                ">Полумна начинает сильнее тереться о твои колени."
                m "{size=-2}(Мммм...){/size}"
                call luna_main("Давай...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Почти...){/size}"
                call luna_main("Кончите для вашей маленькой девочки...", 9, 1, 4, 14) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                ">Ты начинаешь кончать во внутреннюю сторону мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх! Да!"
                call luna_main("Угх... Жалко...", 5, 2, 3, 1) 
                call luna_main("...", 7, 2, 2, 3) 
                call luna_main("......", 8, 3, 5, 1) 
                call luna_main(".........", 9, 2, 3, 1) 
                ">Полумна продолжает тереться своей попкой о твой чувствительный член."
                g11 "Угх, уже достаточно, [luna_name]."
                call luna_main("Кто сказал, что вы решаете, когда это закончится?", 9, 2, 2, 3) 
                ">Полумна начинает двигать бедрами, сосредотачиваясь на головке твоего члена."
                g11 "Ах, пожалуйста, не после того, как я кончил."
                call luna_main("Правда?", 8, 2, 5, 1) 
                call luna_main("Но вы звучали так искренне, когда просили об этом.", 5, 2, 4, 14) 
                call luna_main("Неужели вы не хотите, чтобы это уже закончилось?", 5, 2, 2, 1) 
                ">Она сильнее толкает твой член."
                g11 "Ах..."
                call luna_main("Вот так, [l_genie_name], просто наслаждайтесь.", 8, 3, 2, 1) 
                g11 "Не могу, я слишком чувствителен..."
                call luna_main("Не думаю, что это мои проблемы.", 8, 2, 4, 1) 
                ">Она начинает двигаться так быстро, как только может."
                g11 "{size=-2}Аххх...{/size}"
                call luna_main("Давайте, [l_genie_name]...", 9, 2, 2, 1) 
                g11 "{size=+4}Агххх!{/size}"
                call luna_main("Кончите еще раз, грязной спермой...", 9, 2, 3, 1) 
                g4 "{size=+4}*Аргх!* Это слишком!{/size}"
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 9, 3, 3, 1) 
                ">Ты снова кончаешь во внутреннюю часть своей промокшей мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх!"
                call luna_main("Хороший мальчик...", 5, 2, 3, 1) 
                ">Полумна встает с твоих колен."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                call luna_main("*Хмпф* Вы противный старик, [l_genie_name]!", 9, 1, 2, 1) 
                m "Ах..."
                call luna_main("Слишком сильное наслаждение, не так ли?", 7, 2, 3, 1) 
                m "Это было слишком, [luna_name]..."
                call luna_main("Перестаньте жаловаться. Я просто хотела убедиться, что получу награду.", 8, 1, 2, 1) 
                call luna_main("Говоря о ней...", 5, 2, 1, 1) 
                $ current_payout = 250


        if luna_dom >= luna_sub:
            m "Хорошо, хорошо. Вот твое золото."
        else:
            m "Вот твоя плата, [luna_name]."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты передаешь Полумне [current_payout] галеонов."
        if current_payout <= 50:
            call luna_main("(Только [current_payout]?) *хмпф*", 8, 2, 2, 3) 
            call luna_main("Спасибо вам, [l_genie_name].", 6, 2, 2, 2) 
        else:
            call luna_main("Спасибо вам, [l_genie_name].", 5, 2, 1, 1) 
        ">Полумна покидает твой кабинет."  

    elif luna_corruption >= 5 and luna_corruption < 13: #THIRD TIME 
        if luna_corruption <= 5:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "Могу я предложить тебе другое место, [luna_name]?"
        if luna_sub > luna_dom:
            call luna_main("...", 1, 3, 4, 2) 
            call luna_main("Хорошо, [l_genie_name]...", 1, 2, 4, 2) 
            m "Хорошая девочка."
            call luna_main("...", 1, 3, 4, 3) 
        else:
            call luna_main("Отлично...", 1, 2, 2, 2) 
            call luna_main("Но я ожидаю, что получу справедливую компенсацию, [l_genie_name]...", 7, 1, 2, 2) 
            m "Да, да..."
            call luna_main("...", 7, 2, 2, 2) 
        show screen blkfade
        with d3 
        ">Полумна обходит стол и встает перед тобой."
        #chibi stuff
        $ luna_flip = -1
        $ luna_xpos = 120
        $ luna_chibi_xpos = 300
        hide screen blkfade
        with d3 
        menu:
            "-Притянуть на колени-" if luna_sub >= 3:
                if luna_sub <= 4:
                    $ luna_sub += 1
                $ luna_grope = True
                ">Ты хватаешь Полумну за талию и сильно тянешь на колени."
                call luna_main("!!!", 4, 2, 4, 2) 
                call luna_main("Не нужно быть таким напористыми, [l_genie_name]!", 7, 2, 4, 4) 
                m "Прости, мне сложно удержаться, когда передо мной такая страстная сучка. Ты ведь не против?" 
                call luna_main("...", 6, 3, 4, 1) 
                call luna_main("......", 5, 2, 4, 2) 
                m "Ты..?"
                call luna_main("{size=-5}Нет...{/size}", 6, 3, 4, 2) 
                call luna_main("...", 6, 2, 4, 2) 
                m "Что нет?"
                call luna_main("{size=-5}Нет... Сэр...{/size}", 6, 3, 4, 6) 
                m "Хорошая девочка..."
                ">Ты сильно толкаешь свой член к ее заднице."
                call luna_main("Ах... спасибо, [l_genie_name]...", 6, 3, 4, 1) 
                call luna_main("...", 6, 3, 4, 3) 
                jump luna_lap_dance_3

            "-Сказать ей сесть-" if luna_sub >= luna_dom:
                $ luna_grope = False
                if luna_sub <= 3:
                    $ luna_sub += 1
                m "Ты знаешь, что дел-"
                ">Полумна быстро садится на колени, слегка извиваясь, пока твой член не оказывается между ее ягодиц."
                call luna_main("(Ах...{image=textheart})", 8, 3, 4, 1) 
                call luna_main("......", 4, 2, 4, 3) 
                m "Кто-то сегодня нетерпелив..."
                call luna_main("...", 8, 3, 4, 3) 
                ">Полумна начинает нежно раскачивать бедра назад-вперед."
                m "Ммммм..."
                call luna_main("...", 6, 2, 4, 2) 
                call luna_main("(Он такой твердый...{image=textheart})", 6, 3, 4, 1) 

                label luna_lap_dance_3:
                    m "Вот так, теперь просто начни двигать задницей немного быстрее."
                ">Полумна начинает настойчиво тереться своей упругой попкой об тебя."
                m "Мммм, вот так."
                call luna_main("...", 8, 3, 4, 3) 
                call luna_main("Это приятно?", 5, 2, 4, 2) 
                m "Да, продолжай..."
                call luna_main("Как долго?", 8, 1, 4, 3) 
                m "Сколько потребуется, [luna_name]."
                call luna_main("Отлично...", 8, 2, 4, 3) 
                call luna_main("...", 8, 3, 4, 3) 
                call luna_main("..........", 9, 3, 4, 3) 
                call luna_main("Можно как-то ускорить этот процесс?", 6, 2, 4, 1) 
                call luna_main("Не то, чтобы я хотела, чтобы это закончилось...", 6, 3, 4, 1) 
                call luna_main("Просто люди начнут задавать вопросы, если-", 5, 2, 4, 2) 
                menu:
                    "-Наслаждаться-":
                        $ current_payout = 75
                        m "Тссс... Просто продолжай делать, что делаешь..."
                        call luna_main("...", 6, 3, 4, 6) 
                        call luna_main("Как насчет этого?", 5, 3, 4, 2) 
                        ">Полумна начинает слегка трясти попкой, пока качается назад-вперед."
                        m "Мммм, да."
                        ">Ты начинаешь слегка засовывать в нее."
                        call luna_main("...", 6, 3, 4, 4) 
                        m "Вот так, [luna_name], еще немного."
                        call luna_main(".......", 5, 2, 4, 2) 
                        m "Мммм, почти..."
                        call luna_main("Готово?", 4, 2, 4, 3) 
                        m "Почти... Это правда приятно..."
                        call luna_main("Вот так?", 5, 2, 4, 1) 
                        m "Да, просто продолжай двигать своей превосходной маленькой попкой..."
                        call luna_main("...", 5, 2, 4, 1) 
                        call luna_main("А если так?", 5, 3, 4, 5) 
                        ">Она начинает качаться назад-вперед на коленях."
                        m "Ммммм"
                        call luna_main("Вы такой твердый, [l_genie_name]...", 5, 3, 4, 1) 
                        m "Мммм"
                        call luna_main("Вы уже почти?", 5, 2, 4, 1) 
                        m "Да..."
                        call luna_main("Ну, я ожидаю-", 5, 2, 2, 3) 
                        m "Тссс, не порти момент."
                        call luna_main("...", 8, 2, 4, 3) 
                        ">Полумна начинает качать бедрами вперед-назад, зажав твой член меж ягодиц."
                        m "Ах..."
                        call luna_main("...", 5, 2, 4, 3) 
                        m "Продолжай, [luna_name]..."
                        call luna_main("........", 3, 2, 4, 1) 
                        m "Мммм, еще немного..."
                        call luna_main("...[l_genie_name]...", 7, 3, 4, 1) 
                        ">Полумна начинает тереться у тебя на коленях."
                        m "{size=-2}(Мммм...){/size}"
                        call luna_main("......", 6, 1, 4, 1) 
                        g4 "{size=+4}(Агх... Почти...){/size}"
                        $ luna_tears = 1
                        call luna_main("............", 9, 1, 4, 1) 
                        g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
                        ">Ты начинаешь кончать во внутреннюю сторону мантии."
                        hide screen luna
                        with d3
                        show screen white 
                        pause.1
                        hide screen white
                        pause.2
                        show screen white 
                        pause .1
                        hide screen white
                        with hpunch
                        g4 "Аргх! ДА!"
                        $ luna_tears = 0
                        call luna_main("Угх...", 5, 2, 4, 1) 
                        call luna_main("...", 8, 2, 4, 3) 
                        call luna_main("......", 8, 3, 4, 2) 
                        call luna_main(".........", 5, 3, 4, 3) 
                        call luna_main("Теперь вы закончили, [l_genie_name]?", 5, 2, 4, 1) 
                        m "Почти... Просто посиди немного дольше..."
                        call luna_main("Хорошо......", 5, 3, 4, 1) 
                        ">Полумна ждет несколько секунд, прежде чем встать."
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        $ luna_wear_skirt = True
                        hide screen blkfade
                        with d3 
                        call luna_main("Это все, [l_genie_name]?", 9, 1, 4, 1) 
                        m "Да, спасибо тебе, [luna_name]."
                        call luna_main("Пожалуйста, [l_genie_name].", 7, 2, 4, 3) 
                        call luna_main("Ну, тогда мне лучше пойти на занятия.", 8, 1, 4, 3) 
                        m "Не хочешь сначало получить плату?"
                        call luna_main("Ох, верно...", 5, 2, 4, 1) 
                    "-Пощупать ее-" if luna_grope:
                        $ current_payout = 35
                        ">Ты начинаешь запускать руки вдоль внешней стороны бедер."
                        call luna_main("Ах...{image=textheart}", 4, 1, 4, 1) 
                        m "Мммм, великолепно."
                        ">Ты продолжаешь тереться своим членом о ее ягодицы."
                        call luna_main("....", 5, 3, 4, 6) 
                        m "Да, вот так, [luna_name]..."
                        "Ты двигаешь руками к ее коленям, как раз у края юбки."
                        call luna_main("......", 6, 3, 4, 1) 
                        m "Господи, у тебя такие красивые ноги."
                        $ luna_tears = 1
                        call luna_main("С-спасибо, [l_genie_name]...", 2, 2, 4, 2) 
                        ">Ты начинаешь медленно двигать руки назад к ее талии, слегка приподнимая юбку, когда движешься."
                        call luna_main(".........", 6, 2, 4, 3) 
                        m "Вот так, [luna_name], просто наслаждайся..."
                        $ luna_tears = 0
                        call luna_main("..................", 6, 2, 4, 2) 
                        ">Ты двигаешь руками к ее бедрам..."
                        m "Мммм, вот так..."
                        call luna_main("..........................", 4, 2, 4, 2) 
                        ">Возбуждаясь, ты начинаешь поглаживать изнутри ее бедра."
                        call luna_main("!!!!", 4, 1, 3, 6) 
                        $ luna_tears = 1
                        if luna_sub <= 4:
                            $ luna_sub += 1
                        call luna_main("Профессор...", 4, 1, 3, 7) 
                        call luna_main("Пожалуйста...", 8, 2, 3, 2) 
                        m "Еще немного, [luna_name]..."
                        ">Ты начинаешь сильнее тереться своим твердым членом между ее ягодиц."
                        call luna_main("...", 4, 3, 4, 3) 
                        call luna_main("[l_genie_name]...", 8, 2, 2, 3) 
                        ">Ты слегка начинаешь бегать кончиками пальцев вверх-вниз по ее бедрам..."
                        call luna_main("Ах{image=textheart}...", 7, 3, 4, 3) 
                        $ luna_tears = 2
                        call luna_main("[l_genie_name]... Это неправильно...", 7, 2, 4, 3) 
                        m "Ты, кажется, не возражаешь..."
                        call luna_main("(Я позволю ему продолжить еще немного...)", 5, 3, 4, 2) 
                        call luna_main("(А потом остановлю).......Ах...{image=textheart}", 5, 3, 4, 14) 
                        call luna_main("[l_genie_name], сколько времени вам нужно?...", 7, 2, 4, 3) 
                        m "Еще немного..."
                        ">Полумна продолжает тереть своей попкой около твоего чувствительного члена."
                        m "Угх, Вот так, [luna_name]."
                        call luna_main("П-пожалуйста поспешите, [l_genie_name]...", 9, 2, 4, 3) 
                        m "Ну, я думаю, что знаю способ немного ускориться."
                        call luna_main("Правда?", 8, 2, 4, 1) 
                        call luna_main("Что-", 5, 2, 4, 14) 
                        ">Ты быстро поднимаешь руки и хватаешь ее упругую грудь через ее жилет."
                        call luna_main("!!!!", 4, 1, 3, 6) 
                        ">Тело Полумны дрожит, когда ее бедра вращаются на тебе."
                        m "Ммм, вот так, [luna_name]..."
                        call luna_main("...", 8, 3, 4, 1) 
                        m "Я думаю, кое-кто наслаждается этим."
                        call luna_main("Что?", 8, 2, 4, 1) 
                        call luna_main("Думаете, мне это нравится? Чувствовать, как ваш отвратительный старый член трется об меня?", 8, 3, 4, 1) 
                        m "{size=-2}Аххх...{/size}"
                        call luna_main("Пока вы лапаете меня, как отвратительный старый извращенец?", 9, 6, 4, 1) 
                        m "{size=+4}Агххх!{/size}"
                        call luna_main("Вы действительно отвратительный старик, не так ли...", 9, 2, 4, 1) 
                        g4 "{size=+4}*Аргх!* Вот так, [luna_name]! Уже совсем скоро!{/size}"
                        call luna_main("!!!!", 4, 3, 4, 6) 
                        ">Ты начинаешь массивно кончать на попку Полумны."
                        hide screen luna
                        with d3
                        show screen white 
                        pause.1
                        hide screen white
                        pause.2
                        show screen white 
                        pause .1
                        hide screen white
                        with hpunch
                        g4 "Argh!"
                        call luna_main(".....", 8, 3, 4, 1) 
                        ">Полумна встает с твоих колен."
                        $ luna_flip = 1
                        $ luna_xpos = 600
                        $ luna_chibi_xpos = 500
                        hide screen blkfade
                        with d3 
                        call luna_main("*Хмпф*", 9, 1, 2, 1) 
                        m "Ах... Господи, это было хорошо."
                        $ luna_tears = 1 
                        call luna_main("Думаю, сейчас я хочу уйти, [l_genie_name]...", 5, 2, 1, 1) 

            "-Вежливо попросить-" if luna_dom >= luna_sub:
                if luna_dom <= 3:
                    $ luna_dom += 1
                m "Можешь, пожалуйста, сесть на мои колени, [luna_name]?"
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Ну, раз уж вы так вежливо попросили...", 6, 2, 1, 1) 
                ">Полумна слегка садится на колени."
                m "Мммм."
                ">Ты начинаешь чувствовать, что снова твердеешь из-за ее попки."
                call luna_main("...", 5, 3, 2, 1) 
                call luna_main("Вы такой жалкий...", 5, 2, 2, 1) 
                call luna_main("Величайший волшебник мира...", 5, 2, 1, 1) 
                call luna_main("Больше похож на величайшего во всем мире извращенца.", 9, 3, 2, 1) 
                if l_genie_name == "Старик":
                    $ l_genie_name = "Извращенец"
                ">Полумна медленно подпрыгивает на твоих коленях, поднимая свой вес на корточки."
                m "Да... Вот так."
                call luna_main("*Хмпф* Вам ведь даже не стыдно, правда?", 5, 3, 2, 14) 
                m "О чем ты?"
                call luna_main("О чем? О попрошайничестве танцев вашего ученика на коленях.", 8, 2, 2, 1) 
                m "Не припоминаю, чтобы умолял."
                call luna_main("Хмммм...", 5, 2, 2, 1) 
                ">Полумна медленно встает."
                call luna_main("Тогда...", 8, 2, 2, 3) 
                m "Что?"
                call luna_main("Умоляйте...", 5, 2, 3, 3) 
                m "Пожалуйста..."
                call luna_main("Что пожалуйста?", 5, 1, 5, 1) 
                m "Пожалуйста, продолжай, [luna_name]..."
                ">Полумна медленно садиться обратно на колени."
                call luna_main("Так лучше, не правда ли?", 7, 2, 2, 1) 
                ">Она начала качаться вперед-назад на твоих коленях."
                call luna_main("Вы такой твердый...", 5, 3, 3, 1) 
                m "Мммм."
                call luna_main("Уверена, вы кончите, если я продолжу, не так ли?...", 5, 2, 5, 1) 
                m "Да..."
                call luna_main("Ну, тогда будьте готовы доплачивать за такую привилегию...", 7, 2, 2, 1) 
                m "Конечно..."
                call luna_main("...", 8, 2, 2, 1) 
                ">Полумна начинает раскачивать своими бедрами вперед-назад, зажав твой член меж ягодиц."
                m "Ах..."
                call luna_main(" {size=+5}много{/size} дополнительных...", 5, 3, 3, 1) 
                m "Конечно, [luna_name]..."
                call luna_main("Хорошо. Тогда просто наслаждайтесь...", 2, 2, 2, 1) 
                m "Ммм, еще немного..."
                call luna_main("...[l_genie_name]", 5, 2, 1, 1) 
                ">Полумна начинает сильнее тереться о твои колени."
                m "{size=-2}(Мммм...){/size}"
                call luna_main("Давай...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Почти...){/size}"
                call luna_main("Кончите для вашей маленькой девочки...", 9, 1, 4, 14) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                ">Ты начинаешь кончать во внутреннюю сторону мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Argh! ДА!"
                call luna_main("Угх... Жалко...", 5, 2, 3, 1) 
                call luna_main("...", 7, 2, 2, 3) 
                call luna_main("......", 8, 3, 5, 1) 
                call luna_main(".........", 9, 2, 3, 1) 
                ">Полумна продолжает тереться своей попкой о твой чувствительный член."
                g11 "Угх, уже достаточно, [luna_name]."
                call luna_main("Кто сказал, что вы решаете, когда это закончится?", 9, 2, 2, 3) 
                ">Полумна начинает двигать бедрами, сосредотачиваясь на головке твоего члена."
                g11 "Ах, пожалуйста, не после того, как я кончил."
                call luna_main("Правда?", 8, 2, 5, 1) 
                call luna_main("Но вы звучали так искренне, когда просили об этом.", 5, 2, 4, 14) 
                call luna_main("Неужели вы не хотите, чтобы это уже закончилось?", 5, 2, 2, 1) 
                ">Она сильнее толкает твой член."
                g11 "Ах..."
                call luna_main("Вот так, [l_genie_name], просто наслаждайтесь.", 8, 3, 2, 1) 
                g11 "Не могу, я слишком чувствителен..."
                call luna_main("Не думаю, что это мои проблемы.", 8, 2, 4, 1) 
                ">Она начинает двигаться так быстро, как только может."
                g11 "{size=-2}Аххх...{/size}"
                call luna_main("Давайте, [l_genie_name]...", 9, 2, 2, 1) 
                g11 "{size=+4}Агххх!{/size}"
                call luna_main("Кончите еще раз, своей грязной спермой...", 9, 2, 3, 1) 
                g4 "{size=+4}*Аргх!* Это слишком!{/size}"
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 9, 3, 3, 1) 
                ">Ты снова кончаешь во внутреннюю часть своей промокшей мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Argh!"
                call luna_main("Хороший мальчик...", 5, 2, 3, 1) 
                ">Полумна встает с твоих колен."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                call luna_main("*Хмпф* Вы противный старик, [l_genie_name]!", 9, 1, 2, 1) 
                m "Ах..."
                call luna_main("Слишком сильное наслаждение, не так ли?", 7, 2, 3, 1) 
                m "Это было слишком, [luna_name]..."
                call luna_main("Перестаньте жаловаться. Я просто хотела убедиться, что получу награду.", 8, 1, 2, 1) 
                call luna_main("Говоря о ней...", 5, 2, 1, 1) 
                $ current_payout = 250


            "-Умолять-" if luna_dom >= 3:
                if luna_dom <= 3:
                    $ luna_dom += 1
                m "Можешь присесть на мои колени, пожалуйста, [luna_name]?"
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Продолжайте...", 6, 2, 1, 1) 
                m "Пожалуйста, принцесса, разместите свою идеальную маленькую попку на моих коленях..."
                call luna_main("Так-то лучше...", 6, 2, 1, 1) 
                ">Полумна слегка садится на колени."
                m "Мммм."
                ">Ты начинаешь чувствовать, что снова твердеешь из-за ее попки."
                call luna_main("...", 5, 3, 2, 1) 
                call luna_main("Вот так, [l_genie_name]...", 5, 2, 1, 1) 
                call luna_main("Просто расслабьтесь и наслаждайтесь...", 5, 2, 1, 1) 
                call luna_main("Наслаждайтесь ощущениями своего отвратительного старого члена, касающегося меня...", 9, 3, 2, 1) 
                ">Полумна поднимает бедра назад-вперед..."
                m "Ах..."
                call luna_main("*Хмпф* Это так... Расскажите мне, насколько хорошо это чувство.", 5, 3, 2, 14) 
                m "Ч-что?"
                call luna_main("Расскажите мне, насколько приятно меня трогать своим грязным членом...", 8, 2, 2, 1) 
                m "..."
                call luna_main("Давайте, иначе...", 5, 2, 2, 1) 
                ">Полумна начинает медленно вставать."
                m "Хорошо... Я расскажу."
                ">Полумна садится обратно на колени."
                call luna_main("Хороший мальчик...", 5, 2, 1, 1) 
                m "Это как будто я трусь об... Облако..."
                call luna_main("Облако?", 5, 2, 5, 3) 
                m "Я имею в виду, это мягко..."
                ">Полумна медленно трется об твой болт."
                call luna_main("Полагаю, это лучше, чем ничего.", 7, 2, 5, 1) 
                m "Мммм, продолжай, [luna_name]..."
                call luna_main("Извращенец...", 9, 2, 3, 1) 
                m "Да..."
                call luna_main("Вы хоть знаете, сколько мне лет?", 7, 2, 2, 1) 
                m "Конечно..."
                call luna_main("Хорошо...", 8, 2, 2, 1) 
                ">Полумна начинает раскачивать бедра вперед-назад, зажав твой член меж ягодиц."
                m "Ах... 18?"
                call luna_main("{size=-5}18?{/size} Вы не выглядите уверенным в сказанном, [l_genie_name]...", 5, 3, 3, 1) 
                m "..."
                call luna_main("Что, если мне 17?", 9, 2, 4, 1) 
                m "Ммм..."
                call luna_main("Бьюсь об заклад, что это просто сделает вас тверже, не так ли?", 5, 2, 1, 2) 
                ">Полумна начинает сильнее тереться о твои колени."
                m "{size=-2}(Мммм...){/size}"
                call luna_main("Давайте...", 9, 1, 2, 1) 
                g4 "{size=+4}(Агх... Почти...){/size}"
                call luna_main("Кончите для вашей маленькой девочки...", 9, 1, 4, 14) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                ">Ты начинаешь кончать во внутреннюю сторону мантии."
                hide screen luna
                with d3
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                g4 "Аргх... ДА!"
                call luna_main("Угх... Жалко...", 5, 2, 3, 1) 
                call luna_main("...", 7, 2, 2, 3) 
                call luna_main("......", 8, 3, 5, 1) 
                call luna_main(".........", 9, 2, 3, 1) 
                ">Полумна продолжает тереться своей попкой о твой чувствительный член."
                g11 "Угх, больше не нужно, [luna_name]."
                call luna_main("Хороший мальчик...", 5, 2, 3, 1) 
                ">Полумна встает с твоих колен."
                $ luna_flip = 1
                $ luna_xpos = 600
                $ luna_chibi_xpos = 500
                hide screen blkfade
                with d3 
                call luna_main("*Хмпф* Вы противный старик, [l_genie_name]!", 9, 1, 2, 1) 
                call luna_main("Но, думаю, я не против получить свою награду.", 8, 1, 2, 1) 
                call luna_main("Кстати, говоря о ней...", 5, 2, 1, 1) 
                $ current_payout = 250


        if luna_dom >= luna_sub:
            m "Хорошо, хорошо. Вот твое золото."
        else:
            m "Вот твоя оплата, [luna_name]."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты передаешь Полумне [current_payout] галеонов."
        if current_payout <= 50:
            call luna_main("(Только [current_payout]?) *Хмпф*", 8, 2, 2, 3) 
            call luna_main("Спасибо вам, [l_genie_name].", 6, 2, 2, 2) 
        else:
            call luna_main("Спасибо вам, [l_genie_name].", 5, 2, 1, 1) 
        ">Полумна покидает твой кабинет."  
    
    else: #Hermione involved
        play music "music/Chipper Doodle v2.mp3" fadein 1 fadeout 1 
        m "Могу я предложить тебе другое место, [luna_name]?"
        call luna_main("Так вы хотите еще один танец на коленях...", 5, 1, 2, 2) 
        m "Если это не слишком большая проблема..."
        call luna_main("Ничуть...", 5, 2, 1, 1) 
        call luna_main("Но только для веселья... Почему бы вам не позвать сюда Гермиону?", 7, 3, 4, 1) 
        m "Правда?"
        call luna_main("...", 7, 1, 2, 2) 
        m "Хорошо, я не собираюсь отказываться!"
        call luna_main("Замечательно... Позвольте мне сначала занять позицию...", 5, 1, 2, 1) 
        show screen blkfade
        with d3 
        ">Полумна обходит стол и встает перед тобой."
        #chibi stuff
        $ luna_flip = -1
        $ luna_xpos = 120
        $ luna_chibi_xpos = 300
        hide screen blkfade
        with d3 
        ">Полумна слегка садиться к тебе на колени."
        m "Мммм."
        ">Ты начинаешь чувствовать, что снова твердеешь из-за ее попки."
        call luna_main("Продолжайте... Позовите ее сюда...", 8, 2, 2, 3) 
        ">Ты вызываешь Гермиону в свой кабинет."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        call update_her_uniform 
        pause
        call her_main("Здравствуйте, профессор!","base","closed") 
        call her_main("Эй, Полумна! О, так ты сегодня танцуешь на коленях?","smile","happyCl",emote="06") 
        call luna_main("Если можно так сказать...", 5, 2, 2, 2) 
        call luna_main("Большую часть времени он просто заставляет меня тереться об него, пока он кончает на мантию...", 1, 3, 1, 1) 
        call luna_main("И мне так стыдно перед эльфами, которые потом чистят мою одежду...", 8, 3, 2, 1) 
        ">Полумна начинает подпрыгивать на твоих коленях, при этом твой член сильнее трется о ее попку."
        call her_main("Ммм, тогда зачем вы позвали меня?","base","glance") 
        m "Ах... Спроси Полумну..."
        call luna_main("Вообщем я подумала, может ты устроишь ему шоу, пока я танцую на его члене...", 4, 2, 4, 2) 
        call her_main("Мммм, что ты имеешь в виду?","base","suspicious") 
        call luna_main("Может устроишь ему шоу со своими прекрасными сиськами...", 1, 2, 4, 1) 
        m "Ах... да..."
        call her_main("Может быть...","base","down") 
        call her_main("Но ты уверена что это нужно?","base","suspicious") 
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png" 
        call luna_main("Что?", 4, 1, 4, 15) 
        ">Полумна начинает прыгать еще быстрее."
        call luna_main("О чем ты говоришь?", 4, 3, 4, 2) 
        call her_main("По его взгляду я вижу, что тебе не нужна помощь, твоя задница прекрасно справляется с его членом...","open","down") 
        call her_main("И если я тут только для того, чтобы показать свои сиськи...","base","glance") 
        call her_main("Это значит, что это ты, хочешь на меня посмотреть...","base","suspicious") 
        call her_main("И я не возражаю...","smile","baseL") 
        call her_main("Я просто хочу, чтобы ты призналась...","base","squint") 
        call luna_main("...", 8, 2, 4, 2) 
        call luna_main("Хорошо...", 8, 3, 4, 3) 
        call her_main("Скажи это...","base","suspicious") 
        call luna_main("Я хочу посмотреть на твои сиськи!", 2, 1, 4, 15) 
        ">Гермиона быстро снимает свой верх и лифчик ."
        $ hermione_wear_top = False
        $ hermione_wear_bra = False
        call update_her_uniform 
        call her_main("Видишь, это не так сложно?!","base","suspicious") 
        call luna_main("Нет...", 5, 1, 4, 1) 
        ">Полумна замедляется, и твой член, нащупывает ее мягкую впадинку.."
        call her_main("Вы два изврашенца, которые пялятся на меня! Просто откинься на его члене и расслабся...","base","down") 
        call h_action("lift_breasts") 
        call her_main("И можешь смотреть на меня сколько захочешь?","grin","baseL") 
        call luna_main("Да, Гермиона...", 1, 1, 4, 1) 
        m "Да..."
        call luna_main("Мммм, такой твердый...", 5, 3, 4, 1) 
        call h_action("pinch") 
        call her_main("Я могу себе представить.","grin","dead") 
        m "Угх..."
        call luna_main("Он, вероятно, собирается скоро кончить...", 8, 2, 4, 1) 
        m "Точно..."
        call her_main("А как насчет тебя?","base","glance") 
        call h_action("covering") 
        call her_main("Как ты себя чувствуешь?","base","down") 
        call luna_main("Хорошо...", 5, 3, 4, 1) 
        call luna_main("...", 8, 9, 4, 1) 
        ">Полумна изгибается на тебе и быстрее сжимает член своими бедрами..."
        ">Ты чувствуешь, как влага из ее киски просачивается через твою одежду."
        m "Ах..."
        call h_action("pinch") 
        call her_main("Хорошо...","open","baseL") 
        call luna_main("Ах...", 7, 9, 4, 1) 
        ">Полумна начинает тереться еще жестче о твои колени."
        m "{size=-2}(мммм...){/size}"
        call luna_main("да...", 5, 9, 4, 1) 
        call h_action("lift_breasts") 
        call her_main("Посмотрите, как весело! Вы вместе кончаете?","base","glance") 
        g4 "{size=+4}Ах... уже совсем скоро...{/size}"
        call luna_main("Я-я тоже...", 5, 9, 4, 1) 
        call h_action("pinch") 
        call her_main("Кончайте для меня, гадкие извращенцы!","base","suspicious") 
        g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
        call luna_main("Ах...{image=textheart}{image=textheart}{image=textheart}", 9, 9, 4, 15) 
        ">Ты начинаешь кончать на внутреннюю подкладку своей мантии и чувствуешь, как там уже мокро от киски Полумны."
        hide screen luna
        with d3
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "АРГХ! ДАА!"
        call luna_main("Ухх... невероятно...", 5, 9, 4, 1) 
        call h_action("covering") 
        call her_main("Мммм...","base","glance") 
        call luna_main("...", 5, 9, 4, 1) 
        call luna_main("......", 7, 3, 4, 1) 
        call luna_main(".........", 5, 2, 4, 1) 
        ">Полумна медлено продолжает гладить твой член своей чувствительной киской..."
        g4 "Ух... Отлично, [luna_name]."
        call luna_main("Хорошо...", 1, 3, 4, 2) 
        ">Полумна встает с твоих колен"
        $ luna_flip = 1
        $ luna_xpos = 600
        $ luna_chibi_xpos = 500
        hide screen blkfade
        with d3 
        $ hermione_wear_top = True
        $ hermione_wear_bra = True
        call update_her_uniform 
        call h_action("none") 
        call her_main("Вам обоим хорошо?","base","glance") 
        call luna_main("Да...", 8, 9, 4, 1) 
        m "Ах... мои шлюшки..."
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png" 
        call her_main("Ну что же, у нас с Полумной, впереди уроки. Можете ли вы сейчас заплатить нам, [genie_name]?","base","down") 


        m "Хорошо, хорошо. Вот ваше золото и очки."
        $ gryffindor += 25
        $ ravenclaw += 25
        m "15 очков \"Гриффиндору\" и \"Когтеврану\"."
        $ gold -= 80
        $ luna_gold += 40
        m "И вот ваши галлеоны."
        ">Ты даешь по 40 галеонов Гермионе и Полумне."
        call her_main("Спасибо [genie_name]!","base","base") 
        call luna_main("...Спасибо сэр.", 5, 2, 4, 2) 
        ">Гермиона и Полумна уходят из твоего кабинета, обсуждая произошедшее."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        hide screen luna
        hide screen luna_chibi
        $ luna_busy = True
        hide screen genie_jerking_sperm_02     
        jump end_hg_pf

    hide screen genie_jerking_sperm_02    
    jump luna_away



label luna_favour_3: #STRIP FOR ME - Это как одолжение с тремя вариантами для каждого пути. 
    if luna_corruption <= 8:
        $ luna_corruption += 1
    if luna_corruption >= 13:
        m "Что ты думаешь о стриптизе?"
        call luna_main("Чего?", 7, 1, 2, 2) 
        call luna_main("Разве мы это еще не проходили?", 8, 1, 5, 2) 
        m "Что тогда ты хочешь сделать?"
        call luna_main("...", 5, 2, 2, 2) 
        call luna_main("Как насчет еще одного минета?", 5, 1, 2, 1) 
        m "Уговорила..."
        jump luna_favour_6
    call play_music("chipper_doodle") 
    if luna_corruption < 8:
        if luna_sub > luna_dom and luna_corruption < 5:
            m "Ты когда-нибудь была голой перед другим человеком, [luna_name]?"
            call luna_main("Что?", 1, 3, 4, 2) 
            call luna_main("Ну... эм... думаю нет", 1, 2, 4, 2) 
            m "Ну, тогда это будет у тебя в первый раз!!"
            call luna_main("...", 1, 3, 4, 3) 
        elif luna_sub > luna_dom :
            m "Как ты будешь снимать свою одежду, она ведь очень узкая, [luna_name]?"
            call luna_main("...", 1, 3, 4, 2) 
            call luna_main("Ну... {size=-3}она{/size} {size=-4}не{/size} {size=-5}такая уж{/size} {size=-6}и{/size} {size=-7}узкая.{/size}", 1, 2, 4, 2) 
            m "..."
            call luna_main("Ладно, [l_genie_name]...", 1, 3, 4, 3) 
            hide screen luna
            with d3
            $ luna_xpos = 270
            ">Полумна встала прямо перед твоим столом."
            call luna_main("...", 1, 2, 4, 3) 
        else:
            m "Ты не против раздеться для меня, [luna_name]?"
            call luna_main("Я полагаю...", 1, 2, 2, 2) 
            call luna_main("Нет, пока вы мне {i}платите...{/i}", 7, 1, 2, 2) 
            m "Да, [luna_name]..."
            call luna_main("...Извращенец...", 7, 2, 2, 2) 
            hide screen luna
            with d3
            $ luna_xpos = 270
            ">Полумна встала прямо перед твоим столом."
            call luna_main("...", 7, 2, 2, 2) 
        menu:
            "\"Снимай юбку.\"" if luna_sub >= 5:
                $ luna_choice = 1
                call luna_main("Вы хотите, чтобы я сняла свою юбку?", 4, 1, 4, 4) 
                m "Да... Думаешь, тебе хватит смелости?"
                call luna_main("Конечно я справлю-", 7, 2, 4, 2) 
                m "Прекрасно! Тогда приступай, я хочу посмотреть..."
                call luna_main("...", 3, 3, 4, 2) 
                call luna_main("Хорошо... (Надеюсь, он не ожидает, что я и трусики стану снимать)", 7, 3, 4, 4) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_skirt = False
                ">Полумна медленно начинает расстегивать юбку..."
                ">Она кажется очень нерешительной и не торопится..."
                ">Наконец, молния расстегивается, и у нее нет выбора, кроме как ее снять..."
                ">Полумна снимает юбку и бросает ее на стол."
                show screen luna
                hide screen blkfade
                with d3
                call luna_main("Ну как... Теперь вы довольны, [l_genie_name]?", 8, 3, 4, 3) 
                m "Почти... Снимай рубашку."
                call luna_main("...Хорошо...", 6, 2, 4, 6) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_top = False
                ">Полумна начинает расстегивать рубашку..."
                ">Она медленно возится с пуговицами, и наконец, последняя пуговица расстегнута...."
                ">Полумна медленно снимает рубашку и кидает ее поверх юбки."
                show screen luna
                hide screen blkfade
                with d3

            "\"Снимай рубашку.\"" if luna_sub > luna_dom:
                $ luna_choice = 2
                call luna_main("Рубашку?", 7, 1, 4, 2) 
                m "Я что, не ясно выразился, [luna_name]?"
                call luna_main("Нет...", 8, 2, 4, 2) 
                m "Тогда почему бы тебе ее не снять, чтобы я смог взглянуть на тебя..."
                call luna_main("...", 9, 3, 4, 3) 
                call luna_main("Хорошо... (Надеюсь, он не ожидает, что я и лифчик стану снимать.)", 7, 2, 4, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_top = False
                ">Полумна начинает расстегивать рубашку..."
                ">Она медленно возится с пуговицами, и наконец, последняя пуговица расстегнута...."
                ">Полумна медленно снимает рубашку и кладет ее на стол."
                show screen luna
                hide screen blkfade
                with d3
                pause
                call luna_main("Ну как... Теперь вы доволны, [l_genie_name]?", 9, 1, 4, 2) 
                m "Почти... теперь снимай юбку."
                call luna_main("...Хорошо...", 7, 2, 4, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_skirt = False
                ">Полумна медленно начинает расстегивать юбку..."
                ">Она кажется очень нерешительной и не торопится..."
                ">Наконец, молния расстегивается, и у нее нет выбора, кроме как снять юбку..."
                ">Полумна медленно снимает юбку и бросает ее на рубашку."
                show screen luna
                hide screen blkfade
                with d3

            "\"Пожайлуста, сними рубашку.\"" if luna_dom >= luna_sub:
                $ luna_choice = 3
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Хорошо, раз вы так вежливо попросили, я полагаю, это справедливо...", 6, 2, 1, 1) 
                m "Спасибо [luna_name]."
                call luna_main("(Кто бы мог подумать, что это будет так легко...)", 7, 2, 1, 1) 
                call luna_main("Теперь... Закройте глаза...", 8, 1, 2, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_top = False
                ">Ты слышишь, как она расстегивает свою одежду..."
                ">Ты слышишь, как она положила свою рубашку и жилет на стол..."
                m "..."
                m "Могу я открыть глаза, [luna_name]?"
                lun "Еще секунду..."
                lun "Хорошо, все готово."
                show screen luna
                hide screen blkfade
                with d3 
                pause

            "\"Пожайлуста, сними рубашку [luna_name]...\"" if luna_dom >= 5:
                $ luna_choice = 4
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Хорошо, раз вы так вежливо попросили, я полагаю, это справедливо...", 6, 2, 1, 1) 
                m "Спасибо, [luna_name]."
                call luna_main("(Кто бы мог подумать, что это будет так легко...)", 7, 2, 1, 1) 
                call luna_main("Теперь... Закройте глаза...",8, 1, 2, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_skirt = False
                ">Ты слышишь, как она расстегивает свою одежду..."
                ">Ты слышишь, как она положила рубашку и жилет на стол..."
                m "..."
                m "Могу я открыть глаза, [luna_name]?"
                lun "Еще секунду..."
                lun "Хорошо, все готово."
                show screen luna
                hide screen blkfade
                with d3 
                pause

        if luna_choice <= 2: #luna sub choices
            if luna_sub <= 5:
                $ luna_sub += 1
            m "Хорошо... Теперь нижнее белье..."
            call luna_main("!!!", 4, 1, 4, 2) 
            call luna_main("Вы ведь не серьезно?", 7, 2, 4, 2) 
            m "Я серьезно. И я жду, что ты это сделаешь, [luna_name]."
            call luna_main("[l_genie_name]!", 8, 1, 3, 3) 
            m "Не повышай на меня голос, [luna_name]!"
            call luna_main(".....?!!", 7, 2, 4, 2) 
            m "Никто не заставляет тебя это делать."
            call luna_main("Но-", 5, 2, 4, 2) 
            m "Я делаю тебе и твоей семье одолжение!"
            m "Так что, если ты не считаешь, что твой отец нуждается в помощи со своим провальным журналом, пожалуйста, уходи."
            call luna_main(".....................", 6, 2, 4, 3) 
            call luna_main(".......................................", 7, 3, 4, 2) 
            $ luna_tears = 1
            call luna_main("Пожалуйста, [l_genie_name]...", 8, 1, 4, 2) 
            call luna_main("Может я смогу, сделать что-то другое...", 9, 2, 4, 2) 
            menu:
                "-Стриптиз-" if luna_choice == 1:
                    $ current_payout = 40
                    m "Теперь снимай белье [luna_name]..."
                    call luna_main("{size=-5}(Я правда должна?){/size}", 9, 3, 4, 2) 
                    call luna_main("[l_genie_name], я не уверена... ", 8, 1, 4, 2) 
                    if daytime:
                        m "Давай, [luna_name], я совсем немного посмотрю и ты отправишься на свои занятия."
                    else:
                        m "Давай, [luna_name], я совсем немного посмотрю и ты отправишься спать."
                    call luna_main("Хорошо, [l_genie_name]... ", 9, 3, 4, 2) 
                    call luna_main("(Стриптиз для директора...)", 9, 2, 4, 2) 
                    call luna_main("(Представляю если папа узнает...)", 9, 3, 4, 2) 
                    call luna_main("......", 9, 1, 4, 2) 
                    hide screen luna
                    show screen blkfade
                    with d3
                    $ luna_wear_bra = False
                    ">Полумна медленно расстегивает бюстгальтер и кладет его на стол."  
                    show screen luna
                    hide screen blkfade
                    with d3
                    m "Мммм, очень хорошо [luna_name]."
                    m "Теперь трусики..."
                    $ luna_tears = 2
                    call luna_main("Да, [l_genie_name]... ", 8, 2, 4, 3) 
                    hide screen luna
                    show screen blkfade
                    with d3
                    $ luna_wear_panties = False
                    ">Полумна слегка наклоняется в сторону так, чтобы ты не мог увидеть ее киску..."
                    ">Она очень неохотно и медленно стягивает вниз свои трусики..."
                    ">Полумна медленно снимает свои трусики и ложит их поверх кучи своей одежды на твоем столе." 
                    show screen luna
                    hide screen blkfade
                    with d3
                    pause
                    call luna_main("...", 9, 3, 4, 3) 
                    m "Очень хорошо..."
                    call luna_main("М-могу я уже одеться... Здесь малость прохладно.", 9, 2, 4, 2) 
                    m "Мммм... Какой приятный образ."
                    call luna_main("!!!", 4, 1, 2, 3) 
                    call luna_main("Все, довольно! Долго мне еще так стоять!", 9, 1, 3, 2) 

                "-Начать трогать себя-":
                    $ current_payout = 65
                    m "Хм..."
                    hide screen blktone
                    with d3
                    ">Ты достаешь свой член и берешь его в руку..."
                    hide screen blktone8
                    with d3
                    hide screen genie
                    show screen genie_jerking_off
                    with d3
                    pause 
                    m "Так лучше, [luna_name]?"
                    call luna_main("{size=-3}Я полагаю, да...{/size}", 6, 3, 4, 3) 
                    m "Хорошо, если это делает тебя счастливой..."
                    ">Ты начинаешь дрочить быстрее."
                    call luna_main("...", 6, 3, 4, 3) 
                    m "Да... Ах, да, так хорошо..."
                    $ luna_tears = 3
                    call luna_main("Прекрасно! Продолжайте дрочить на меня, [l_genie_name]!", 6, 3, 4, 3) 
                    call luna_main("Наслаждайтесь лаская свой грязный, старый член, пока вы заставляете меня здесь стоять...", 6, 1, 3, 3) 
                    m "{size=-4}(Мммм... Да...){/size}"
                    m "Мне так нравится смотреть на то, как ты стоишь тут... Почему бы тебе немного не потрясти своими сиськами?"
                    call luna_main("*hmph*...", 7, 1, 2, 2) 
                    ">Полумна качает грудью из стороны в сторону."
                    call luna_main("Ну что ж...", 7, 3, 3, 2) 
                    ">Ты продолжаешь дрочить, глядя на прыгающие сиськи Полумны..."
                    m "Чуть-чуть быстрее..."
                    call luna_main("*hmph*... Лучше вы дрочите быстрее [l_genie_name]...", 6, 3, 4, 3) 
                    ">Полумна начинает трясти грудью немного быстрее"
                    m "{size=-4}Ах...{/size}"
                    m "Вот так шлюха... Продолжай..."
                    call luna_main("........", 8, 1, 3, 2) 
                    m "{size=-4}(Архх... Да...){/size}"
                    call luna_main("(Он собирается кончить на меня меня...)", 7, 3, 4, 2) 
                    m "{size=-4}Да...{/size}"
                    call luna_main("(Я должна остановиться.)", 9, 2, 4, 3) 
                    g4 "{size=+2}Мммм... Вот так продолжай трясти своими сиськами...{/size}"
                    call luna_main(".........", 5, 1, 4, 1) 
                    g4 "{size=+4}(Агх... уже почти...){/size}"
                    call luna_main("(Слишком поздно...)", 9, 3, 4, 1) 
                    g4 "{size=+4}(ДА! ДА! ДА!) *Аргх!*{/size}"
                    hide screen luna
                    with d3
                    show screen white 
                    pause.1
                    hide screen white
                    pause.2
                    show screen white 
                    pause .1
                    hide screen white
                    with hpunch
                    g4 "Аргх! ДА!"
                    hide screen luna
                    with d3
                    hide screen bld1
                    with d3
                    show screen genie_jerking_sperm
                    with d3
                    show screen bld1
                    with d3
                    call luna_main("Ух... Так много...", 8, 3, 4, 2) 
                    call luna_main("{size=-5}(Как обычно...){/size}", 8, 2, 4, 1) 
                    show screen genie_jerking_sperm_02
                    with d3
                    g4 "Хорошая работа, шлюха... Ах, черт, мне так хорошо..."
                    show screen genie
                    hide screen bld1
                    #show screen genie_jerking_off
                    with d3
                    call luna_main("......", 7, 1, 4, 2) 
                    m "Ах... Ты молодец, [luna_name]..."

            hide screen luna
            show screen blkfade
            with d3
            $ luna_wear_skirt = True
            $ luna_wear_top = True
            $ luna_wear_bra = True
            $ luna_wear_panties = True
            ">Полумна быстро берет свою одежду со стола и одевается."
            show screen luna
            hide screen blkfade
            with d3
            call luna_main("Думаю, теперь я могу уйти, [l_genie_name]...", 7, 3, 4, 2) 
            m "Ты можешь уйти когда захочешь, [luna_name]."
            call luna_main("Теперь я не уйду, пока вы мне не заплатите!", 9, 1, 2, 3) 


        else:
            call luna_main("Вы это хотели увидеть, [l_genie_name]?", 7, 1, 2, 2) 
            g4 "Боже да!"
            if luna_dom <= 5:
                $ luna_dom += 1
            call luna_main("Хорошо... Вижу вы наслаждаетесь этим только своими глазами...", 5, 1, 2, 1) 
            m "Что?"
            call luna_main("Почему вы не начинаете... Ласкать... Себя, [l_genie_name]...", 5, 3, 2, 1) 
            m "Я даже не знаю-"
            call luna_main("Это не вопрос, [l_genie_name]...", 8, 1, 2, 2) 
            hide screen blktone
            with d3
            ">Ты достаешь свой член и берешь его в руку..."
            hide screen blktone8
            with d3
            hide screen genie
            show screen genie_jerking_off
            with d3
            pause  
            call luna_main("Вот так...", 8, 1, 4, 1) 
            call luna_main("Вам хорошо сейчас?", 8, 2, 4, 1) 
            m "Мммм... Да..."
            call luna_main("Хммм, мне так не кажется.", 9, 1, 4, 3) 
            call luna_main("Возможно, вам нужно немного поддержки...", 9, 2, 4, 1) 
            m " Поддержки?"
            call luna_main("Закройте глаза, [l_genie_name]...", 9, 1, 4, 1) 
            hide screen luna
            show screen blkfade
            with d3
            $ luna_chibi("stand_naked")
            if luna_wear_top:
                $ luna_wear_panties = False
            else:
                $ luna_wear_bra = False
            ">Ты слышишь как она раздевается..."
            ">Ты чувствуешь как что-то мягкое падает тебе на грудь..."
            m "???"
            m "Теперь можно открыть глаза, [luna_name]?"
            lun "Открывайте, [l_genie_name]..."
            show screen luna
            hide screen blkfade
            with d3 
            g9 "!!!"
            call luna_main("Как вам, то что вы видите?", 9, 2, 4, 1) 
            g9 "..."
            ">Ты начинаешь дрочить свой член с новой силой."
            call luna_main("Я полагаю это \'да\'...", 8, 1, 2, 1) 
            g9 "Ага... да... это просто прекрасно..."
            call luna_main("Хорошо... Ласкайте свой член для меня...", 9, 1, 2, 1) 
            if luna_wear_panties:
                call luna_main("Если будете хорошим мальчиком, возможно, я позволю вам кончить на свой лифчик...", 8, 2, 2, 1) 
            else:
                call luna_main("Если будете хорошим мальчиком, возможно, я позволю вам кончить на свои трусики...", 8, 2, 2, 1) 
            g9 "Да, [luna_name]!"
            call luna_main("Держу пари, вы от такого тащитесь", 7, 1, 2, 1) 
            m "Да..."
            call luna_main("Тогда вы можете кончить своей грязной спермой на мое белье...", 8, 3, 4, 1) 
            m "..."
            call luna_main("Хорошо, [l_genie_name]...", 9, 1, 4, 1) 
            call luna_main("Продолжайте ласкать этот отвратительный член...", 9, 1, 2, 1) 
            m "{size=-4}(Аргх... да...){/size}"
            call luna_main("Вам нужно больше стимуляции, [l_genie_name]..?", 8, 1, 3, 1) 
            m "{size=-4}Да...{/size}"
            call luna_main("Скажие громче...", 8, 1, 3, 1) 
            g9 "{size=+4}Да{/size}"
            call luna_main("Хорошо, закройте глаза...", 9, 1, 3, 1) 
            hide screen luna
            show screen blkfade
            with d3
            if luna_wear_panties:
                $ luna_wear_skirt = False
            else:
                $ luna_wear_top = False
            ">Ты слышишь мягкий шорох одежды..."
            m "{size=-2}(Мммм...){/size}"
            lun "Открывайте глаза, [l_genie_name]..."
            show screen luna
            hide screen blkfade
            with d3 
            pause
            m "{size=+2}Да...{/size}"
            call luna_main("Вы любите это, не так ли...", 9, 1, 2, 1) 
            g4 "{size=+4}(agh...){/size}"
            ">Ты начинаешь мастурбировать еще быстрее!"
            g4 "{size=+4}Да...{/size}"
            call luna_main("Это [l_genie_name], сперма для вашей принцессы?", 9, 1, 4, 1) 
            g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
            g4 "{size=+4}(Ах... Все...){/size}"
            call luna_main("Сперма...", 9, 1, 3, 14) 
            if luna_wear_panties:
                call luna_main("{size=+4}Сперма для моего лифчика!{/size}", 9, 1, 3, 14) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
                ">Ты берешь лифчик Полумны и начинаешь мастурбировать им свой член."
            else:
                call luna_main("{size=+4}Сперма для моих трусиков!{/size}", 9, 1, 3, 14) 
                g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
                ">Ты хватаешь трусики Полумны и начинаешь мастурбировать ими свой член."
            hide screen luna
            with d3
            show screen white 
            pause.1
            hide screen white
            pause.2
            show screen white 
            pause .1
            hide screen white
            with hpunch
            g4 "Ох! Да!"
            hide screen luna
            with d3
            hide screen bld1
            with d3
            show screen genie_jerking_sperm
            with d3
            show screen bld1
            with d3
            call luna_main("Вот и все, [l_genie_name], вы получили, что хотели...", 9, 1, 3, 1) 
            show screen genie_jerking_sperm_02
            with d3
            g4 "Ах, черт, они такие мягкие, почему это так приятно..."
            show screen genie
            hide screen bld1
            #show screen genie_jerking_off
            with d3
            call luna_main("Ммм...", 8, 1, 3, 1) 
            m "Ах..."
            call luna_main("Продолжайте, выпустите все до последней капли.", 8, 3, 4, 1) 
            m "Ах... Спасибо..."
            call luna_main("Спасибо...?", 9, 1, 5, 3) 
            m "Спасибо, принцесса..."
            $ luna_name = "Принцесса"
            call luna_main("*hmph*", 9, 2, 2, 2) 
            call luna_main("Я вижу вы... Закончили... Я полагаю мне лучше одеться.", 7, 2, 2, 2) 

            hide screen luna
            with d3

            if luna_wear_panties:
                ">Полумна быстро поднимает свою одежду с твоего стола и одевается, за исключением бюстгальтера, покрытого спермой."
            else:
                ">Полумна быстро поднимает одежду с твоего стола и одевается, оставив покрытые спермой трусики."
            $ luna_wear_skirt = True
            $ luna_wear_top = True
            $ luna_wear_bra = True
            $ luna_wear_panties = True
            show screen luna
            with d3
            m "Разве ты не собираешься их надеть?"
            call luna_main("Зачем? И рисковать испортить улику?", 9, 1, 5, 3) 
            m "Улику..."
            call luna_main("Не волнуйтесь, мне просто нужно немного ...Страховки... ", 7, 2, 4, 1) 
            m "Страховка? От чего?"
            call luna_main("На случай, если бы я попыталась рассказать Министерству Магии, что здесь происходит, меня бы высмеяли и выгнали.", 8, 1, 5, 1) 
            call luna_main("Но теперь...", 7, 1, 2, 1) 
            ">Она болтает перед тобой в пропитанной спермой, белье."
            call luna_main("Это будет доказательством моих слов.", 7, 3, 2, 1) 
            m "Как они узнают, что это мое? Это может быть чья угодно сперма!"
            call luna_main("Пожалуйста... На втором курсе нас учат опознавательным заклинаниям. Даже Невилл Долгопупс сможет узнать, что она ваша.", 9, 1, 3, 1) 
            m "(Черт, если она на самом деле попытается, вдруг у нее может получиться, но я на самом деле не Дамблдор или как там его зовут...)"
            m "Так ты собираешься рассказать им все?"
            call luna_main("Что? Конечно нет.", 9, 2, 1, 1) 
            call luna_main("Пока вы ведете себя хорошо...", 9, 1, 1, 1) 
            m "И что это означает?"
            call luna_main("Ну, во-первых, сначала мы поговорим о том, сколько вы заплатите.", 9, 2, 1, 1) 
            call luna_main("300 золотых, справедливо как по мне... {p}Что думаешь?", 9, 1, 2, 1) 
            m "Звучит... Справедливо..."
            call luna_main("Я рада, что мы смогли прийти к соглашению.", 8, 2, 4, 1) 
            m "Да, [luna_name]..."
            call luna_main("А вы хороший мальчик... Теперь, поговорим о деньгах.", 9, 1, 2, 2) 
            $ current_payout = 300
    

    else: ###THIRD TIME EVENT IS RUN
        if luna_sub > luna_dom :
            m "Ты ведь не против снова раздеться, правда?, [luna_name]?"
            call luna_main("...", 1, 2, 4, 2) 
            call luna_main("Ну... {size=-3}Я {size=-4}думаю, {size=-2}что {size=-2}не буду {size=-2}против.", 1, 3, 4, 2) 
            m "..."
            call luna_main("...", 1, 1, 4, 2) 
            call luna_main("Ладно, [l_genie_name]...", 1, 2, 4, 1) 
            hide screen luna
            with d3
            $ luna_xpos = 270
            ">Полумна позирует прямо перед твоим столом."
            call luna_main("(Почему я не могу постоять за себя?)", 1, 2, 4, 3) 
            call luna_main("...", 1, 3, 4, 4) 
        else:
            m "Если это не так сложно."
            call luna_main("...", 1, 2, 2, 2) 
            m "Не могла бы ты еще и раздеться?"
            call luna_main("*hmph* {p}Ну, учитывая, что вы, кажется, научились хорошим манерам.", 7, 1, 2, 2) 
            m "Да, [luna_name]..."
            call luna_main("Полагаю, ничего страшного в этом не будет...", 5, 2, 2, 1) 
            hide screen luna
            with d3
            $ luna_xpos = 270
            ">Полумна позирует прямо перед твоим столом."
            call luna_main("...", 9, 1, 2, 1) 
        menu:
            "\"Снимай юбку.\"" if luna_sub >= 5:
                $ luna_choice = 1
                call luna_main("Юбку?", 4, 1, 4, 4) 
                m "Да..."
                call luna_main("...", 7, 2, 4, 2) 
                call luna_main(".......", 7, 2, 4, 2) 
                call luna_main("{size=-7}Хорошо...{/size}", 7, 2, 4, 1) 
                m "Мммм, сегодня кто-то нетерпелив..."
                call luna_main("[l_genie_name]...", 3, 3, 4, 2) 
                call luna_main("...", 1, 2, 4, 1) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_skirt = False
                ">Полумна медленно начинает расстегивать юбку..."
                ">Однако она не стесняется и быстро кладет юбку на твой стол..."
                show screen luna
                hide screen blkfade
                with d3
                call luna_main("Ну... Все, [l_genie_name]?", 8, 2, 4, 3) 
                m "Не совсем..."
                call luna_main("(Надеюсь, вы не хотите, чтобы я сняла трусики?)", 6, 2, 2, 3) 
                call luna_main("[l_genie_name], пожалуйста...", 7, 1, 4, 2) 
                m "Нет, [luna_name], сделка есть сделка..."
                call luna_main("...", 6, 2, 4, 3) 
                $ luna_tears = 1
                call luna_main("По крайней мере, закройте глаза...", 7, 1, 4, 2) 
                m "Как - {p}прикажешь..."
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_panties = False
                ">Ты слышишь мягкий шорох одежды..."
                ">Вдруг что-то мягкое падает на твой стол"
                show screen luna
                hide screen blkfade
                with d3
                call luna_main("Теперь... вы счастливы!", 5, 2, 2, 2) 
                g9 "Конечно!"
                g9 "Только я ожидал, что ты снимешь рубашку!"
                call luna_main("Что?", 4, 1, 2, 15) 
                call luna_main("Пожалуйста! Тогда позвольте мне снова их надеть!", 4, 1, 4, 2) 
                ">Полумна вскарабкивается, чтобы забрать свои трусики обратно с твоего стола,но ты слишком быстр для нее, и быстрее схватил их."
                m "Ах, ах, мисс Лавгуд."
                call luna_main("Вы такой... Вы такой подлый!", 8, 2, 4, 2) 
                m "Не жалуйся слишком рано, я надеялся, что ты все равно их снимешь."
                call luna_main("*hmph*", 6, 1, 1, 3) 
                m "Ну, учитывая, что мы уже пересекли эту черту, как насчет того, чтобы снять топ."
                call luna_main("Вы же не серьезно?! Я думаю, вы видели достаточно  [l_genie_name]!", 7, 1, 2, 3) 

            "\"Снимай рубашку...\"" if luna_sub > luna_dom:
                $ luna_choice = 2
                call luna_main("Рубашку?", 7, 1, 4, 2) 
                m "Это не слишком сложно [luna_name]?"
                call luna_main("Нет...", 8, 2, 4, 2) 
                m "..."
                call luna_main("...", 9, 3, 4, 3) 
                call luna_main("Фу, хорошо... (Я надеюсь, что он не ожидает, что я так же и лифчик сниму)", 7, 2, 4, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_top = False
                ">Полумна начинает расстегивать рубашку..."
                ">Она легко расстегивает пуговицы, позволяя ей соскользнуть со своих плеч, прежде чем положить ее на твой стол."
                show screen luna
                hide screen blkfade
                with d3
                pause
                call luna_main("Это... все [l_genie_name]?", 9, 1, 4, 2) 
                m "Почти... теперь снимай лифчик."
                call luna_main("[l_genie_name], я не хо-", 7, 2, 4, 2) 
                m "[luna_name]..."
                call luna_main("...{p}ладно...", 7, 2, 4, 1) 
                call luna_main("Но вы должны закрыть глаза.", 7, 1, 4, 2) 
                m "Будь по-твоему."
                call luna_main("...", 9, 3, 4, 1) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_bra = False
                ">Ты слышишь мягкий шорох одежды..."
                ">Ты слышишь, как что-то тихо легло на твой стол"
                show screen luna
                hide screen blkfade
                with d3
                m "Мило."
                m "Теперь твоя юбка."
                call luna_main("Вы же не серьезно?! Я думаю, вы видели достаточно, [l_genie_name]!", 7, 1, 2, 3) 


            "\"Пожалуйста, сними рубашку.\"" if luna_dom >= luna_sub:
                $ luna_choice = 3
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Вы так {i}вежливо{/i} попросили, что не могу вам отказать...", 6, 1, 1, 1) 
                m "Спасибо, [luna_name]."
                call luna_main("(Не могу поверить, как некоторые люди думают, что он величайший волшебник...)", 7, 2, 1, 1) 
                call luna_main("Закройте глаза...", 8, 1, 2, 1) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_panties = False
                $ luna_wear_bra = False
                $ luna_wear_skirt = False
                $ luna_wear_top = False
                ">Ты слышишь мягкий шорох снимаемой одежды..."
                m "..."
                m "Могу я открыть уже глаза, [luna_name]?"
                lun "Вы сможете открыть, когда я скажу..."
                ">Ты слышишь, как она мягко кладет что-то на стол..."
                lun "..."
                m "..."
                lun "Хорошо, открывайте."
                show screen luna
                hide screen blkfade
                with d3 

            "\"Пожалуйста, сними юбку, [luna_name]...\"" if luna_dom >= 5:
                $ luna_choice = 4
                call luna_main("...", 5, 2, 1, 1) 
                call luna_main("......", 8, 2, 2, 1) 
                call luna_main("Учитывая, как вы произнесли это волшебное слово, полагаю, это справедливо...", 6, 1, 1, 1) 
                m "Спасибо, [luna_name]."
                call luna_main("(Я обвела его вокруг пальца...)", 7, 2, 1, 1) 
                call luna_main("Хорошо... Закройте глаза...",8, 1, 2, 2) 
                hide screen luna
                show screen blkfade
                with d3
                $ luna_wear_panties = False
                $ luna_wear_bra = False
                $ luna_wear_skirt = False
                $ luna_wear_top = False
                ">Ты слышишь мягкий шорох одежды и молний..."
                m "..."
                m "Могу я уже открыть глаза, [luna_name]?"
                lun "Подождите..."
                m "..."
                ">Ты слышишь, как она мягко кладет что-то на стол..."
                lun "Хорошо, сейчас вы уже можете их открыть..."
                show screen luna
                hide screen blkfade
                with d3 

        if luna_choice <= 2: #luna sub choices
            if luna_sub <= 6:
                $ luna_sub += 1
            m "Я, ждал, когда ты это скажешь, [luna_name]."
            call luna_main("[l_genie_name]... пожалуйста...", 5, 1, 4, 2) 
            m "Ммм, ну раз уж я в хорошем настроении, как насчет еще одной сделки?"
            call luna_main("...", 7, 2, 4, 2) 
            $ luna_tears = 0
            call luna_main("Правда? Какого рода?", 7, 2, 4, 2) 
            m "Какая ближайшая школа к Хогсморту?"
            call luna_main("? ...{p}Хм, Наверное, Шармбатонская Академия Магии, [l_genie_name]...", 5, 2, 4, 2) 
            m "Как насчет того, чтобы я отправил им рекомендательное письмо по журналу твоего отца?"
            m "Я уверен, что это повысит продажи."
            call luna_main("Правда, сэр? Вы это сделаете?", 4, 1, 1, 1) 
            call luna_main("И все, что мне нужно сделать, это стоять здесь и...", 5, 2, 4, 2) 
            if luna_wear_skirt == False:
                call luna_main("Снять рубашку...", 7, 3, 4, 2) 
                m "И лифчик."
            else:
                call luna_main("Снять юбку...", 7, 3, 4, 2) 
                m "И трусики."
            call luna_main("......", 8, 1, 4, 2) 
            call luna_main("..........", 9, 2, 4, 2) 
            call luna_main("Хорошо... Но вы должны закрыть глаза...", 9, 1, 4, 2) 
            m "Идет."
            hide screen luna
            hide screen luna_chibi
            show screen blkfade
            with d3
            $ luna_wear_panties = False
            $ luna_wear_bra = False
            $ luna_wear_skirt = False
            $ luna_wear_top = False
            ">Ты слышишь мягкий шорох одежды..."
            ">Вдруг что-то мягкое падает на твой стол"
            $ luna_chibi("stand_naked")
            show screen luna
            show screen luna_chibi
            hide screen blkfade
            with d3
            call luna_main("......", 8, 3, 4, 2) 
            g9 "Прекрасно выглядишь, [luna_name]!"
            g9 "Очень хорошо, на самом деле, я думаю, что мне нужно рассмотреть тебя поближе!"
            ">Ты встаешь и подходишь к Полумне, склоняясь над ней."
            hide screen bld1
            hide screen genie
            show screen chair_left
            show screen desk
            $ genie_chibi_xpos = -20
            $ genie_chibi_ypos = 10
            $ g_c_u_pic = "groping_ass_ani"
            show screen g_c_u
            with fade
            hide screen blktone
            hide screen blkfade
            with d5
            pause
            m "Ммммм..."
            call luna_main("......", 8, 2, 4, 2) 
            menu:
                "-Схватить ее за сиськи!-":
                    $ current_payout = 40
                    show screen blkfade
                    hide screen genie
                    $ genie_chibi_xpos = 40
                    $ genie_chibi_ypos = 10
                    $ g_c_u_pic = "groping_ass_ani"
                    show screen g_c_u
                    with fade
                    ">Ты быстро протягиваешь руку и хватаешь обе ее сливочные сисечки..."
                    hide screen blkfade
                    call luna_main("!!!", 4, 1, 3, 3) 
                    ">Ты начинаешь нежно разминать ее грудь."
                    m "Мммм... вот так, [luna_name]..."
                    call luna_main("{size=-5}(Что он делает?){/size}", 9, 2, 4, 2) 
                    call luna_main("[l_genie_name], вам, думаю, действительно нужно остановиться... ", 8, 1, 4, 3) 
                    if daytime:
                        m "Давай, [luna_name], еще немного, и ты пойдешь на занятия."
                    else:
                        m "Давай, [luna_name], еще немного, и ты отправишься спать..."
                    $ luna_tears = 2
                    call luna_main("[l_genie_name]... нет...", 9, 3, 4, 2) 
                    call luna_main("(Я должна остановить его...)", 9, 2, 4, 2) 
                    call luna_main("(Пока он не слишком обрадовался...)", 9, 3, 4, 2) 
                    ">Полумна отталкивает тебя."
                    call luna_main("......", 9, 1, 4, 2) 
                    ">Ты отпускаешь ее и делаешь шаг назад."
                    $ genie_chibi_xpos = 20
                    call luna_main("...", 9, 3, 4, 3) 
                    m "Извини..."
                    call luna_main("Все нормально, [l_genie_name]...", 9, 2, 4, 2) 
                    call luna_main("Вы просто немного перевозбудились...", 9, 3, 4, 2) 
                    call luna_main("Просто, пожалуйста, постарайтесь контролировать себя в следующий раз...", 9, 2, 4, 1) 
                    g9 "С такими сиськами я не уверен!"
                    call luna_main("...", 9, 2, 4, 2) 


                "-Начать дрочить-"if luna_choice == 1:
                    $ current_payout = 100
                    m "Мммммм..."
                    call luna_main("......", 8, 1, 4, 2) 
                    hide screen blktone
                    show screen blkfade
                    with d3
                    ">Ты залезаешь в мантию и вытаскиваешь свой член..."
                    ">Ты плюешь на ладонь, чтобы смазать ее, прежде чем начать дрочить..."
                    hide screen genie
                    $ genie_chibi_xpos = -20
                    $ genie_chibi_ypos = 10
                    $ g_c_u_pic = "jerking_off_02_ani"
                    show screen g_c_u
                    hide screen blkfade
                    with fade
                    call luna_main("!!!", 4, 1, 3, 3) 
                    call luna_main("(Я, просто так, позволю ему делать это?)", 9, 2, 2, 3) 
                    call luna_main("Сэр, я думаю, что это уже сли-", 8, 1, 2, 3) 
                    m "Тссс..."
                    ">Ты начинаешь дрочить быстрее."
                    call luna_main("...", 5, 2, 4, 3) 
                    call luna_main("(Я не могу, просто так, позволить ему...)", 6, 3, 4, 3) 
                    m "Да.. Ах, да, как же хорошо..."
                    $ luna_tears = 2
                    call luna_main("Сэр... Пожалуйста... Не...", 6, 3, 4, 3) 
                    m "Я сказал \"тссс\", [luna_name]..."
                    call luna_main("Сэр... Я уйду, если вы не остановитесь...", 6, 2, 4, 3) 
                    m "Если ты уйдешь, то можешь попрощаться со своим \"Пердиром\", или как там твой журнал называется."
                    call luna_main("(Я не могу так поступить с папой...)", 7, 3, 4, 3) 
                    call luna_main("Отлично! Надеюсь, вы будете счастливы!", 7, 1, 4, 3) 
                    call luna_main("Наслаждайтесь поглаживая свой грязный старый член пока заставляете меня стоять здесь...", 7, 3, 4, 3) 
                    g9 "{size=-4}(Мммм... Да...){/size}"
                    g9 "О, да!"
                    call luna_main("*hmph*...", 7, 1, 2, 2) 
                    ">Полумна в отчаянии отводит волосы через плечо."
                    call luna_main("Вы отвратительны...", 7, 3, 3, 2) 
                    ">Ты продолжаешь дрочить, глядя на молочные сисяндры Полумны..."
                    m "Мммм... Вот так, [luna_name]..."
                    $ luna_tears = 3
                    call luna_main("*hmph*... Можно побыстрее покончить с этим, [l_genie_name]...", 6, 3, 4, 3) 
                    call luna_main("Мне уже надоело смотреть на эту вашу... Штуку...", 7, 2, 4, 2) 
                    m "{size=-4}Ах...{/size}"
                    m "Шлюха... Смотри на него..."
                    call luna_main("Профессор!", 8, 3, 2, 2) 
                    m "{size=-4}(argh... Да...){/size}"
                    call luna_main("Я действительно не-", 5, 3, 4, 2) 
                    m "{size=-4}Да...{/size}"
                    call luna_main("-Думаю, что-", 9, 3, 4, 3) 
                    g4 "{size=+2}Ммм... Вот так, уже{/size}"
                    call luna_main("-Вы должны-", 5, 3, 4, 1) 
                    g4 "{size=+4}(agh... Почти все...){/size}"
                    call luna_main("-Делать это-", 9, 3, 4, 1) 
                    g4 "{size=+4}(ДА! ДА! ДА!) *Argh!*{/size}"
                    $ genie_cum_chibi_xpos = -20
                    $ genie_cum_chibi_ypos  = 10
                    $ g_c_c_u_pic = "genie_cum_03" 
                    show screen g_c_c_u
                    $ luna_wear_cum = True
                    $ luna_cum = 5
                    hide screen luna
                    with d3
                    show screen white 
                    pause.1
                    hide screen white
                    pause.2
                    show screen white 
                    pause .1
                    hide screen white
                    with hpunch
                    g4 "Argh! Да!"
                    hide screen luna
                    with d3
                    hide screen bld1
                    with d3
                    show screen bld1
                    with d3
                    $ g_c_u_pic = "jerking_off_02_ani"
                    hide screen g_c_c_u
                    call luna_main("ugh... Как ее много..", 8, 3, 4, 2) 
                    call luna_main("{size=-5}(Я не могу в это поверить...){/size}", 8, 2, 4, 2) 
                    call luna_main("ugh... {size=-5}(Это отвратительно...){/size}", 8, 3, 2, 2) 
                    with d3
                    g4 "argh... Отличная работа, шлюха... Ах черт, как здорово..."
                    show screen genie
                    hide screen bld1
                    hide screen g_c_u
                    #show screen genie_jerking_off
                    with d3
                    call luna_main("......", 7, 1, 4, 2) 
                    m "Ah... Ты молодец, [luna_name]..."

            hide screen luna
            show screen blkfade
            with d3
            show screen genie
            hide screen g_c_u
            $ luna_wear_skirt = True
            $ luna_wear_top = True
            $ luna_wear_bra = True
            $ luna_wear_panties = True
            $ luna_cum = 2
            hide screen chair_left
            hide screen desk
            ">Полумна быстро поднимает одежду с твоего стола и начинает одеваться, одевая рубашку поверх слоя спермы."
            show screen luna
            hide screen blkfade
            with d3
            call luna_main("Я думаю, что мне пора уходить, [l_genie_name]...", 7, 3, 4, 2) 
            m "Ты можешь уйти, когда захочешь, [luna_name]."
            call luna_main("Ну, я точно не уйду, пока вы мне не заплатите!", 9, 1, 2, 3) 


        else:
            call luna_main("...", 7, 1, 1, 1) 
            $ luna_chibi("stand_naked")
            pause
            g9 "Ммммм"
            if luna_dom <= 5:
                $ luna_dom += 1
            call luna_main("Нравится, на это смотреть, [l_genie_name]?", 5, 2, 1, 1) 
            g9 "Да... Да..."
            call luna_main("...Почему бы вам не подойти поближе? ...", 5, 1, 2, 1) 
            m "Что??"
            call luna_main("Почему бы вам не встать, подойти и хорошенько все рассмотреть, [l_genie_name]...", 8, 1, 3, 1) 
            m "Я не думаю, что-"
            call luna_main("Тссс...", 9, 1, 2, 14) 
            call luna_main("Просто встаньте, сэр.....", 7, 1, 2, 1) 
            m "..."
            ">Ты встаешь и подходишь к Полумне, чувствуя тяжесть ее взгляда."
            hide screen bld1
            hide screen genie
            show screen chair_left
            show screen desk
            $ genie_chibi_xpos = -20
            $ genie_chibi_ypos = 10
            $ g_c_u_pic = "images/animation/06_groping_01.png" 
            show screen g_c_u
            with fade
            hide screen blktone
            hide screen blkfade
            with d5
            pause
            call luna_main("Вот так...", 8, 1, 4, 1) 
            call luna_main("Разве не лучше?", 8, 2, 4, 1) 
            m "Ммммм... Да..."
            call luna_main("Хммммм, просто продолжайте смотреть...", 8, 2, 3, 1) 
            ">Полумна слегка трясет своей грудью."
            g9 "!!!"
            call luna_main("Вам нравится?...", 9, 2, 4, 1) 
            m "О боги, да..."
            call luna_main("Мммммм... Почему вам не вытащить его, [l_genie_name]...", 9, 1, 4, 1) 
            m "..."
            call luna_main("Будьте хорошим мальчиком....", 5, 1, 4, 1) 
            show screen blkfade
            ">Ты вытаскиваешь свой член и начинаешь его гладить..."
            hide screen genie
            $ genie_chibi_xpos = -20
            $ genie_chibi_ypos = 10
            $ g_c_u_pic = "jerking_off_02_ani"
            show screen g_c_u
            hide screen blkfade
            with fade
            call luna_main("Вот так, [l_genie_name]...", 9, 1, 4, 1) 
            ">Ты смотришь на ее мягкие молочные сиськи..."
            m "Ммммм..."
            call luna_main("Ммммм, разве так не лучше?", 9, 2, 4, 1) 
            g9 "Да..."
            ">Ты начинаешь теребить свой член с новой силой."
            call luna_main("Разве вам сегодня не интересно?", 8, 1, 2, 1) 
            g9 "Ага... Да... Это и правда здорово..."
            call luna_main("Хорошо... Убедитесь, что вы хорошо поработаете, чтобы обильно кончить для меня...", 9, 1, 2, 1) 
            call luna_main("Если вы и правда хороший мальчик, я могу даже позволить вам кончить... На меня...", 5, 2, 4, 1) 
            g9 "Да!"
            call luna_main("Спорим, вам бы это понравилось?", 7, 1, 2, 1) 
            g9 "О боги, да..."
            call luna_main("Выстрелить в меня вашей старческой спермой...", 9, 3, 2, 1) 
            g9 "!!!"
            call luna_main("Ну давайте же, [l_genie_name]...", 9, 1, 2, 1) 
            call luna_main("Ласкайте его быстрее...", 5, 1, 4, 1) 
            m "{size=-4}(Агрх... Да...){/size}"
            call luna_main("Готовы дать мне эту противную сперму...", 8, 1, 3, 1) 
            m "{size=-4}Да...{/size}"
            call luna_main("Мммм...", 8, 1, 3, 1) 
            m "{size=+2}Да...{/size}"
            call luna_main("Вы действительно, это очень любите...", 9, 1, 2, 1) 
            g4 "{size=+4}(Агх...){/size}"
            ">Ты начинаешь дрочить еще быстрее!"
            g4 "{size=+4}Даа...{/size}"
            call luna_main("Поэтому вы стали учителем...", 9, 1, 4, 1) 
            call luna_main("Только чтобы покрывать молодых студенток своей гадкой спермой...", 5, 1, 2, 1) 
            g4 "{size=+4}(ДА! ДА! ДА!) *Агрх!*{/size}"
            call luna_main("Ну?", 9, 1, 4, 1) 
            g4 "{size=+4}(агх... уже почти...){/size}"
            call luna_main("Сделайте это...", 7, 1, 2, 1) 
            call luna_main("{size=+4}Всю сперму на меня!{/size}", 7, 1, 2, 11) 
            g4 "{size=+4}(ДА! ДА! ДА!) *Арх!*{/size}"
            $ genie_cum_chibi_xpos = -20
            $ genie_cum_chibi_ypos  = 10
            $ g_c_c_u_pic = "genie_cum_03" 
            show screen g_c_c_u
            $ luna_wear_cum = True
            if luna_addicted:
                $ luna_cum = 11
            else:
                $ luna_cum = 5
            hide screen luna
            with d3
            show screen white 
            pause.1
            hide screen white
            pause.2
            show screen white 
            pause .1
            hide screen white
            with hpunch
            call luna_main("...", 5, 3, 1, 1) 
            g4 "АРРР! ДАА!"
            hide screen luna
            with d3
            hide screen bld1
            with d3
            show screen bld1
            with d3
            $ g_c_u_pic = "jerking_off_02_ani"
            hide screen g_c_c_u
            hide screen bld1
            if luna_addicted:
                call luna_main("Вот так, [l_genie_name], убедитесь, что вы покрыли меня...", 9, 1, 3, 1) 
                show screen genie_jerking_sperm_02
                with d3
                g4 "Ох, шайтан... Ох... Слишком хорошо..."
                call luna_main("Ммммм...", 8, 1, 3, 1) 
                m "Ах..."
                call luna_main("Продолжайте... Убедитесь, что вы отдали все, до последней капли вкусной спермы ...", 8, 3, 4, 1) 
                m "Ох... Благодарю тебя..."
                call luna_main("Хороший мальчик...", 5, 2, 2, 1) 
                call luna_main("Приятно видеть, как вы ...Кончаете... Я думаю, что мне лучше почиститься.", 7, 2, 2, 2) 
                $ luna_cum = 12
                ">Полумна собирает угощение из спермы кончиком пальца и пристально его разглядывает, прежде чем положить в свой рот."
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 6, 4, 1) 
                call luna_main("Мммммм{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                ">Ты с благоговением смотришь за тем, как Полумна собирает сперму в свой рот и проглатывает ее."
                $ luna_cum = 13
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                pause
                $ luna_cum = 14
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                $ luna_cum = 15
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                $ luna_wear_cum = False
                call luna_main("Эх...", 5, 8, 4, 1) 
                call luna_main("Чудесно...", 5, 4, 4, 1) 
                hide screen luna
                with d3
                ">Полумна быстро собирает вещи с твоего стола и одевается."
                $ luna_wear_skirt = True
                $ luna_wear_top = True
                $ luna_wear_bra = True
                $ luna_wear_panties = True
                $ luna_wear_cum = False
                show screen genie
                hide screen chair_left
                hide screen desk
                hide screen g_c_u
                show screen luna
                with d3
                g4 "Это было... Невероятно!"
                call luna_main("Я рада, что вам понравилось...", 1, 8, 1, 1) 
                m "Нам нужно сделать это еще раз!"
                call luna_main("Ммммм... Но до того, я считаю, мы должны обсудить оплату за этот раз...", 5, 2, 2, 1) 
                $ current_payout = 100
            else:
                call luna_main("Вот так, [l_genie_name], убедитесь, что вы покрыли меня...", 9, 1, 3, 1) 
                show screen genie_jerking_sperm_02
                with d3
                g4 "Ох, шайтан... Ох... Слишком хорошо..."
                call luna_main("Мммм...", 8, 1, 3, 1) 
                m "Ах..."
                call luna_main("Продолжайте... Убедитесь, что упали все капли.", 8, 3, 4, 1) 
                m "Ох... Благодарю тебя..."
                call luna_main("Хороший мальчик...", 5, 2, 2, 1) 
                call luna_main("Приятно видеть, как вы.... кончаете... Я думаю, мне лучше одеться.", 7, 2, 2, 2) 

                hide screen luna
                with d3
                ">Полумна быстро подхватывает свои вещи с твоего стола и одевается, накидывая рубашку прямо на сперму, покрывшую грудь."
                $ luna_wear_skirt = True
                $ luna_wear_top = True
                $ luna_wear_bra = True
                $ luna_wear_panties = True
                $ luna_cum = 2
                show screen genie
                hide screen chair_left
                hide screen desk
                hide screen g_c_u
                show screen luna
                with d3
                m "Это было... Невероятно."
                call luna_main("Я рада, что вам понравилось...", 1, 1, 1, 1) 
                m "Хотя, я должен спросить... Почему ты-"
                call luna_main("Сделала это?", 5, 2, 2, 2) 
                m "Да."
                call luna_main("Не волнуйтесь об этом...", 8, 1, 2, 1) 
                call luna_main("Единственное, о чем вам стоит беспокоиться...", 7, 1, 2, 1) 
                $ luna_l_arm = 2
                ">Она проводит пальцем по краю своего рта."
                call luna_main("Держать под контролем свой член...", 7, 3, 2, 1) 
                m "Что?"
                call luna_main("Я подозреваю, что вы, вероятно, дрочите после некоторых студенток, сэр...", 9, 1, 3, 1) 
                call luna_main("Но, если я узнаю,что вы покупаете услуги у других студентов.", 9, 2, 1, 1) 
                call luna_main("Чтоже...", 9, 1, 1, 1) 
                m "..."
                call luna_main("Скажем так, на вашем месте я бы этого не допустила...", 9, 2, 1, 1) 
                call luna_main("Теперь забудем об этом, давайте обсудим оплату. 100 галлеонов, как по мне... {p}Что скажете?", 9, 1, 2, 1) 
                m "Звучит честно..."
                call luna_main("Я рада, что мы удачно договорились.", 8, 2, 4, 1) 
                m "Да, [luna_name]..."
                call luna_main("Хороший мальчик... Теперь, раз речь зашла об оплате...", 9, 1, 2, 2) 
                $ current_payout = 100







    hide screen bld1
    if luna_dom >= luna_sub:
        m "Хорошо, хорошо. Вот твои деньги."
    else:
        m "Ну, тогда вот твоя оплата, [luna_name]."
    $ gold -= current_payout
    $ luna_gold += current_payout
    ">Ты отдаешь Полумне [current_payout] галлеонов."
    if current_payout <= 40:
        call luna_main("(Только [current_payout]?) *Хмм.*", 8, 2, 2, 3) 
        call luna_main("Благодарю, [l_genie_name].", 6, 2, 2, 2) 
    else:
        call luna_main("Спасибо, [l_genie_name].", 5, 2, 1, 1) 
    ">Полумна покидает твой кабинет."  
    $ luna_wear_cum = False
    hide screen genie_jerking_sperm_02    

    jump luna_away




label luna_favour_4: ###Luna handjob
    m "{size=-4}(Я просто спрошу по-быстрому...){/size}"
    if luna_corruption > 13:
        jump luna_handjob_hermione_call
    if luna_addicted:
        if luna_corruption <= 11:
            $ luna_corruption += 1
        call play_music("chipper_doodle") 
        m "[luna_name]?"
        call luna_main("Да, [l_genie_name]...", 1, 2, 2, 2) 
        m "Могу ли я купить еще одну услугу..."
        call luna_main("Это связано с тем, что бы я помогла выйти этой вкусной сперме из ваших морщинистых старых яичек?", 7, 2, 2, 1) 
        call luna_main("Хммм?", 5, 1, 1, 1) 
        m "Возможно..."
        call luna_main("Мммм... Хороший мальчик...", 8, 1, 3, 1) 
        call luna_main("Ну...", 8, 1, 3, 1) 
        call luna_main("Вставайте, [l_genie_name]...", 8, 1, 3, 1) 

        show screen blkfade
        ">Ты поднимаешься, обходишь вокруг стола, встав перед Полумной."
        ">Ты раскрываешь мантию и вытаскиваешь свой член."
        hide screen bld1
        hide screen genie
        show screen chair_left
        show screen desk
        $ genie_chibi_xpos = -20
        $ genie_chibi_ypos = 10
        $ g_c_u_pic = "jerking_off_02_ani"
        show screen g_c_u
        with fade
        hide screen blktone
        hide screen blkfade
        with d5
        pause
        m "Ну..."
        call luna_main("...", 7, 8, 2, 3) 
        ">Полумна смотрит на твой член."
        call luna_main("Ммммм, кто бы подумал, что что-то столь отвратительное может быть таким вкусным...", 9, 8, 3, 1) 
        ">Она крепко обхватывает его правой рукой."
        $ luna_r_arm = 3
        $ genie_sprite_xpos = 300
        $ luna_xpos = 390
        call gen_main("!!!", 4, 2) 
        call luna_main("*Хмммм.*", 5, 8, 2, 1) 
        call luna_main("(Такой теплый...)", 5, 3, 3, 1) 
        ">Полумна медленно начинает ласкать твой член твердыми движениями, даже скорее жесткими."
        m "Почему бы тебе не попробовать взять его обеими руками, [luna_name]..."
        call luna_main("Хммм... Я так не думаю, [l_genie_name]!", 8, 1, 2, 1) 
        m "..."
        ">Полумна начинает двигать рукой вперед и назад по всей длине твоего члена."
        m "Ах... Да, вот так..."
        call luna_main("Видите, одна рука - это все, что вам нужно.", 6, 3, 3, 3) 
        m "Ммммм, да... Точно, [luna_name]..."
        call luna_main("Так хорошо, [l_genie_name]?", 6, 1, 4, 14) 
        m "Да, да, это потрясающе..."
        call luna_main("Хорошо...", 6, 1, 4, 1) 
        call luna_main("Но...", 6, 2, 4, 2) 
        call luna_main("Я думаю, вам нужно немного больше стимулирования...", 8, 1, 4, 1) 
        m "Что ты придумала?"
        call luna_main("Ну...", 9, 8, 3, 1) 
        $ luna_wear_skirt = False
        $ luna_wear_bra = False
        $ luna_wear_panties = False
        $ luna_wear_top = False
        ">Полумна небрежно обнажается, все время крепко держа твой член."
        g4 "Вот это немного ободрила!"
        call luna_main("Это еще не все, сэр...", 9, 8, 3, 1) 
        $ genie_sprite_base = "characters/genie/base_4.png"
        $ luna_r_arm = 1
        menu:
            "-Полумна дразнит тебя своей попкой-":
                $ luna_flip = -1
                $ luna_r_arm = 2
                $ luna_l_arm = 2
                $ luna_xpos = 500
                ">Полумна медленно поворачивается, давая отлично разглядеть ее бледно-белые ягодицы."
                m "Ммммм."
                ">Она медленно покачивает бедрами из стороны в сторону."
                call luna_main("Наслаждайтесь видом... ?", 8, 2, 4, 1) 
                m "Очень хорошо, [luna_name]!"
                call luna_main("...", 7, 8, 4, 2) 
                call luna_main("Благодарю вас, сэр...", 7, 2, 4, 1) 
                $ luna_xpos = 390
                pause
                ">Она тихо прижимается к тебе, позволяя кончику члена коснуться ее попки... Капля смазки прилипает к ее ягодице."
                call luna_main("Ммм, так гораздо лучше?", 5, 2, 2, 1) 
                m "Боги, да!"
                call luna_main("...", 2, 2, 2, 1) 
                pause
                $ luna_xpos = 390
                call luna_main("Ну, я думаю, мне лучше вернуться к работе...", 8, 8, 2, 1) 
                ">Полумна медленно поворачивается назад, прежде чем положить руку на твой член."
                $ luna_r_arm = 3
                $ luna_flip = 1
                $ genie_sprite_base = "characters/genie/base_2.png"
                ">Полумна начинает дрочить тебе немного быстрее."
            "-Полумна дразнит тебя бедрами-":
                $ luna_choice = 2
                call luna_main("Давайте, профессор...", 8, 2, 4, 1) 
                $ luna_xpos = 350
                ">Полумна подходит к тебе."
                m "Ммммм..."
                call luna_main("Приготовьте для меня хорошую, вкусную порцию спермы ...", 7, 8, 4, 2) 
                m "О да..."
                call luna_main("Приготовьте все, для своей ученицы.", 7, 1, 4, 1) 
                $ luna_xpos = 280
                $ luna_ypos = -40
                ">Она подходит еще ближе, твой член оказывается между ее мягких бедер.."
                m "Аааах..."
                call luna_main("Так чтобы я смогла все проглотить...", 7, 3, 2, 1) 
                m "Да..."
                call luna_main("Мммммм, вам это нравится, не так ли...", 8, 2, 2, 1) 
                ">Полумна начинает шевелить бедрами вокруг твоего члена... Ты чувствуешь, как ее влажный бугорок трется о верхнюю часть твоей головки."
                g4 "Аах! Да!"
                call luna_main("...", 9, 8, 3, 1) 
                g4 "[luna_name]..."
                call luna_main("Хмммм, вы себя хорошо чувствуете, [l_genie_name]?", 5, 2, 5, 1) 
                g4 "Да... спасибо, [luna_name]..."
                call luna_main("Хороший мальчик.", 7, 3, 2, 1) 
                $ luna_xpos = 390
                $ luna_ypos = 0
                call luna_main("*Ptew*", 5, 8, 2, 16) 
                $ luna_r_arm = 3
                $ luna_flip = 1
                $ genie_sprite_base = "characters/genie/base_2.png"
                ">Полумна сплевывает на свою ладонь, прежде чем снова обхватить твой член."
        g4 "Ммммм, Да, вот так, [luna_name]..."
        call luna_main("...", 7, 8, 2, 1) 
        g4 "Просто двигай рукой вверх и вниз."
        call luna_main("......", 8, 1, 3, 1) 
        if luna_choice == 1:
            ">Полумна начинает слегка трясти своими сиськами в то время, как тебе дрочит."
        else:
            call luna_main("*Ptew*", 8, 8, 3, 16) 
            ">Полумна снова сплевывает в свою ладонь и продолжает ласкать твой член."
        ">Затем, она ускоряет свои движения рукой."
        g4 "Боги, о да..."
        g4 "(О, уже почти, куда мне кончить?)"
        menu:
            "-На ее лобок!-":
                ">Ты кладешь руку на попку Полумны, пытаясь удержать ее на месте."

            "-На ее сиськи!-":
                ">Ты кладешь руку на плечо Полумны и медленно пытаешься заставить ее опуститься на колени."

        call luna_main("[l_genie_name]!!!", 7, 1, 3, 6) 
        call luna_main("Вы же не пытаетесь кончить на меня?", 8, 1, 3, 3) 
        g4 "Ох, [luna_name], сейчас!"
        $ genie_sprite_base = "characters/genie/base_4.png"
        $ luna_ypos = 220
        $ luna_xpos = 350
        $ luna_r_arm = 1
        ">Полумна опускается на колени перед тобой."
        ">Она убирает свою руку с твоего члена, оставляя тебя."
        call luna_main("Теперь единственное, куда вы будете кончать - это сюда...", 9, 1, 3, 3) 
        g4 "Мммм, да!"
        call luna_main("...", 5, 3, 2, 18) 
        $ luna_xpos = 310
        ">Она наклоняется вперед, умело облизав твой член."
        call luna_main("...", 7, 8, 4, 18) 
        call luna_main("(Это не так вкусно, как кажется...)", 7, 2, 3, 18) 
        call luna_main("(Хотя, это и не самое худшее...)", 5, 3, 4, 18) 
        g4 "Я почти кончаю, шлюха!"
        $ luna_xpos = 350
        ">Она немного отстранилась от твоего члена."
        call luna_main("Теперь кончите на меня...", 7, 3, 3, 1) 
        call luna_main("Кончайте...", 5, 6, 4, 1) #hypno eyes
        pause
        g4 "Аах, {size=+2} вот {size=+2}так {size=+2}да!{/size}"
        menu:
            "Куда ты хочешь кончить?"
            "-На лицо-":
                $ luna_choice = 1
                $ luna_cum = 11
                $ luna_wear_cum = True
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 3, 4, 18) 
                pause
                ">Ты начинаешь спускать на ее лицо, покрывая его своей липкой спермой."
                hide screen g_c_c_u
                $ g_c_u_pic = "images/animation/06_jerking_01.png"
                $ luna_r_arm = 2
                $ luna_l_arm = 2
                $ genie_sprite_base = "characters/genie/base_2.png"
                hide screen genie_sprite
                with d3
                $ luna_xpos = 390
                $ luna_ypos = 0
                ">Полумна подпрыгивает на ноги."
                $ luna_cum = 12
                ">Затем Полумна собирает капли спермы на конце своего пальца и пристально разглядывает, прежде чем положить себе в рот."
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 7, 8, 2, 1) 
                call luna_main("Просто дайте мне минутку, что бы привести себя в порядок, сэр...", 5, 8, 2, 1) 
                m "Конечно..."
                ">Ты с благоговением смотришь на то, как она медленно собирает всю сперму к себе в рот, а затем проглатывает ее."
                $ luna_cum = 13
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
                pause
                $ luna_cum = 14
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
                $ luna_cum = 15
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
                $ luna_wear_cum = False
                call luna_main("...", 5, 6, 4, 13) 
                call luna_main("*глотает*", 2, 8, 4, 1) 
                call luna_main("Ох...", 2, 8, 4, 1) 
                call luna_main("Изумительно...", 5, 8, 4, 1) 
            "-В рот-":
                $ luna_choice = 2
                show screen white 
                pause.1
                hide screen white
                pause.2
                show screen white 
                pause .1
                hide screen white
                with hpunch
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 3, 4, 13) 
                pause
                ">Ты начинаешь кончать прямо в ее открытый рот. Ее глаза затуманиваются, пока она изо всех сил пытается удержать все во рту."
                g4 "Агрх! О боги, {size=+10}ДАА!{/size}"
                call luna_main("!!!", 5, 6, 4, 13) 
                pause
                call luna_main("(Так хорошо...)", 5, 2, 4, 13) 
                call luna_main("...", 5, 3, 4, 13) 
                g4 "{size=+10}ПРИМИ ВСЕ ЭТО, СИСЬКАСТАЯ ШЛЮХА!{/size}"
                g4 "Ммммм....."
                hide screen g_c_c_u
                $ g_c_u_pic = "images/animation/06_jerking_01.png"
                $ luna_r_arm = 2
                $ luna_l_arm = 2
                $ genie_sprite_base = "characters/genie/base_2.png"
                hide screen genie_sprite
                with d3
                m "Теперь глотай..."
                call luna_main("*глотает*", 2, 8, 4, 1) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 6, 4, 1) 
                m "Ох... Ты фантастическая шлюха..."
                call luna_main("[l_genie_name]...", 6, 2, 2, 1) 
        $ g_c_u_pic = "images/animation/06_groping_01.png"
        $ luna_xpos = 390
        $ luna_ypos = 0
        m "Что ж, вот твоя оплата, [luna_name]."
        $ gold -= current_payout
        $ luna_gold += current_payout
        ">Ты даешь Полумне [current_payout] галлеонов."
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png" 
        call luna_main("Ох, ум... да, благодарю вас, [l_genie_name].", 5, 2, 1, 1) 
        call luna_main("Позвольте мне теперь одеться...", 5, 2, 1, 1) 
        $ luna_wear_skirt = True
        $ luna_wear_bra = True
        $ luna_wear_panties = True
        $ luna_wear_top = True 
        ">Полумна быстро одевается, прежде чем покинуть твой кабинет, ее лицо в полном смущении."  
        $ luna_wear_cum = False
        $ luna_wear_cum_under = False
        m "Странно..."

        hide screen g_c_u
        show screen genie
        hide screen chair_left
        hide screen desk

        jump luna_away

    else:
        if luna_corruption <= 10: #FIRST TIME - Change this to 10 when part 2 added
            if luna_corruption <= 10:
                $ luna_corruption += 1
            call play_music("chipper_doodle") 
            m "[luna_name]?"
            call luna_main("Да, [l_genie_name]...", 1, 2, 2, 2) 
            m "Могу ли я купить еще одну услугу?..."
            call luna_main("...", 7, 2, 2, 2) 
            call luna_main("Продолжайте...", 7, 2, 2, 2) 
            menu:
                "-Вежливо попросить подрочить-" if luna_sub < luna_dom:
                    $ current_payout = 160
                    if luna_dom <= 8:
                        $ luna_dom += 1
                    $ luna_choice = 3
                    m "Хорошо, видя, сколь ты искусна во всем, к чему прикладываешь руку..."
                    call luna_main("Ммммм...", 6, 2, 2, 3) 
                    m "Я надеялся, что ты могла бы приложить руку к моему члену."
                    call luna_main("...", 8, 2, 1, 2) 
                    m "Пожалуйста..."
                    call luna_main("Серьезно? Вы хотите, что бы я ласкала ваш мерзкий член?", 8, 1, 2, 3) 
                    call luna_main("Не достаточно ли того, что я просто позволила вам коснуться себя...", 9, 2, 3, 3) 
                    m "Тебя ждет здоровенная награда..."
                    call luna_main("...", 8, 2, 3, 3) 
                    call luna_main("......", 8, 1, 2, 2) 
                    call luna_main("Ну, раз уж вы так вежливо попросили...", 8, 1, 1, 1) 
                    m "..."
                    call luna_main("Идите сюда...", 7, 1, 3, 1) 
                    m "Фантастика! Позволь мне встать."
                    call luna_main("(Это не могло быть еще проще.)", 8, 2, 2, 1) 
                "-Упрашивать подрочить-" if luna_dom >= 7:
                    $ current_payout = 200
                    if luna_dom <= 8:
                        $ luna_dom += 1
                    $ luna_choice = 4
                    m "Ну, если это не так сложно..."
                    call luna_main("Мммммм...", 6, 2, 2, 3) 
                    m "Я надеялся, что ты..."
                    call luna_main("...", 8, 2, 1, 2) 
                    m "Подрочишь мне..."
                    call luna_main("Серьезно? Вы хотите, что бы я трогала ваш мерзкий член?", 8, 1, 2, 3) 
                    m "Если это не слишком сложно..."
                    call luna_main("Ну, я полагаю, что я, вероятно, могла бы.", 5, 2, 1, 1) 
                    call luna_main("Кто знает, кого вы вызовите, если я откажусь...", 8, 1, 3, 1) 
                    m "Спасибо тебе..."
                    call luna_main("...", 8, 2, 3, 3) 
                    call luna_main("......", 8, 1, 2, 2) 
                    call luna_main("Однако, я ожидаю справедливую компенсацию...", 8, 1, 1, 1) 
                    m "Конечно."
                    call luna_main("Отлично. Теперь подойдите сюда...", 7, 1, 3, 1) 
                    m "Фантастика! Позволь мне встать."
                    call luna_main("(Это не могло быть проще...)", 8, 2, 2, 1) 
                    call luna_main("(С такой скоростью, я буду единственным человеком в его завещании к концу месяца...)", 9, 1, 3, 1) 

            show screen blkfade
            ">Ты поднимаешься, обходишь вокруг стола, встав перед Полумной."
            ">Ты распахиваешь мантию и вытаскиваешь свой член."
            hide screen bld1
            hide screen genie
            show screen chair_left
            show screen desk
            $ genie_chibi_xpos = -20
            $ genie_chibi_ypos = 10
            $ g_c_u_pic = "jerking_off_02_ani"
            show screen g_c_u
            with fade
            hide screen blktone
            hide screen blkfade
            with d5
            pause
            m "Ну..."
            call luna_main("...", 7, 8, 2, 3) 
            ">Полумна опускает взгляд на член."
            call luna_main("Отвратительно...", 9, 8, 3, 1) 
            ">Она крепко обхватывает его своей правой рукой."
            $ luna_r_arm = 3
            $ genie_sprite_xpos = 300
            $ luna_xpos = 390
            call gen_main("!!!", 4, 4) 
            call luna_main("*Хмммм* Во всяком случае, он не маленький...", 5, 8, 2, 1) 
            call luna_main("(Я даже не могу обхватить его рукой.)", 5, 3, 3, 1) 
            ">Полумна медленно начинает поглаживать твой член рукой, ее движения грубые и неопытные."
            m "Почему бы тебе не попытаться схватить его обеими руками, [luna_name]..."
            call luna_main("Хммм... Раз вы просите!", 8, 1, 2, 1) 
            m "..."
            ">Полумна начинает двигать ручками вперед и назад, по всей длине члена."
            m "Ух... Да, вот так..."
            call luna_main("(Мужчины действительно хуже всех.)", 6, 3, 3, 3) 
            m "Ммммм, да... вот так, [luna_name]..."
            call luna_main("Так хорошо, [l_genie_name]?", 6, 1, 4, 14) 
            m "Да, да, это потрясающе..."
            call luna_main("Хорошо...", 6, 1, 4, 1) 
            call luna_main("Но...", 6, 2, 4, 2) 
            call luna_main("Вам нужно немного больше ободрения?", 8, 1, 4, 1) 
            m "Что ты задумала?"
            call luna_main("......", 9, 8, 3, 1) 
            menu:
                "-Полумна снимает рубашку-":
                    ">Полумна медленно снимает жилетку и начинает расстегивать свою рубашку."
                    m "Ммммм.."
                    $ luna_wear_top = False
                    $ luna_choice = 1
                    $ luna_r_arm = 2
                    ">Она снимает свою рубашку и кладет ее на пол."
                    call luna_main("Ну вот...", 8, 2, 4, 1) 
                    m "Очень хорошо, [luna_name]!"
                    call luna_main("...", 7, 8, 4, 2) 
                    call luna_main("Благодарю, сэр...", 7, 1, 4, 1) 
                    $ luna_r_arm = 3
                    ">Она снова кладет руки на твой член."
                    call luna_main("Мммм, намного лучше...", 5, 8, 2, 1) 
                    m "Боги, да."
                    call luna_main("...", 5, 1, 2, 1) 
                    call luna_main("Я бы также сняла свой бюстгалтер...", 5, 2, 4, 2) 
                    call luna_main("Но, я не думаю, что вы в состоянии удержать себя от того, что бы сразу кончить, не так ли?", 8, 1, 3, 1) 
                    g4 "Вероятно, нет!"
                    call luna_main("...", 9, 8, 2, 1) 
                    ">Полумна начинает дрочить твой член немного быстрее."
                "-Полумна дразнит тебя-":
                    $ luna_choice = 2
                    call luna_main("Давайте, профессор...", 8, 2, 4, 1) 
                    ">Полумна начинает двигать руками по члену вверх и вниз немного быстрее."
                    m "Мммм..."
                    call luna_main("Приготовьте хороший и большой заряд для меня ...", 7, 8, 4, 2) 
                    m "Ааа, да..."
                    call luna_main("Приготовьтесь выплеснуть все на свою ученицу.", 7, 1, 4, 1) 
                    ">Она ускоряет темп."
                    m "Ааа..."
                    call luna_main("Что случилось?", 7, 1, 5, 2) 
                    m "Ну, если ты продолжишь так быстро, то трение доставит немного боли."
                    call luna_main("Действительно?...", 8, 1, 2, 1) 
                    ">Полумна не замедляет движения. Скорее, она немного ускоряется."
                    g9 "АЙ!"
                    call luna_main("...", 9, 1, 3, 1) 
                    g9 "[luna_name]..."
                    call luna_main("Хмммм, вы хотите, что бы я на него плюнула?", 5, 1, 5, 1) 
                    g9 "Только немного..."
                    call luna_main("...", 5, 1, 2, 1) 
                    call luna_main("......", 5, 1, 3, 1) 
                    g9 "Пожалуйста..."
                    call luna_main("Хороший мальчик.", 7, 1, 2, 1) 
                    call luna_main("*Тьфу*", 5, 8, 2, 16) 
                    ">Полумна немного сплевывает на руку, прежде чем вернуть ее на твой член."
            g4 "Мммм, да, вот так, [luna_name]..."
            call luna_main("...", 7, 8, 2, 1) 
            g4 "Просто продолжай двигать руками вверх и вниз."
            call luna_main("......", 8, 1, 3, 1) 
            if luna_choice == 1:
                ">Полумна слегка трясет своими сиськами, продолжая дрочить тебе."
            else:
                call luna_main("*Тьфу*", 8, 8, 3, 16) 
                ">Полумна снова сплевывает на руку и возвращает ее на твой член."
            ">Затем, она начинает дрочить твой член еще быстрее."
            g4 "Боги, да..."
            g4 "(Куда я могу кончить?)"
            menu:
                "-На ее лицо-":
                    ">Ты кладешь руку на голову Полумны и медленно пытаешься заставить ее опуститься на уровень с твоей промежностью."

                "-На ее грудь-":
                    ">Ты кладешь руку на плечо Полумны и медленно пытаешься заставить ее опуститься на один уровень с твоим поясом."

            call luna_main("[l_genie_name]!!!", 7, 1, 3, 6) 
            call luna_main("Вы же не пытаетесь кончить на меня?", 8, 1, 3, 3) 
            g4 "Ах, [luna_name], я уже почти..."
            call luna_main("Ну...", 9, 8, 3, 3) 
            $ luna_wear_skirt = False
            ">Полумна быстро стягивает свою юбку."
            g4 "!!!"
            call luna_main("Вы кончите...", 8, 1, 3, 3) 
            g4 "Ааа..."
            ">Полумна медленно стягивает свои трусики, обнажая свою киску."
            ">Ее правая рука все еще обхватывает твой член, когда она начинает дрочить его с ослепительной скоростью."
            call luna_main("Куда я вам скажу...", 9, 1, 3, 3) 
            g4 "Мммм."
            call luna_main("Теперь...", 8, 1, 3, 2) 
            call luna_main("Кончайте!", 5, 1, 2, 1) 
            $ g_c_c_u_pic = "jerking_off_cum_ani"
            show screen g_c_c_u
            $ luna_wear_cum_under = True
            $ luna_cum = 10
            show screen white 
            pause.1
            hide screen white
            pause.2
            show screen white 
            pause .1
            hide screen white
            with hpunch
            ">Ты начинаешь стрелять струей прямо в трусики Полумны, покрывая ее киску спермой."
            g4 "АГРХ! О боги... {size=+10}ДА!{/size}"
            call luna_main("...", 5, 3, 1, 1) 
            call luna_main("(Это, так тепло...)", 5, 2, 4, 1) 
            g4 "{size=+10}ПОЛУЧИ ВСЕ, ШЛЮХА!{/size}"
            g4 "Ммммм....."
            hide screen g_c_c_u
            $ g_c_u_pic = "images/animation/06_jerking_01.png"
            $ luna_r_arm = 2
            hide screen genie_sprite
            with d3
            m "Какое точное попадание..."
            call luna_main("({image=textheart}{image=textheart}{image=textheart})", 5, 8, 4, 1) 
            call luna_main("[l_genie_name]!", 8, 1, 3, 1) 
            call luna_main("Как вы могли! Кончить на {size=-10}киску{/size} своей ученице...", 7, 8, 2, 1) 
            m "Охх... Это было, фантастика, шлюха..."
            $ g_c_u_pic = "images/animation/06_groping_01.png"
            call luna_main("[l_genie_name]...", 6, 2, 2, 1) 

        else: #last time event is run before cum addict variant
            if luna_corruption <= 11:
                $ luna_corruption += 1
            call play_music("chipper_doodle") 
            m "[luna_name]?"
            call luna_main("Да, [l_genie_name]...", 1, 2, 2, 2) 
            m "Могу ли я купить еще одну услугу..."
            call luna_main("Я думаю, что знаю, чего вы хотите...", 7, 2, 2, 1) 
            call luna_main("Но, все равно, почему бы вам не попросить меня...", 5, 1, 1, 1) 
            call luna_main("Вы знаете, мне нравиться слышать то, как вы просите.", 8, 1, 3, 1) 
            menu:
                "-Вежливо попросить подрочить-" if luna_sub < luna_dom:
                    $ current_payout = 160
                    if luna_dom <= 8:
                        $ luna_dom += 1
                    $ luna_choice = 3
                    m "Отлично видя, как ты опытна во всем, к чему прикладываешь свою руку..."
                    call luna_main("Мммммм...", 6, 2, 2, 3) 
                    m "Я надеялся, что ты бы могла приложить свою руку к моему члену."
                    call luna_main("...", 8, 2, 1, 2) 
                    m "Пожалуйста..."
                    call luna_main("Серьезно? Вы хотите, что бы я трогала ваш мерзкий член?", 8, 1, 2, 3) 
                    call luna_main("Разве недостаточно того, что я позволяю трогать себя...", 9, 2, 3, 3) 
                    m "За это будет здоровенная награда..."
                    call luna_main("...", 8, 2, 3, 3) 
                    call luna_main("......", 8, 1, 2, 2) 
                    call luna_main("Ну, раз уж вы так вежливо просите...", 8, 1, 1, 1) 
                    m "..."
                    call luna_main("Идите сюда...", 7, 1, 3, 1) 
                    m "Фантастика! Позволь, я встану."
                    call luna_main("(Это не могло быть еще легче.)", 8, 2, 2, 1) 
                "-Умолять подрочить-" if luna_dom >= 7:
                    $ current_payout = 200
                    if luna_dom <= 8:
                        $ luna_dom += 1
                    $ luna_choice = 4
                    m "Ну, если это не так сложно..."
                    call luna_main("Мммммм...", 6, 2, 2, 3) 
                    m "Я надеялся, что ты..."
                    call luna_main("...", 8, 2, 1, 2) 
                    m "Подрочишь мне, своей рукой..."
                    call luna_main("В самом деле? Вы хотите, что бы я трогала ваш мерзкий член?", 8, 1, 2, 3) 
                    m "Если это не так сложно..."
                    call luna_main("Ну, я думаю, что могла бы.", 5, 2, 1, 1) 
                    call luna_main("Кто знает, кого вы вызовете, если я откажусь...", 8, 1, 3, 1) 
                    m "Спасибо тебе..."
                    call luna_main("...", 8, 2, 3, 3) 
                    call luna_main("......", 8, 1, 2, 2) 
                    call luna_main("Однако, я ожидаю справедливую компенсацию...", 8, 1, 1, 1) 
                    m "Конечно.."
                    call luna_main("Хорошо. Теперь, подойдите сюда...", 7, 1, 3, 1) 
                    m "Фантастика! Позволь, я встану."
                    call luna_main("(Это не могло быть еще проще...)", 8, 2, 2, 1) 
                    call luna_main("(С такой скоростью, я стану единственным человеком в его завещании к концу месяца...)", 9, 1, 3, 1) 

            show screen blkfade
            ">Ты поднимаешься, обходишь стол, встав перед Полумной."
            ">Ты распахиваешь свою мантию и вытаскиваешь член."
            hide screen bld1
            hide screen genie
            show screen chair_left
            show screen desk
            $ genie_chibi_xpos = -20
            $ genie_chibi_ypos = 10
            $ g_c_u_pic = "jerking_off_02_ani"
            show screen g_c_u
            with fade
            hide screen blktone
            hide screen blkfade
            with d5
            pause
            m "Ну..."
            call luna_main("...", 7, 8, 2, 3) 
            ">Полумна опускает глаза на твой член."
            call luna_main("Отвратительно...", 9, 8, 3, 1) 
            ">Она крепко берет его в свою правую руку."
            $ luna_r_arm = 3
            $ genie_sprite_xpos = 300
            $ luna_xpos = 390
            call gen_main("!!!", 4, 4) 
            call luna_main("*Хммммм* Во всяком случае, он не маленький...", 5, 8, 2, 1) 
            call luna_main("(Я не могу даже обхватить рукой.)", 5, 3, 3, 1) 
            ">Полумна начинает медленно поглаживать твой член рукой, ее движения грубые и неопытные."
            m "Почему бы тебе не попробовать взять его обеими руками, [luna_name]..."
            call luna_main("Хммм... Раз вы просите, [l_genie_name]!", 8, 1, 2, 2) 
            m "..."
            ">Полумна начинает двигать руками вперед и назад по твоему члену."
            m "Ох... Да, вот так..."
            call luna_main("(Он любит это...)", 6, 3, 3, 1) 
            m "Мммм, да... Вот так, [luna_name]..."
            call luna_main("Вам хорошо, [l_genie_name]?", 6, 1, 4, 14) 
            m "Да, да, это потрясающе..."
            call luna_main("Хорошо...", 6, 1, 4, 1) 
            call luna_main("Но...", 6, 2, 4, 2) 
            call luna_main("Вам нужно немного больше ободрения?", 8, 1, 4, 1) 
            m "Что ты задумала?"
            call luna_main("......", 9, 8, 3, 1) 
            menu:
                "-Полумна снимает свою рубашку-":
                    ">Полумна медленно сняла свой жилет и начинает расстегивать рубашку."
                    m "Мммм."
                    $ luna_wear_top = False
                    $ luna_choice = 1
                    ">Она сняла рубашку и положила ее на пол."
                    call luna_main("Теперь...", 8, 2, 4, 1) 
                    $ luna_r_arm = 2
                    m "Очень хорошо, [luna_name]!"
                    call luna_main("...", 7, 8, 4, 2) 
                    call luna_main("Благодарю вас, сэр...", 7, 1, 4, 1) 
                    $ luna_r_arm = 3
                    ">Она кладет руки обратно на твой член."
                    call luna_main("Мммм, намного лучше...", 5, 8, 2, 1) 
                    m "Боги, да."
                    call luna_main("...", 5, 1, 2, 1) 
                    call luna_main("Ну, раз уж вы такой хороший мальчик...", 8, 3, 2, 1) 
                    $ luna_wear_bra = False
                    $ luna_r_arm = 2
                    $ luna_l_arm = 2
                    ">Полумна медленно снимает свой лифчик, прежде чем положить свои руки обратно на твой член."
                    $ luna_r_arm = 3
                    $ luna_l_arm = 1
                    ">Полумна начинает ласкать твой член немного быстрее."
                "-Полумна дразнит тебя-":
                    $ luna_choice = 2
                    call luna_main("Давайте, Профессор...", 8, 2, 4, 1) 
                    ">Полумна начинает двигать руками вверх и вниз по твоему члену немного быстрее."
                    m "Мммм..."
                    call luna_main("Приготовьте побольше \'взбитых сливок\' для меня...", 7, 8, 4, 2) 
                    m "Ох, да..."
                    call luna_main("Будьте готовы спустить все, на свою ученицу.", 7, 1, 4, 1) 
                    ">Она ускоряет темп."
                    m "Ай..."
                    call luna_main("Мммм, больно, не правда ли?", 7, 3, 2, 1) 
                    m "Да..."
                    call luna_main("Действительно?...", 8, 1, 2, 1) 
                    ">Полумна не замедляется, скорее, она еще немного ускоряется."
                    g9 "Ах! Да!"
                    call luna_main("...", 9, 1, 3, 1) 
                    g9 "[luna_name]..."
                    call luna_main("Хм, вы хотите, что бы я немного смочила ваш член слюной?", 5, 1, 5, 1) 
                    g9 "Да... пожалуйста, [luna_name]..."
                    call luna_main("Хороший мальчик.", 7, 1, 2, 1) 
                    call luna_main("*Тьфу*", 5, 8, 2, 16) 
                    ">Полумна сплевывает на руку, прежде чем вернуть ее на твой член."
            g4 "Мммм, да, вот так, [luna_name]..."
            call luna_main("...", 7, 8, 2, 1) 
            g4 "Просто двигай руками вверх и вниз."
            call luna_main("......", 8, 1, 3, 1) 
            if luna_choice == 1:
                ">Полумна начинает слегка трясти своими сиськами, продолжая дрочить тебе."
                call luna_main("......", 5, 8, 2, 1) 
            else:
                call luna_main("*Тьфу*", 8, 8, 3, 16) 
                ">Полумна снова плюет на свою руку и снова обхватывает твой член."
            ">Затем, она начинает дрочить твой член еще быстрее."
            g4 "Боги, да..."
            g4 "(Куда бы мне кончить?)"
            menu:
                "-На ее лицо-":
                    ">Ты кладешь руку на голову Полумны и медленно пытаешься заставить ее опуститься на уровень твоей промежности."

                "-На ее грудь-":
                    ">Ты кладешь руку на плечо Полумны и медленно пытаешься заставить ее опуститься на один уровень с твоим поясом.."

            call luna_main("[l_genie_name]!!!", 7, 1, 3, 6) 
            call luna_main("Вы же не пытаетесь кончить на меня?", 8, 1, 3, 3) 
            g4 "Ааа, [luna_name], я уже почти!"
            call luna_main("Хмммм... (Я могла бы заработать еще немного денег с [l_genie_name]...)", 9, 8, 3, 3) 
            $ luna_wear_skirt = False
            $ luna_wear_bra = False
            $ luna_wear_panties = False
            $ luna_wear_top = False
            ">Полумна быстро раздевается, все время продолжая крепко держать твой член.."
            g4 "Быстрее! Ты испортишь этот чертов момент!"
            call luna_main("Ну, тогда выбирайте...", 5, 1, 4, 2) 
            g4 "Ты имеешь в виду..?"
            ">Она слегка наклоняется вперед, слегка покачивая своими молочными грудями."
            ">Ее правая рука все еще обхватывает твой член, пока она медленно его ласкает, удерживая тебя на грани."
            call luna_main("Выбирайте, куда вы хотите кончить...", 5, 8, 3, 1) 
            g4 "О да!"
            call luna_main("Вы можете выбрать мои груди...", 8, 2, 4, 2) 
            ">Она снова их встряхивает."
            call luna_main("Или мои бедра...", 5, 1, 2, 1) 
            ">Она потирает ими друг об друга, пока переминает ноги с пятки на пятку."
            call luna_main("За сиськи дополнительно 100...", 7, 1, 3, 1) 
            call luna_main("За бедра 50...", 7, 2, 2, 2) 
            g4 "Ох,{size=+2} тогда {size=+2}давай {size=+2}сюда!{/size}"
            menu:
                "-Грудь-":
                    $ current_payout += 100 
                    show screen g_c_c_u
                    $ luna_cum = 5
                    $ luna_wear_cum = True
                    show screen white 
                    pause.1
                    hide screen white
                    pause.2
                    show screen white 
                    pause .1
                    hide screen white
                    with hpunch
                    ">Ты начинаешь стрелять на ее грудь, покрывая ее сиськи спермой."

                "-Бедра-":
                    $ current_payout += 50 
                    show screen g_c_c_u
                    $ luna_cum = 10
                    $ luna_wear_cum = True
                    show screen white 
                    pause.1
                    hide screen white
                    pause.2
                    show screen white 
                    pause .1
                    hide screen white
                    with hpunch
                    ">Ты начинаешь брызгать на мягкие бедра Полумны, покрывая ее промежность спермой."

                "-{size=+10}ЛИЦО!{/size}-":
                    jump luna_cum_addict_event
            g4 "АГРХ! О боги, {size=+10}ДАА!{/size}"
            call luna_main("...", 5, 3, 1, 1) 
            call luna_main("(Она такая теплая...)", 5, 2, 4, 1) 
            g4 "{size=+10}ПОЛУЧИ ВСЕ, ШЛЮХА!{/size}"
            g4 "Мммммм....."
            hide screen g_c_c_u
            $ g_c_u_pic = "images/animation/06_jerking_01.png"
            $ luna_r_arm = 2
            hide screen genie_sprite
            with d3
            m "Какое точное попадание..."
            call luna_main("({image=textheart}{image=textheart}{image=textheart})", 5, 8, 4, 1) 
            if luna_choice == 1:
                $ luna_cum = 12
                ">Полумна собирает капли спермы на кончик своего пальца, тщательно рассмотрев, прежде чем положить в свой рот."
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                call luna_main("{size=+4}Это {size=+4}потрясающе!!!!!{image=textheart}{image=textheart}{/size}", 5, 8, 4, 1) 
                call luna_main("Но, пожалуйста, может просто спустите все мне в рот в следующий раз?", 5, 8, 4, 1) 
                m "Конечно..."
                ">Ты с благоговением смотришь за тем, как Полумна медленно собирает всю сперму в рот, а затем проглатывает ее."
                $ luna_cum = 13
                call luna_main("...", 5, 8, 4, 1) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                pause
                $ luna_cum = 14
                call luna_main("...", 5, 8, 4, 1) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                $ luna_cum = 15
                call luna_main("...", 5, 8, 4, 1) 
                call luna_main("{image=textheart}{image=textheart}{image=textheart}", 5, 8, 4, 1) 
                $ luna_wear_cum = False
                call luna_main("Ах...", 5, 8, 4, 1) 
                call luna_main("Удивительно...", 5, 8, 4, 1) 
            m "Аааа... Ты была фантастическая шлюха..."
            $ g_c_u_pic = "images/animation/06_groping_01.png"
            call luna_main("[l_genie_name]...", 6, 2, 2, 1) 

    $ luna_wear_skirt = True
    $ luna_wear_bra = True
    $ luna_wear_panties = True
    $ luna_wear_top = True 
    $ luna_wear_cum = False
    hide screen bld1
    with d3
    m "Ну, тогда вот твоя оплата, [luna_name]."
    $ gold -= current_payout
    $ luna_gold += current_payout
    ">Ты отдаешь Полумне [current_payout] галлеонов."
    call luna_main("Благодарю вас, [l_genie_name].", 5, 2, 1, 1) 
    ">Полумна покидает твой кабинет."  
    $ luna_wear_cum = False
    $ luna_wear_cum_under = False

    hide screen g_c_u
    show screen genie
    hide screen chair_left
    hide screen desk

    jump luna_away








label luna_favour_5: #Luna jerks Genie off onto Hermione's face
    
    if luna_corruption <= 11:
        $ luna_corruption += 1
        m "[luna_name], как бы ты отнеслась к продаже еще одной услуги?"
        call luna_main("...", 5, 1, 2, 1) 
        call luna_main("Что на этот раз, [l_genie_name]?", 7, 2, 2, 1) 
        m "Ну, ты помнишь как мы на днях немного повеселились с мисс Грейнджер?"
        call luna_main("...", 5, 1, 2, 1) 
        call luna_main("Продолжайте...", 6, 2, 2, 1) 
        m "Как ты относишься к тому, чтобы доставить ей еще немного веселья? "
        call luna_main("Вы действительно отвратительный извращенец, верно?", 7, 1, 3, 1) 
        m "..."
        call luna_main("Верно...", 9, 1, 2, 2) 
        m "Да..."
        call luna_main("По крайней мере вы честны в этом...", 8, 2, 4, 1) 
        call luna_main("Чего я больше не могу сказать об этой двуличной шлюхе, Гермионе...", 4, 8, 3, 3) 
        m "Так ты не против немного повеселиться с ней?"
        call luna_main("При одном условии.", 7, 1, 3, 1) 
        m "Назови его."
        call luna_main("Я держу себя в руках. Что бы не случилось.", 8, 2, 2, 2) 
        call luna_main("Даже если вы подумаете, что происходящее, довольно жесткое...", 8, 1, 2, 3) 
        call luna_main("У меня все под контролем... Поняли?", 9, 1, 3, 2) 
        m "Понял."
        call luna_main("Тогда ладно...", 2, 1, 4, 1) 
        call luna_main("Я также жду, что вы заплатите мне 150 галлеонов за мое беспокойство...", 7, 1, 4, 2) 
        m "Безусловно."
        call luna_main("...", 5, 2, 2, 1) 
        call luna_main("Прямо сейчас, [l_genie_name]...", 7, 1, 3, 3) 
        m "Ладно..."
        ">Ты заплатил Полумне 150 галлеонов."
        $ gold -=150 
        $ luna_gold += 150
        call luna_main("Благодарю, [l_genie_name]...", 7, 2, 4, 2) 
        call luna_main("...", 7, 1, 5, 2) 
        call luna_main("Ну что ж, давайте, зовите ее", 8, 1, 2, 4) 
        ">Ты вызвал Гермиону..."
        call play_sound("door") #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте профе-","soft","baseL") 
        call her_main("Полумна! Что ты здесь делаешь?","angry","wide") 
        call luna_main("То же самое, что и ты...", 5, 1, 2, 1) 
        call her_main("О, эм... видимо ты здесь... помогаешь профессору Дамблдору с чем-то...","open","worriedL") 
        call luna_main("Мкхмм...", 7, 1, 4, 1) 
        call her_main("Что ж, угх... что мы можем сделать для Дамблдора?","open","worried") 
        call luna_main("Вероятно, опустошить его мерзкие яички...", 8, 1, 2, 3) 
        call her_main("!!!","angry","wide") 
        call her_main("Полумна! Что ты несешь?","angry","worried") 
        call her_main("Ты в своем уме?","annoyed","worriedL") 
        call luna_main("Да ладно тебе Гермиона... это ведь не первый раз, когда ты помогаешь старику Дамблдору в этом?", 7, 2, 2, 1) 
        call luna_main("Не так ли...?", 7, 1, 2, 2) 
        call her_main("Я понятия не имею, о чем ты говоришь!","scream","angryCl") 
        call her_main("Профессор Дамблдор, должно быть, ошибся...","scream","angryCl") 
        call her_main("М-может, ему нужно сходить к медсестрам и проверить состояние своего рассудка...","scream","angryCl") 
        call luna_main("Так ты не продаешь услуги Дамблдору в обмен на очки?", 6, 1, 5, 2) 
        call her_main("Разумеется нет! Я бы никогда не сделала что-то на столько низкое!","scream","worriedCl") 
        call luna_main("Правда?", 7, 1, 5, 3) 
        call her_main("Конечно нет! Я в шоке, что ты вообще спрашиваешь!","annoyed","worriedL") 
        call luna_main("Тебе будет комфортно повторить это, после того, как ты выпьешь немного Правдариума?", 8, 1, 3, 2) 
        call her_main("!!!","angry","wide") 
        call her_main("Нуууу конечно... но на сколько тебе известно, это зелье запрещено...","open","closed") 
        call luna_main("Не для прославленного профессора Дамблдора!", 5, 2, 4, 1) 
        call luna_main("Не правда ли, сэр?", 7, 2, 3, 3) 
        m "О, эм, да, конечно, я легко могу его достать..."
        m "(Что еще за, мать его, провариум?)"
        call her_main("!!!","annoyed","frown") #angry face
        call her_main("Разумеется вы знаете, что в этом нет необходимости, сэр!","normal","frown") #angry face
        m "..."
        call her_main("...","annoyed","frown") 
        call luna_main("...", 7, 1, 1, 1) 
        call her_main("Ладно! Я признаюсь!","scream","worriedCl") 
        call luna_main("Видишь... Разве не лучше сразу сказать правду?", 8, 1, 4, 1) 
        call her_main("...","normal","worriedCl") 
        call her_main("Так вот зачем меня сюда позвали? Чтобы посмеяться надо мной?!","angry","angry") 
        call her_main("Я не стыжусь того, что сделала для своего факультета!","annoyed","annoyed") 
        call luna_main("Нет, тебя позвали сюда, чтобы продать Дамблдору одну из \"ЭТИХ\" услуг", 5, 1, 2, 1) 
        call her_main("Что?","upset","wink") 
        call her_main("Тогда зачем ты здесь?","soft","base") 
        call luna_main("Чтобы помочь тебе.", 7, 1, 4, 1) 
        call her_main("...","annoyed","angry") 
        call her_main("Помочь как?","disgust","glance") 
        call luna_main("Почему бы тебе не раздеться, чтобы я тебе показала...", 8, 8, 4, 1) 
        call her_main("[genie_name]... пожалуйста...","scream","worriedCl") 
        m "Прости, [hermione_name], мои руки связаны..."
        call her_main("...","normal","worriedCl") 
        call her_main("Должна ли я?","angry","worriedCl",emote="05") 
        call luna_main("Конечно нет... До тех пор, пока ты не против. Я не рассказываю в твоем \"ДПМ\" то, что тут происходит.", 8, 1, 3, 1) 
        call her_main("...","mad","worried",tears="soft") 
        call her_main("Ладно!","mad","worriedCl",tears="soft_blink") 
        call her_main("Я поняла что надо делать!","annoyed","annoyed",tears="crying") 
        ">Гермиона в гневе срывает верхнюю одежду."
        $ hermione_wear_top = False
        $ hermione_wear_bra = False
        call her_main("Не стесняйться, унижаться!","angry","angry",tears="crying") 
        ">Гермиона в гневе срывает свою юбку."
        $ hermione_wear_skirt = False
        $ hermione_wear_panties = False
        call her_main("За попытку сделать что-то правильно!","annoyed","annoyed",tears="crying") 
        ">Гермиона стоит обнаженная перед тобой и Полумной. Ее лицо искажено смесью гнева и смущения"
        call her_main("ВОТ! Теперь вы оба довольны?","annoyed","annoyed") 
        m "О да-"
        call luna_main("Почти...", 5, 3, 4, 1) 
        call luna_main("Теперь, почему бы тебе не встать на колени...", 7, 1, 2, 3) 
        call her_main("!!!","angry","wide",tears="crying") 
        call her_main("Прошу, Полумна... {size=-2}Прости {size=-2}меня, за то, {size=-2}что я сказала тебе в тот день...{/size}","annoyed","down",tears="crying") 
        call luna_main("На колени...", 9, 1, 4, 2) 
        hide screen hermione_main 
        $ hermione_SC.chibi.xpos = 40 #40 = Near Luna
        $ hermione_SC.chibi.ypos = 60
        $ h_c_u_pic = "characters/hermione/chibis/dance/08_sits.png"
        $ hermione_head_xpos=590
        show screen h_c_u 
        with d3
        call her_kneel("...","annoyed","ahegao") 
        call luna_main("Ну вот... разве так не проще? Разве это не твое естественное состояние?", 1, 3, 2, 2) 
        call her_kneel("...","annoyed","down") 
        call luna_main("Теперь... Мне нужна ваша помощь для следующего этапа, профессор.", 5, 2, 4, 1) 
        m "Что я должен делать?"
        call luna_main("Подойдите и встаньте перед вашей лучшей ученицей", 7, 3, 2, 1) 
        ">Ты встаешь со стула и подходишь к двум девушкам..."
        show screen blktone
        show screen blkfade
        hide screen bld1
        hide screen genie
        show screen chair_left
        show screen desk
        $ genie_chibi_xpos = -20
        $ genie_chibi_ypos = 10
        $ g_c_u_pic = "images/animation/06_jerking_01.png"
        show screen g_c_u
        with fade
        hide screen blktone
        hide screen blkfade
        with d5
        pause
        ">Гермиона смотрит на тебя с умоляющим выражением лица."
        call her_kneel("[genie_name]... пожалуйста... что происходит?","mad","worried",tears="soft") 
        call luna_main("Я сказала ты здесь за тем, чтобы продать свою услугу.", 7, 3, 2, 2) 
        call luna_main("Разве ты не хочешь этого? Продавать услуги Дамблдору?", 5, 8, 4, 1) 
        call her_kneel("Я хочу... я хочу чтобы \"Гриффиндор\" выиграл Кубок...","open","down") 
        if gryffindor > slytherin:
            call luna_main("Но \"Гриффиндор\" уже опережает [gryffindor-slytherin] по очкам...", 7, 3, 5, 4) 
            call luna_main("Ты правда думаешь, что им нужно больше очков, чтобы выиграть?", 7, 3, 4, 1) 
            call her_kneel("...","soft","squintL") 
        else:
            call luna_main("Ты правда думаешь, что будет справедливо, если ты продашь свое тело?", 8, 3, 2, 2) 
            call luna_main("*чшш* *чшш* *чшш* Что бы подумали твои родители?", 7, 3, 2, 4) 
            call her_kneel("Они не смогут понять...","annoyed","angryL") 
        ">Полумна засовывает руку в твои брюки и быстро вытаскивает твой твердый член."
        $ luna_r_arm = 3
        $ luna_flip = 1
        $ luna_xpos = 640
        $ hermione_head_xpos = 590
        $ hermione_head_ypos = 390
        $ genie_sprite_xpos = 550
        call gen_main("!!!", 4, 2) 
        call luna_main("Просто признай это...", 8, 8, 4, 1) 
        call luna_main("Ты шлюха...", 9, 8, 1, 1) 
        call her_kneel("{size=-5}Нет... Я... порядочная ученица...{/size}","open","baseL") 
        pause
        ">Полумна начала скользить своей гладкой рукой вверх и вниз по твоему члену"
        call luna_main("Хммм... Я не думаю, что порядочная ученица будет такое вытворять...", 5, 2, 4, 4) 
        call her_kneel("...","soft","squintL") 
        call luna_main("Будет охотно стоять на коленях перед своим директором..", 7, 3, 2, 1) 
        call her_kneel("...","grin","ahegao") 
        call luna_main("Обнаженной...", 8, 8, 2, 1) 
        call her_kneel("...","angry","down_raised") 
        call luna_main("В то время как другая ученица ему дрочит...", 5, 2, 4, 1) 
        call her_kneel("...","soft","ahegao") 
        call luna_main("Терпеливо ожидая пока он не кончит...", 8, 3, 4, 5) 
        call her_kneel("{image=textheart}{image=textheart}{image=textheart}","grin","dead") 
        pause
        call luna_main("На самом деле, я знаю только один вид учеников, которые бы сделали такое... ", 5, 3, 2, 1) 
        call luna_main("Ты ведь знаешь что это за вид, в который входишь ты, Гермиона?", 7, 8, 4, 1) 
        call her_kneel("Ах...{image=textheart} шлю.....","soft","squintL") 
        call luna_main("Ммммм, продолжай...", 5, 3, 2, 1) 
        call her_kneel("Ах... {p} шлюхи...{image=textheart}","open","baseL") 
        call luna_main("Хорошая девочка...", 5, 3, 4, 1) 
        call her_kneel("{image=textheart}{image=textheart}{image=textheart}","grin","dead") 
        m "Ох... Уже почти, [luna_name]..."
        ">Полумна сжала твой член еще жестче"
        g9 "ОХ!"
        call luna_main("Не сейчас старик!", 8, 1, 3, 3) 
        call luna_main("Она еще не усвоила свой урок!", 8, 3, 3, 1) 
        m "Что еще ей нужно сделать?"
        call luna_main("...", 7, 2, 2, 4) 
        call luna_main("Лизать его...", 8, 3, 4, 3) 
        call her_kneel("...","shock","wide") 
        call her_kneel("Хорошо...","soft","squintL") 
        ">Гермиона открывает рот и вытаскивает свой язык."
        call her_kneel("Ах...","open_wide_tongue","squintL") 
        call luna_main("...", 7, 8, 2, 3) 
        call luna_main("Видимо, я должна сделать все остальное...", 6, 2, 2, 2) 
        ">Полумна резко потянула тебя за член вперед, направляя в открытый рот Гермионы"
        g4 "!!!"
        $ luna_xpos += 45
        $ genie_sprite_xpos += 45
        $ luna_xpos += 10
        $ genie_sprite_xpos += 10
        $ hermione_kneel_cock = True
        call her_kneel("...","open_wide_tongue","ahegao") 
        ">Гермиона начала бегать язычком по всей длине твоего члена, пока Полумна дрочить его."
        g4 "Ах!!!"
        g4 "Вот так, шлюшки!"
        call luna_main("Сделайте это..", 5, 1, 4, 1) 
        call her_kneel("Мммм...{image=textheart}{image=textheart}{image=textheart}","open_wide_tongue","ahegao") 
        call luna_main("Обкончайте эту шлюху...", 7, 3, 3, 1) 
        g9  "Аргх! О Боги, {size=+10}ДА!{/size}"
        $ luna_xpos -= 45
        $ genie_sprite_xpos -= 45
        $ luna_xpos -= 10
        $ genie_sprite_xpos -= 10
        $ hermione_kneel_cock = False
        g9  "{size=+10}ПОЛУЧИ ЕЕ ВСЮ, ШЛЮХА!{/size}"
        show screen white 
        pause.1
        $ luna_r_arm = 4
        hide screen white
        pause.2
        $ uni_sperm = True
        $ u_sperm = "characters/hermione/face/auto_07.png"
        show screen white 
        pause .1
        hide screen white
        with hpunch
        $ luna_r_arm = 3
        ">Ты кончаешь на лицо Гермионы, покрывая ее толстым слоем спермы."
        call her_kneel("!!!!","silly","ahegao_raised",cheeks="blush") 
        g9 "{size=+10}ДА!{/size}"
        call luna_main("Ммммм, хорошая девочка...", 5, 3, 4, 1) 
        ">Полумна продолжает медленно гладить твой член, извлекая последние пару капель спермы на нос Гермионы"
        pause
        call luna_main("Прекрасно...", 1, 3, 4, 1) 
        call her_kneel("...","grin","dead") 
        m "Это было великолепно!"
        $ luna_r_arm = 1
        hide screen genie_sprite
        with d3
        hide screen bld1
        show screen genie
        hide screen chair_left
        hide screen desk
        hide screen g_c_u
        call luna_main("...", 5, 8, 4, 1) 
        $ luna_flip = -1
        $ luna_xpos = 300
        if luna_addicted == True:
            call luna_main("Что ж, это еще не конец...", 5, 2, 4, 1) 
            call her_kneel("...что?","mad","wide",cheeks="blush") 
            call her_kneel("Почему?","open","baseL",cheeks="blush") 
            call luna_main("Только посмотри на себя!", 4, 3, 4, 5) 
            call luna_main("Ты вся в сладкой сперме, [l_genie_name]!", 5, 3, 4, 1) 
            call her_kneel("Сладкой...","disgust","down_raised") 
            call her_kneel("Ты хочешь, чтобы я убрала ее с себя?","upset","wink") 
            call luna_main("Чтобы такая шлюха, как ты, в пустую потратила эту потрясающую сперму?!", 4, 3, 2, 3) 
            call luna_main("Нет, я думаю, мне придется убрать этот беспорядок самостоятельно...", 4, 3, 4, 1) 
            ">Ты заметил голод в глазах Полумны..."
            call her_kneel("Это значит...","disgust","glance") 
            call luna_main("Давай Гермиона, у нас нет на это времени...", 7, 2, 2, 2) 
            call luna_main("Занятия трансфигурации начнуться через 5 минут...", 7, 2, 3, 3) 
            call luna_main("Так что поторопись...", 7, 3, 2, 2) 
            call her_kneel("(Я не могу опоздать на урок Макгонагалл...)","annoyed","down") 
            call her_kneel("Я не знаю чего ты от меня хочешь...","annoyed","angryL") 
            call luna_main("Встань сейчас же, шлюха...", 9, 3, 3, 2) 
            call her_kneel("...","annoyed","angry") 
            hide screen hermione_kneel
            $ hermione_xpos = 480
            show screen hermione_main 
            with d3
            ">Гермиона медленно встает, ее лицо все еще покрыто спермой..."
            $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
            call luna_main("Ммммм... посмотри на себя... ты так приятно пахнешь...", 1, 6, 4, 1) 
            $ luna_xpos = 600
            $ luna_r_arm = 2
            ">Полумна приблизилась к Гермионе, затем зачерпнула своим пальцем немного спермы и засунула себе в рот."
            call her_main("!!!","angry","wide") 
            m "(Ух ты...)"
            $ luna_xpos = 630
            call luna_main("Ммммм... на вкус ты еще лучше...", 2, 1, 4, 1) 
            call her_main("...","open","worriedCl") 
            ">Гермиона стояла на месте, позволяя Полумне медленно вытирать сперму с ее лица"
            $ u_sperm = "characters/hermione/face/auto_08.png"
            call her_main("...","shock","worriedCl") 
            call luna_main("Ммммм...", 2, 1, 4, 13) 
            ">Полумна медленно заполняет свой рот спермой, прежде чем проглотить ее"
            call luna_main("*Гулп*", 5, 6, 4, 1) 
            ">И наконец она засунула последнюю порцию спермы в рот."
            $ uni_sperm = False
            call her_main("...","disgust","down_raised") 
            call luna_main("...", 2, 1, 4, 13) 
            call luna_main("*Гулп*", 5, 6, 4, 1) 
            call her_main("...","annoyed","worriedL") 
            $ luna_l_arm = 2
            $ luna_flip = 1
            $ luna_xpos = 300
            call luna_main("Что ж, мне лучше пойти в...класс...", 1, 2, 2, 1) 
            call luna_main("До свидания, [l_genie_name]...", 5, 1, 4, 1) 
            call luna_main("Пока шлюха...", 7, 2, 2, 2) 
            ">Полумна тихо вышла из кабинета."
            hide screen luna_chibi
            hide screen luna 
            call luna_reset 
            $ luna_busy = True
            with d3
            ">Гермиона тихонько оделась, все еще находясь в шоке..."
        else:
            call luna_main("Что ж, это еще не конец...", 6, 2, 2, 1) 
            call her_kneel("...что?","mad","wide",cheeks="blush") 
            call her_kneel("Почему?","open","baseL",cheeks="blush") 
            call luna_main("Только посмотри, что ты наделала!", 7, 3, 2, 2) 
            call luna_main("Ты должна будешь почистить это, прежде чем пойдешь в класс!", 7, 3, 3, 1) 
            call her_kneel("Ну, обычно я хожу в ванну старост...","annoyed","worriedL") 
            call her_kneel("Или вытираюсь полотенцем...","annoyed","down") 
            call her_kneel("{size=-5}Но никогда не использую заклинание Скарджифай, какой бы ни была причина...{/size}","annoyed","angryL") 
            call luna_main("И тратишь в пустую всю ту потрясающую сперму, которую дает тебе профессор?!", 4, 3, 2, 3) 
            call luna_main("Нет уж, думаю, я останусь здесь и прослежу, чтобы ты избавилась от нее как следует...", 7, 3, 2, 1) 
            call her_kneel("Значит...","angry","wide") 
            call luna_main("Давай Гермиона, у нас нет на это времени...", 5, 3, 4, 1) 
            call luna_main("Занятия трансфигурации начнуться через 5 минут...", 7, 3, 2, 2) 
            call her_kneel("(Я не могу опоздать на занятия к Макгонагалл...)","angry","down_raised") 
            call luna_main("Поэтому расправься с этой спермой, как хорошая маленькая шлюшка... ", 8, 3, 4, 1) 
            call her_kneel("...","soft","ahegao") 
            ">Гермиона медленно заталкивает твою сперму себе в рот своими пальчиками."
            $ luna_l_arm = 4
            $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
            call luna_main("Мммм... Вот так... Убедись, что ни капли не потеряешь, шлюха...", 5, 3, 4, 1) 
            m "(Ух ты...)"
            ">Гермиона медленно продолжает очищать лицо от спермы."
            $ u_sperm = "characters/hermione/face/auto_08.png"
            call her_kneel("...","full_cum","dead") #Cheek full
            ">Она полностью заполняет рот спермой, прежде чем всю ее проглотить"
            call her_kneel("*Гулп*","cum","worriedCl") 
            ">В итоге она засунула последнюю порцию спермы в рот."
            $ uni_sperm = False
            call her_kneel("...","full_cum","dead") #Cheek full
            call luna_main("Видишь, хорошие шлюхи не теряют ни капли, верно?", 5, 3, 4, 5) 
            call her_kneel("...","full_cum","dead") #Cheek full
            $ luna_l_arm = 2
            call luna_main("Что ж, мне лучше пойти в...класс...", 1, 2, 2, 1) 
            call luna_main("До свидания, [l_genie_name]...", 5, 1, 4, 1) 
            call luna_main("Пока шлюха...", 7, 2, 2, 2) 
            ">Полумна тихо вышла из кабинета."
            hide screen luna_chibi
            hide screen luna 
            with d3
            ">Гермиона последний раз сглатывает полный рот спермы."
            call her_kneel("*Гулп*","cum","worriedCl") 
            call her_kneel("Мммм...{image=textheart}{image=textheart}{image=textheart}","grin","dead") 
            ">Она грациозно поднимается с пола и обращается к тебе, перед тем,как одеться."
        $ hermione_wear_panties = True
        $ hermione_wear_skirt = True
        $ hermione_wear_top = True
        $ hermione_wear_bra = True
        $ hermione_SC.chibi.xpos = 500 #Near the desk: 400. (210 - standing on desk.)
        $ hermione_SC.chibi.ypos = 260#Default: 250. (180- standing on desk.)
        show screen hermione_blink #Hermione stands still.
        call update_her_uniform 
        hide screen hermione_kneel 
        with d3
        call her_main("[genie_name], что это, мать вашу, было?!","scream","angryCl") 
        call her_main("Почему, мать ее, Полумна была здесь?!","annoyed","angryL") 
        call her_main("Откуда она, мать ее, узнала, что я продаю услуги?!","angry","angry") 
        if luna_addicted == True:
            call her_main("И {size=+5}какого черта{/size} она так любит вкус вашей спермы?","angry","angry",emote="01") 
        m "Я все могу объяснить..."
        call her_main("Уж пожалуйста...","annoyed","annoyed") 
        m "Ты помнишь как сама называла Полумну Лавгуд сумасшедшей?"
        call her_main("Конечно. Все знают, что она чокнутая.","annoyed","angryL") 
        m "Ну так вот, я испытывал новые заклинания..."
        m "И я пытаюсь вылечить ее от этого состояния..."
        m "(Надеюсь она поверит в эту чушь...)"
        call her_main("Правда?","shock","wide") 
        call her_main("Но ковыряться в ее разуме разве немного не...","soft","squintL") 
        call her_main("Неэтично?","angry","down_raised") 
        m "Да, в обычной ситуации ты была бы права, но это скорее лечение от существующего психического заболевания."
        m "Думай об этом так, будто я пытаюсь вылечить ее от болизни Аспергера."
        call her_main("Вообще-то, сэр, Аспергеры были реклассифицированы как часть спектра аутизма и больше не считаются болезнью, как таковой.","open","closed") 
        m "..."
        m "(Ясное дело, она это знала...)"
        m "Ну, в любом случае, в моих действиях нет ничего плохого. "
        call her_main("...","annoyed","angryL") 
        call her_main("Хорошо, тогда...","open","closed") 
        call her_main("Но почему она такая странная?","open","worriedCl") 
        m "Я не уверен. Может быть это настоящая она."
        call her_main("Я полагаю, что это не так...","annoyed","down") 
        call her_main("Но почему она вам дрочила?","open","down") 
        m "Оу, эм..."
        m "Ну, это просто случилось в то время, пока я занимался оцениванием... "
        m "Она чем угодно хотела помочь своему отцу с его журналом, и одно привело к другому..."
        if luna_addicted == True:
            call her_main("А что на счет ее любви ко вкусу вашей спермы?","angry","suspicious",cheeks="blush") 
            m "Честно говоря, я не совсем в этом уверен."
            m "Я думаю она просто странно себя ведет..."
        call her_main("...","annoyed","angry") 
        call her_main("Ух, хорошо...","annoyed","baseL") 
        call her_main("Я полагаю...","annoyed","angryL",cheeks="blush") 
        m "Так ты не против помочь ей с этим в будущем?"
        call her_main("Что? Я должна проводить с ней еще больше времени?","soft","wide") 
        call her_main("Но она же и правда странная...","open","worriedCl",cheeks="blush") 
        m "Мы можем поработать над этим. Кроме того, разве ты не хочешь помочь одной из своих подруг?"
        call her_main("Хммм, полагаю вы правы, [genie_name].","annoyed","closed") 
        call her_main("Я не могу даже представить себе, чтобы, вечно мечтающая Полумна, могла сделать что-то хорошее в реальном мире.","open","squint",cheeks="blush") 
        call her_main("И как ее подруга, я обязана попытаться спасти ее от этого!","open","baseL",cheeks="blush") 
        call her_main("!!!","soft","wide") 
        call her_main("Может быть, мы могли бы даже вместе ходить на занятия!","grin","baseL") 
        call her_main("Я всегда хотела учиться вместе с кем-то! Обычно я была с Гарри, но я уверена, что он просто пялиться на мою грудь...","annoyed","annoyed") 
        call her_main("(Не то чтобы я была против...)","open","baseL") 
        menu:
            "-Поддержать дружбу-":
                $ luna_friendship = 1
                $ luna_hatred = 0
                m "Уверен, она бы с радостью провела с тобой еще немного времени."
                call her_main("Вы так думаете, сэр? Сегодня она казалась довольно злой.","open","down") 
                m "Она придет в себя, просто дай ей время."
                call her_main("Надеюсь, сэр! Было бы классно иметь подругу для исследований из Когтеврана!","smile","happyCl",emote="06") 
                m "(Скорее подругу для траха...)"
                call her_main("...","base","happyCl") 
            "-Препятствовать дружбе-":
                $ luna_friendship = 0
                $ luna_hatred = 1
                m "Я не уверен в этом. Сегодня она была довольно злой."
                call her_main("Хммм, вы наверное правы.","annoyed","base") 
                m "Может быть, стоит вышибать клин клином?"
                call her_main("То есть быть злой в ответ?","disgust","down_raised") 
                call her_main("Я не знаю [genie_name]... Она моя подруга...","clench","down_raised") 
        m "В любом случае, спасибо сегодня, за помощь."
        call her_main("Для моих друзей, все, что угодно [genie_name]...","soft","squintL") 
        m "(Это касается и меня?)"
        m "Верно, что ж, 60 очков \"Гриффиндору\"!"
        $ gryffindor += 60
        call her_main("Спасибо, [genie_name]...","open","baseL") 
        $ luna_busy = True
        jump end_hg_pf

    elif luna_corruption <= 12: #second time
        $ luna_corruption += 1
        $ luna_payout = 150
        $ hermione_payout = 40
        m "Как на счет еще одной дрочки с участием мисс Грейнджер?"
        call luna_main("Правда?", 7, 1, 5, 2) 
        call luna_main("Вы хотите снова ее в это втянуть?", 8, 1, 2, 3) 
        m "Если тебя это не затруднит..."
        call luna_main("*Мкхм* пока вы мне платите, мне плевать, притащите ли вы сюда эту маленькую шлюху.", 6, 2, 2, 2) 
        m "Великолепно! Я позову ее прямо сейчас."
        call luna_main("...", 6, 2, 2, 3) 
        ">Ты вызвал Гермиону в свой кабинет."
        call play_sound("door") #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте, [genie_name]...","base","base") 
        call her_main("Здравствуй Полумна...","open","suspicious") 
        call luna_main("Гермиона...", 6, 1, 2, 2) 
        call her_main("Что ты здесь делаешь?","annoyed","angryL") 
        call luna_main("Готовлюсь дрочить Дамблдору на твое лицо...", 5, 1, 2, 1) 
        call her_main("Оу...","annoyed","base") 
        call her_main("Снова?","upset","wink") 
        m "Может обвинишь меня?"
        call her_main("Полагаю, что нет...","grin","baseL") 
        call luna_main("Вот и хорошо...", 8, 1, 2, 2) 
        call her_main("Что?","annoyed","angry") 
        call luna_main("Поторопись и разденься, чтобы мы поскорее покончили с этим...", 6, 2, 2, 2) 
        call her_main("Почему я должна всегда раздеваться?","scream","angryCl") 
        call luna_main("Потому что я так сказала...", 9, 1, 1, 3) 
        call luna_main("Если уж ты не хочешь...", 7, 2, 1, 2) 
        call her_main("Думаю, я не против. Просто это немного несправедливо, что только я так делаю, однако...","annoyed","ahegao") 
        call luna_main("Однако.", 9, 1, 3, 3) 
        menu:
            "-Раздеть Полумну-":
                m "Так, так, а мисс Грейнджер права. Будет справедливо, если вы обе разденетесь."
                call luna_main("...", 4, 2, 2, 2) 
                call her_main("Ну же Полумна... Мы обе девочки, не нужно стесняться.","grin","baseL") 
                call luna_main("Стесняться? Вот еще.", 6, 2, 2, 2) 
                call her_main("Тогда быстрее раздевайся. Ты же хочешь поскорее покончить с этим?","smile","baseL") 
                call luna_main(".........", 7, 1, 3, 2) 
                call luna_main("Ладно... Но я ожидаю надбавку за это, [l_genie_name]!", 1, 2, 2, 2) 
            "-Согласиться с Полумной-":
                m "Ну, а теперь, слушайся Полумну, [hermione_name]."
                call her_main("Что? Почему?","angry","angry") 
                m "Ну, если быть честным, то потому, что я хочу снова увидеть твое обнаженное тело..."
                call her_main("Ох... тогда ладно.","base","squint") 
                call luna_main("А меня значит увидеть голой вы не хотите?", 8, 1, 2, 2) 
                m "Я не это имел в виду-"
                call luna_main("*Кхмх* Тогда, пожалуй разденусь, [l_genie_name]... Просто чтобы вы оценили, у кого тело лучше...", 5, 1, 2, 2) 
                call luna_main("Но я ожидаю надбавку за это, [l_genie_name]!", 7, 2, 2, 3) 
        m "Разумеется. Я добавлю еще 40 галлеонов."
        $ luna_payout += 40
        call her_main("Если она получила надбавку, то я тоже хочу больше очков!","scream","angryCl") 
        m "Как угодно. Добавляю еще 20 очков Гриффиндору."
        $ hermione_payout += 20
        call her_main("Ееей!","smile","baseL") 
        call luna_main("Я все еще не могу поверить, что ты волнуешься из-за очков.", 6, 9, 2, 2) 
        call her_main("Почему? Разве ты не хотела бы увидеть взволнованные лица своих друзей, когда они выиграют Кубок?","base","squint") 
        call her_main("И эти разочарованные противные лица Слизеринцев, когда они проиграют!","base","ahegao_raised") 
        call luna_main("Пффф, друзей...", 1, 2, 3, 2) 
        call her_main("Ауу... Полумна...","open","worried") 
        call luna_main("Просто заткнись и раздевайся, шлюха.", 8, 1, 3, 3) 
        call her_main("Хорошо...","annoyed","down") 
        show screen blkfade
        with d3
        ">Полумна и Гермиона обе раздеваются перед тобой."
        ">Ты не можешь поверить своим глазам, как они медленно раздеваются перед друг другом."
        ">Когда они бросают свою одежду в кучу, ты медленно встаешь и начинаешь дрочить член."
        call luna_main("На колени, шлюха...", 5, 8, 2, 1) 
        hide screen hermione_main 
        $ hermione_SC.chibi.xpos = 40 #40 = Near Luna
        $ hermione_SC.chibi.ypos = 60
        $ h_c_u_pic = "characters/hermione/chibis/dance/08_sits.png"
        $ hermione_head_xpos=590
        show screen h_c_u 
        with d3
        hide screen bld1
        hide screen genie
        show screen chair_left
        show screen desk
        $ genie_chibi_xpos = -20
        $ genie_chibi_ypos = 10
        $ g_c_u_pic = "images/animation/06_jerking_01.png"
        show screen g_c_u
        with fade
        $ luna_r_arm = 3
        $ luna_flip = 1
        $ luna_xpos = 640
        $ hermione_head_xpos = 590
        $ hermione_head_ypos = 390
        $ genie_sprite_xpos = 550
        show screen genie_sprite

        $ luna_wear_top = False
        $ luna_wear_bra = False
        $ luna_wear_skirt = False
        $ luna_wear_panties = False
        hide screen blkfade
        with d3
        call her_kneel("...","base","closed") 
        ">Полумна медленно начинает дрочить твой член перед лицом Гермионы."
        ">Ее техника грубая и неопытная, но самодостаточная."
        $ luna_r_arm = 3
        call luna_main("Мммм, как вам, [l_genie_name]...", 5, 8, 2, 1) 
        call her_kneel("...","annoyed","worriedL") 
        call her_kneel("......","annoyed","angry") 
        call her_kneel(".........","annoyed","annoyed") 
        call luna_main("Что-то не так Гермиона?", 7, 3, 2, 2) 
        call her_kneel("Нет...","annoyed","down") 
        call luna_main("Хорошо. А что тогда.", 5, 3, 2, 1) 
        call her_kneel("Ты делаешь это неправильно!","scream","angry",emote="01") 
        call luna_main("Что?", 4, 3, 1, 2) 
        call her_kneel("Ему нравится по-другому.","annoyed","angryL") 
        call luna_main("Уверена? Он, кажется, наслаждается от моих движений...", 7, 3, 2, 3) 
        call her_kneel("Он просто не показывает этого, тебе нужно сосредоточиться на кончике.","annoyed","angry") 
        call her_kneel("Иначе он долго не кончит...","annoyed","annoyed") 
        call luna_main("Хм*", 7, 2, 2, 2) 
        call luna_main("Почему бы нам не спросить старого извращенца, кто ему больше нравится...", 8, 3, 3, 2) 
        call her_kneel("Хорошо. Кого вы предпочитаете, [genie_name]?","annoyed","base") 
        menu:
            "-Полумна-":
                call her_kneel("Что!","angry","angry",emote="01") 
                call her_kneel("Это смешно! Я гораздо лучше, работаю ручками!","annoyed","annoyed") 
                call luna_main("Знаешь если ты думаешь что просто дергать его член это все.", 7, 8, 1, 1) 
                call her_kneel("Что ты сказала?","annoyed","angryL") 
                call luna_main("Речь о возбуждении...", 5, 8, 2, 1) 
                ">Полумна слегка сжимает твой член."
                m "Ах..."
                call her_kneel("*Хм* Хотя бы, позвольте мне показать, как это делается...","disgust","glance") 
                call her_kneel("Я уверена, что смогу показать как нужно \"возбуждать\".","annoyed","annoyed") 
            "-Гермиона-":
                call luna_main("ЧТО?", 4, 1, 3, 3) 
                ">Полумна сжимает твой член со всей силы, это очень больно."
                call gen_main("АХ!", 2, 4) 
                call her_kneel("Не переживай об этом слишком сильно, у меня в этом \"немного\" больше опыта.","base","happyCl") 
                ">Полумна отпускает твой член."
                $ genie_sprite_exp = "characters/genie/exp_1.png"
                $ luna_r_arm = 1
                call luna_main("*хммм*. Я думаю, что ты права. Ты вероятно провела весь год надрачивая все члены, которые смогла найти.", 9, 8, 3, 3) 
                call her_kneel("Хей!","annoyed","annoyed") 
                call luna_main("Я не права?", 7, 8, 2, 1) 
                call her_kneel("...","disgust","down_raised") 
                call her_kneel("По крайней мере, позволь мне показать, как это делать...","annoyed","annoyed") 
        call luna_main("Мне все равно...", 6, 2, 2, 2) 
        call her_kneel("...","base","baseL") 
        show screen blkfade
        with d3
        $ hermione_zorder = 4 #CHANGE BACK TO 5 AFTER THIS
        hide screen hermione_kneel
        ">Гермиона и Полумна меняются местами и Гермиона берет твой член."
        ">Ты не можешь отрицать, что она намного более опытна, нежели Полумна. Она быстро доводит тебя до пика."
        $ luna_ypos = 250
        $ hermione_right_arm = "characters/hermione/body/arms/right/dick.png"
        $ genie_sprite_base = "characters/genie/base_2.png"
        $ genie_sprite_exp = "characters/genie/exp_4.png"
        $ hermione_xpos = 590

        $ hermione_wear_top = False
        $ hermione_wear_bra = False
        $ hermione_wear_skirt = False
        $ hermione_wear_panties = False
        call update_her_uniform 

        show screen hermione_main

        hide screen blkfade
        with d3
        m "Ах... Это - так, [hermione_name]... Я уже скоро."
        call her_main("Ммм, вот так [genie_name]. Просто наслаждайтесь.","open","baseL") 
        call luna_main("Как будто это возможно...", 7, 2, 2, 2) 
        g9 "Ах..."
        call luna_main("Ну-же [l_genie_name], скажите ей, что я лучше.", 8, 9, 2, 2) 
        ">Ты едва можешь бормотать в ответ."
        g9 "Угх..."
        call luna_main("...", 9, 9, 2, 2) 
        call luna_main("Скажите ей, что я лучше!", 9, 9, 3, 3) 
        g9 "Мммм"
        call her_main("Я не уверена, что он слышит тебя... Сейчас он утонул в наслаждении.","open","down") 
        call her_main("Меньше разговоров... Вы готовы [genie_name]?","soft","squintL") 
        g9 "Угх... Да... Я уже скоро, шлюхи!"
        call her_main("Вот и хорошо смотри Полумна, как нужно работать ручками.","base","down") 
        call luna_main("...", 5, 2, 4, 2) 
        call her_main("Смотри, видишь как ему нравится, когда я глажу ладонью его головку...","base","suspicious") 
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        $ luna_cum = 12
        $ luna_wear_cum = True
        g4 "{size=+5}АРГХ! О боги ДАА!!!{/size}"
        g4 "{size=+5}КАК ТЫ ЭТО ДЕЛАЕШЬ, ДЕВЧЕНКА??!!{/size}"
        ">Твой член взрывается покрывая спермой лицо Полумны. Под таким слоем спермы ее лица почти не видно."
        $ luna_cum = 12
        $ luna_wear_cum = True
        call luna_main("Мммм...", 4, 1, 4, 1) 
        call her_main("Вот так, просто выпусти свою {b}отвратительную{/b} сперму.","grin","ahegao") 
        $ g_c_u_pic = "images/animation/06_jerking_01.png"
        $ genie_sprite_base = "characters/genie/base_2.png"
        $ luna_cum = 12
        ">Полумна соберает сперму со своего лица и отправляет ее в рот."
        call luna_main("{image=textheart}{image=textheart}{image=textheart}", 7, 8, 2, 1) 
        call luna_main("Она не отвратительная!", 5, 8, 2, 1) 
        call her_main("Ох... какая ты грязная спермоедка.","angry","down_raised") 
        call luna_main("Ты не права, я не такая!", 7, 9, 2, 2) 
        call her_main("Значит, ты не собираешься съесть всю эту \'Восхитительную\' сперму со своего лица?","base","suspicious") 
        call luna_main("...", 5, 8, 2, 1) 
        ">Ты удивленно смотришь как Полумна медленно собирает сперму себе в рот, затем немного поиграв с ней языком, глотает ."
        $ luna_cum = 13
        call luna_main("...", 5, 6, 4, 13) 
        call her_main("Вот так, спермоедка...","base","glance") 
        call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
        pause
        $ luna_cum = 14
        call luna_main("...", 5, 6, 4, 13) 
        call her_main("Продолжай...","base","down") 
        call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
        $ luna_cum = 15
        call luna_main("...", 5, 6, 4, 13) 
        call her_main("Мммм...","grin","baseL") 
        call luna_main("{image=textheart}{image=textheart}{image=textheart}", 2, 8, 4, 1) 
        $ luna_wear_cum = False
        call luna_main("...", 5, 6, 4, 13) 
        call luna_main("*Гулп*", 2, 8, 4, 1) 
        call luna_main("Ах...", 2, 8, 4, 1) 
        call luna_main("Невероятно...", 5, 9, 4, 1) 
        call luna_main("Я не знала, что вы можете кончить так много...", 1, 9, 4, 1) 
        call her_main("Ты удивлена? Просто надо знать, как правильно доставлять удовольствие.","open","closed") 
        call her_main("Эта не твоя дрянная техника...","annoyed","suspicious") 
        call luna_main("Она не так уж и плоха...", 7, 9, 4, 2) 
        call her_main("Это ты так думаешь...","open","closed") 
        call luna_main("...", 8, 9, 2, 2) 
        call luna_main("Ладно... Я не так хороша в ласках руками, как ты...", 6, 2, 1, 2) 
        call luna_main("Но это только потому, что ты провела весь год здесь, занимаясь распутством с нашим директором!", 9, 9, 3, 2) 
        call her_main("Хорошо, я могу научить тебя нескольким вещам, если ты хочешь.","smile","baseL") 
        call luna_main("Что?", 7, 9, 1, 4) 
        call luna_main("Почему ты хочешь помочь мне?", 7, 9, 4, 2) 
        call her_main("Я не делаю это за бесплатно...","open","baseL") 
        call luna_main("...", 5, 8, 2, 2) 
        call luna_main("Чего ты хочешь?", 6, 9, 4, 3) 
        call her_main("Прежде чем я скажу тебе, ты должна ответить на один вопрос...","open","baseL") 
        m "(Ух... Я должен сесть, в конце концов.)"
        show screen blkfade
        with d3
        ">Ты медленно пятишься к своему столу и садишься, в то время как Гермиона и Полумна продолжают болтать."
        $ hermione_xpos = 550
        $ luna_ypos = 0
        $ luna_xpos = 450
        $ luna_flip = -1
        $ hermione_right_arm = "characters/hermione/body/arms/right/right_1.png"
        $ hermione_zorder = 5
        hide screen genie_sprite
        show screen genie
        hide screen chair_left
        hide screen desk
        hide screen g_c_u
        $ hermione_SC.chibi.xpos = 600 #Near the desk: 400. (210 - standing on desk.)
        $ hermione_SC.chibi.ypos = 260#Default: 250. (180- standing on desk.)
        show screen hermione_blink #Hermione stands still.
        call update_her_uniform 
        hide screen blkfade
        with d3
        call luna_main("Хорошо...", 6, 1, 2, 2) 
        call her_main("Как твои оценки?","base","base") 
        call luna_main("ЧТО?", 4, 1, 4, 15) 
        call luna_main("Мои оценки? Почему тебя это волнует?", 7, 1, 2, 4) 
        call her_main("Это - простой вопрос...","base","down") 
        call luna_main("Хорошо, я не собираюсь отвечать на него...", 8, 1, 3, 3) 
        call her_main("Если ты не хочешь отвечать, я уверена, что Дамблдор не будет очень рад...","base","glance") 
        call luna_main("...", 9, 1, 3, 3) 
        call luna_main("......", 8, 1, 2, 3) 
        call luna_main(".........", 7, 1, 2, 2) 
        call luna_main(".............", 6, 2, 2, 2) 
        call luna_main("Хорошо...", 6, 2, 4, 2) 
        ">Полумна перечисляет свои отметки по всем предметам, большинство из них едва граничат с проходным баллом."
        call her_main("Что? Настолько низкие? Как ты ожидаешь получить работу в Министерстве Магии с такими оценками?","scream","wide_stare") 
        call luna_main("...", 6, 3, 4, 2) 
        call her_main("С таким уровнем, ты получишь работу только в мире маглов.","disgust","down_raised") 
        call luna_main("Думаешь, я этого не знаю? Почему ты думаешь, я согласилась на все это...", 7, 1, 2, 3) 
        call luna_main("Просто прекрати унижать меня и перечисли свои глупые требования!", 8, 1, 2, 3) 
        call luna_main("Что? Ждешь, что я буду ходить по школе полуголой?", 9, 2, 2, 3) 
        call her_main("Конечно нет...","open","worried") 
        call luna_main("Тогда что?", 7, 1, 3, 2) 
        call her_main("В обмен на подтягивание твоих знаний, я хочу, чтобы ты помогла мне в исследованиях.","open","closed") 
        call luna_main("...", 9, 1, 2, 3) 
        call luna_main("Что?", 4, 1, 4, 2) 
        call luna_main("Зачем тебе нужен помошник? Ведь твои оценки идеальны.", 6, 1, 2, 2) 
        call her_main("Конечно... Но это не те предметы, по которым мне нужен помошник.","soft","baseL") 
        call her_main("Мне иногда становится одиноко в библиотеке...","annoyed","angryL") 
        call her_main("Плюс, я всегда хотела узнать Когтевран получше, но все другие девушки отказываются даже говорить со мной.","open","worried") 
        call her_main("А Гарри и Рон только и пяляться на мои сиськи.","open","angryCl") 
        call her_main("{size=-5}Не то, что бы я против...{/size}","base","ahegao_raised") 
        call her_main("Представь как это будет весело! Мы даже можем попробовать продвинутые заклинания трансмогрификации!","smile","happyCl") 
        call luna_main("...", 7, 1, 2, 2) 
        call her_main("Не говоря уже о работе над твоими оценками!","base","happyCl") 
        call her_main("Если ты будешь упорно трудиться, то мы управимся к С.О.В.е!","grin","baseL") 
        call luna_main("Все, что угодно... Пока ты учишь меня, этот старик будет давать мне золото, я согласна...", 6, 2, 2, 4) 
        call her_main("УХУ!","grin","worriedCl") 
        m "Вы ведь помните, что я все еще здесь!"
        call her_main("Конечно профессор...","grin","baseL") 
        call luna_main("...", 6, 2, 1, 2) 
        call her_main("Тогда Полумна, у нас еще есть немного времени перед уроками, пойдем в библиотеку!","smile","baseL") 
        call luna_main("Ты хочешь начять сейчас?", 4, 1, 2, 2) 
        call her_main("Без обид, но с твоими оценками...","grin","worriedCl",emote="05") 
        call her_main("Мы не должны терять ни минуты...","base","worriedCl") 
        m "Надеюсь, это не повлияет на наши \"уроки\" [hermione_name]?"
        call her_main("Конечно нет, [genie_name]...","grin","baseL") 
        call luna_main("Можете не волноваться...", 7, 1, 2, 2) 
        m "Тогда хорошо, вот ваша оплата."
        $ gryffindor += hermione_payout
        m "[hermione_payout] очков  \'гриффиндору\'!"
        call her_main("Спасибо [genie_name].","base","closed") 
        $ luna_gold += luna_payout
        $ gold -= luna_payout
        m "И [luna_payout] галлеонов Полумне."
        ">Ты вручаешь Полумне груду монет."
        $ luna_flip = 1
        call luna_main("Спасибо [l_genie_name]...", 3, 2, 3, 2) 
        ">Полумна и Гермиона быстро одеваются и уходят вместе."
        $ luna_wear_skirt = True
        $ luna_wear_top = True
        $ luna_wear_panties = True
        $ luna_wear_bra = True
        $ hermione_wear_skirt = True
        $ hermione_wear_top = True
        $ hermione_wear_panties = True
        $ hermione_wear_bra = True
        call update_her_uniform 
        call her_main("Это будет так ВЕСЕЛО!","grin","ahegao") 
        call luna_main("(На что я согласилась)", 6, 3, 4, 2) 
        hide screen luna
        hide screen luna_chibi
        $ luna_busy = True
        jump end_hg_pf
        # end scene

    else: #third handjob event, needs to be repeatable
        if luna_corruption <= 13:
            $ luna_corruption += 1
        label luna_handjob_hermione_call:
            pass
        m "Как насчет работы ручками [luna_name]?"
        call luna_main("Конечно... Хотите, чтобы я позвала Гермиону?", 6, 2, 2, 2) 
        m "Ты читаешь мои мысли!"
        call luna_main("Хорошо, но я ожидаю, что я сделаю... Всю работу.", 7, 2, 1, 2) 
        m "Если ты настаиваешь."
        call luna_main("...", 5, 1, 1, 2) 
        call luna_main("Просто поторопитесь и приведите ее сюда...", 5, 2, 1, 2) 
        ">Ты вызываешь Гермиону в свой кабинет."
        call play_sound("door") #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Привет [genie_name]!","base","happyCl") 
        call her_main("Привет Полумна!","smile","happyCl") 
        m "Ты, кажешься очень веселой."
        call her_main("Почему бы и нет? Мы будем работать ручками сегодня?","open","baseL") 
        call luna_main("Поторопись и встань на колени шлюха...", 5, 1, 2, 3) 
        call her_main("Как скажешь!","smile","happyCl",emote="06") 
        call luna_main("...", 6, 1, 2, 2) 
        ">Ты выходишь из-за стола, а в это время Гермиона раздеваеться и встает перед тобой на колени."
        hide screen hermione_main 
        $ hermione_SC.chibi.xpos = 40 #40 = Near Luna
        $ hermione_SC.chibi.ypos = 60
        $ h_c_u_pic = "characters/hermione/chibis/dance/08_sits.png"
        $ hermione_head_xpos=390
        show screen h_c_u 
        with d3
        hide screen bld1
        hide screen genie
        show screen chair_left
        show screen desk
        $ genie_chibi_xpos = -20
        $ genie_chibi_ypos = 10
        $ g_c_u_pic = "images/animation/06_jerking_01.png"
        $ genie_sprite_base = "characters/genie/base_4.png"
        show screen g_c_u
        with fade
        $ luna_r_arm = 2
        $ luna_flip = 1
        $ luna_xpos = 640
        $ hermione_head_xpos = 590
        $ hermione_head_ypos = 390
        $ genie_sprite_xpos = 550
        $ hermione_wear_skirt = False
        $ hermione_wear_top = False
        $ hermione_wear_panties = False
        $ hermione_wear_bra = False
        call update_her_uniform 
        show screen genie_sprite
        call her_kneel("Полумна, ты не собираешься раздеваться?","annoyed","angryL") 
        call luna_main("Я не понимаю, зачем мне...", 7, 2, 3, 2) 
        call her_kneel("Я говорила тебе раньше, это поможет его возбудить, пока ты играешь с ним.","annoyed","angryL") 
        call luna_main("...", 7, 8, 2, 2) 
        call luna_main("Ладно...", 6, 2, 4, 2) 
        call her_kneel("Хорошо.","base","base") 
        call luna_main("Я делаю это только для того, чтобы [l_genie_name] быстрее кончил!", 5, 2, 2, 2) 
        m "Кажется это справедливо."
        call luna_main("...", 6, 1, 2, 2) 
        show screen blkfade
        with d3
        ">Полумна медленно раздевается, и ложит свою одежду рядом с вещами Гермионы."
        $ luna_wear_skirt = False
        $ luna_wear_top = False
        $ luna_wear_panties = False
        $ luna_wear_bra = False
        hide screen blkfade
        with d3
        call luna_main("Счастливы?", 7, 1, 2, 2) 
        m "Очень."
        call luna_main("Хорошо... А теперь сделаем это.", 7, 2, 3, 2) 
        call her_kneel("...","annoyed","frown") 
        call luna_main("Что теперь Гермиона?", 6, 8, 2, 2) 
        call her_kneel("Просто попытайся действовать немного мягче, хорошо?","open","suspicious") 
        call luna_main("Я попробую...", 6, 2, 2, 2) 
        call her_kneel("Чудно!","base","down") 
        $ luna_r_arm = 3
        ">Полумна плюнула на свои руки прежде, чем обвить их вокруг твоего члена."
        ">Она едва начала, ласкать его, но ты уже можешь сказать, что ее техника значительно стала лучше."
        m "Мммм, да вот так шлюха."
        m "Именно так."
        call luna_main("...", 5, 8, 2, 1) 
        call her_kneel("Полумна ты молодец... Теперь попробуй сосредоточиться на головке, как мы обсуждали.","base","glance") 
        call luna_main("Вот так?", 5, 8, 4, 2) 
        ">Полумна оборачивает руку вокруг головки твоего члена, слегка вращая рукой."
        m "Угх... да..."
        call her_kneel("Хорошая работа. Теперь возвращайся к остальной части члена.","open","closed") 
        call her_kneel("Старайся не фокусироваться на одной области слишком долго...","open","closed") 
        call luna_main("Ладно...", 7, 8, 4, 1) 
        ">Это заняло больше времени чем обычно, Полумна пристально прислушивалась к инструкциям Гермионы."
        g9 "Угх... Я уже близко!"
        call her_kneel("Прекрасно, когда это произойдет, тебе нужно немного замедлиться...","base","down") 
        call luna_main("Правда? Но разве он не собирается кончить?", 4, 8, 4, 3) 
        g9 "Не останавливайся!"
        call her_kneel("Тссс [genie_name], я пытаюсь ее чему-то научить!","upset","closed") 
        g9 "..."
        ">Полумна замедляет свои движения, в результате чего, ты почти теряешь свой оргазм."
        call her_kneel("Он {b}почти{/b} кончил. Но если ты остановишься и после снова доведешь его, оргазм будет куда сильнее.","grin","dead") 
        call her_kneel("Я читала об этой технике в еженедельнике 'ведьма'... она называется кантом!","base","down") 
        call luna_main("Хммм, и ты уверена, что ему будет приятнее?", 5, 8, 5, 2) 
        call luna_main("Мне кажеться ему сейчас больно...", 5, 8, 2, 1) 
        ">Полумна смотрит на твой член своим садистским взглядом и сжимает его со всей силы."
        $ genie_sprite_exp = "characters/genie/exp_2.png"
        g4 "Ах!"
        $ genie_sprite_exp = "characters/genie/exp_4.png"
        call her_kneel("Верь мне, ему понравится это намного больше...","open","closed") 
        call her_kneel("Просто подожди и ты увидешь сколько спермы он выльет из своего члена.","grin","ahegao") 
        call luna_main("Мммм... Мне нравится как это звучит.", 8, 8, 3, 1) 
        call luna_main("Итак, как долго я должна делать это...", 5, 8, 1, 1) 
        $ genie_sprite_exp = "characters/genie/exp_2.png"
        g4 "Я больше не могу терпеть!"
        call her_kneel("Видимо он скоро кончит...","angry","wink") 
        call her_kneel("И кстати... Он не расстроиться, если ты будешь делать это долго.","base","down") 
        call luna_main("Правда? Он не против этого...", 8, 8, 3, 1) 
        g4 "Да!"
        call luna_main("Хорошо, тогда... как я должна закончить с ним?", 5, 3, 2, 1) 
        call her_kneel("Хммм...","base","suspicious") 
        show screen blkfade
        with d3
        $ genie_sprite_exp = "characters/genie/exp_1.png"
        ">Гермиона медленно встает и шепчет что-то в ухо Полумны, а потом встает на колени."
        hide screen blkfade
        with d3
        call luna_main("Ты думаешь ему это понравиться?", 4, 8, 4, 1) 
        call her_kneel("Поверь мне, он любит это...","grin","baseL") 
        m "Люблю что?"
        call luna_main("Тихо [l_genie_name]!", 8, 1, 2, 2) 
        ">Полумна снова болезненно сжимает твой член, прежде чем продолжить ласкать его."
        $ genie_sprite_exp = "characters/genie/exp_2.png"
        g4 "Ах!"
        $ genie_sprite_exp = "characters/genie/exp_3.png"
        m "Можешь прекратить, так делать?"
        call luna_main("Я перестану так делать, как только вы перестанете задавать глупые вопросы.", 6, 1, 2, 4) 
        $ genie_sprite_exp = "characters/genie/exp_1.png"
        m "..."
        call her_kneel("Мммм... Вот так Полумна...","soft","ahegao") 
        call her_kneel("Он уже почти....","grin","dead") 
        call her_kneel("Ах...","open_wide_tongue","squintL") 
        ">Гермиона открывает рот, так широко как только может, в это время Полумна подтягивает тебя вперед направляя твой член в ее страстный ротик."
        $ luna_xpos += 45
        $ genie_sprite_xpos += 55
        $ hermione_kneel_cock = True
        $ genie_sprite_exp = "characters/genie/exp_2.png"
        g4 "!!!"
        call her_kneel("Ммм...","open_wide_tongue","ahegao") 
        call luna_main("Продолжим...", 5, 8, 4, 1) 
        $ hermione_head_xpos -= 10
        $ hermione_head_ypos -= 5
        ">Гермиона начинает яростно сосать твою головку в то время как Полумна продолжает сильнее дрочить твой член."
        g4 "{size=+5}УХ ЕБАТЬ, ДА!!!{/size}"
        g4 "{size=+5}Я сейчас кончу, шлюхи!{/size}"
        ">Полумна продолжает дрочить твой член, в то время как Гермиона отстраняется, оставив рот открытым."
        $ luna_xpos -= 55
        $ genie_sprite_xpos -= 55
        $ hermione_head_xpos += 10
        $ hermione_head_ypos += 5
        $ hermione_kneel_cock = False
        g4 "{size=+10}АРГХХХ!!!!{/size}"
        show screen white 
        pause.1
        $ uni_sperm = True
        $ u_sperm = "characters/hermione/face/auto_16.png"
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "{size=+5}УХ! ДА!!!{/size}"
        call luna_main("Так много...", 4, 8, 4, 1) 
        call her_kneel("...","full_cum","dead") 
        call her_kneel("*Гулп*","cum","worriedCl") 
        call her_kneel("Ммм... Я же говорила, что это сделает его оргазм сильнее...","grin","dead") 
        call luna_main("Круто...", 5, 8, 4, 1) 
        ">Полумна уставилась на Гермиону с голодом в глазах."
        call luna_main("Встань... Пожалуйста...", 5, 8, 4, 2) 
        ">Опустошенный после такого марафона дрочки, ты решаешь сесть, в то время как Гермиона с Полумной очищаются."
        call her_kneel("Только потому, что ты вежливо попросила...","open","baseL") 
        $ hermione_xpos = 550
        $ luna_ypos = 0
        $ luna_xpos = 450
        $ luna_flip = -1
        $ hermione_right_arm = "characters/hermione/body/arms/right/right_1.png"
        $ genie_sprite_base = "characters/genie/base_1.png"
        $ hermione_zorder = 5
        $ luna_r_arm = 1
        hide screen hermione_kneel
        show screen hermione_main
        hide screen genie_sprite
        show screen genie
        hide screen chair_left
        hide screen desk
        hide screen g_c_u
        $ hermione_SC.chibi.xpos = 600 #Near the desk: 400. (210 - standing on desk.)
        $ hermione_SC.chibi.ypos = 260#Default: 250. (180- standing on desk.)
        show screen hermione_blink #Hermione stands still.
        call update_her_uniform 
        hide screen blkfade
        with d3
        ">Гермиона медленно встает, ее лицо все в сперме..."
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
        call luna_main("Ммммм... Просто посмотри на себя... Ты выглядишь так... Восхитительно...", 1, 6, 4, 1) 
        call her_main("...","open","baseL") 
        $ luna_xpos = 500
        $ luna_r_arm = 2
        ">Полумна подходит вплотную к Гермионе и берет пальцем сперму с ее лица и отправляет содержимое в свой рот."
        call her_main("Продолжай...","soft","ahegao") 
        m "(Ммммм...)"
        $ luna_xpos = 530
        call luna_main("Мммм... И на вкус она еще лучше...", 2, 1, 4, 1) 
        call her_main("...","grin","dead") 
        ">Гермиона стоит перед Полумной, позволяя ей вытереть свое лицо..."
        $ u_sperm = "characters/hermione/face/auto_08.png"
        call her_main("Вот так... Убедись, что ты получишь все...","base","down") 
        call luna_main("Ммммм...", 2, 1, 4, 13) 
        ">Полумна медленно заполняет рот спермой, прежде чем всю ее проглотить."
        call luna_main("*Глоть*", 5, 6, 4, 1) 
        ">И наконец-то, она засунула последнюю порцию спермы в рот."
        $ uni_sperm = False
        call her_main("Лучше?","base","glance") 
        call luna_main("...", 2, 1, 4, 13) 
        call luna_main("*Глоть*", 5, 6, 4, 1) 
        call luna_main("Намного.", 5, 6, 4, 1) 
        call her_main("Хорошо.","base","suspicious") 

        menu:
            "-Спросить о занятиях-":
                m "Итак, как прошли ваши последние занятия?"
                $ luna_l_arm = 2
                $ luna_flip = 1
                $ luna_xpos = 300
                call luna_main("Как обычно...", 6, 2, 4, 2) 
                call her_main("Прекращай быть такой пессимистичной Полумна, они были потрясающими, [genie_name]!","smile","happyCl",emote="06") 
                call luna_main("...", 6, 3, 4, 2) 
                call her_main("Полумна спрашивала меня о передовых заклинаниях трансмогрификации, передовых рецептах зелий, и даже о сложной гербологии!","smile","happyCl") 
                call luna_main("Я не думаю, что ей нужно проверять знания, она все делала правильно...", 7, 2, 2, 3) 
                call her_main("Ну, репетиторство было еще лучше!","base","happyCl") 
                call her_main("Мы изучали трансфигурацию, D.A.D.A, рукоблудие, зелья, пайзури, заклинания, пошлое общение и гербологию!","grin","baseL") 
                m "Звучит как интересный урок..."
                call luna_main("......", 5, 2, 4, 2) 
                call her_main("Если мы продолжим заниматься на этих уроках, я уверена, что Полумна сдаст свою С.О.В.у с триумфом!","base","squint") 
                call luna_main(".........", 5, 3, 4, 1) 
                if not luna_herm_talk:
                    $ luna_herm_talk = True
                    call her_main("Я не могу дождаться, чтобы увидеть, какую оценку она получит, когда ей придется делать их!","smile","happyCl",emote="06") 
                    $ luna_flip = -1
                    call luna_main("Я думала, ты имела в виду, когда {b}МЫ{/b} будем делать их...", 6, 1, 2, 2) 
                    call her_main("Ох, мне больше не нужно делать свои С.О.В.ы...","base","happyCl") 
                    call luna_main("Что? Почему нет?", 4, 1, 4, 2) 
                    call her_main("Не хотите ей рассказать или лучше мне?","base","down") 
                    m "(Я понятия не имею о чем она говорит.)"
                    m "Почему бы тебе не ввести ее в курс дела."
                    call her_main("Ну, тогда ладно...","base","glance") 
                    call her_main("Я уже делала свою С.О.В.у в прошлом году..","grin","worriedCl",emote="05") 
                    call luna_main("Правда? Как?", 7, 1, 4, 2) 
                    call her_main("Ну, я уже тестировалась на прошлогодних экзаменах, потому что уже была на третьем курсе.","grin","worriedCl") 
                    call her_main("В прошлом году я наконец-то почувствовала, что готова к чему-то большему. Так что я поговорила с профессором Дамблдором и профессором Макгонагалл.","base","baseL") 
                    call her_main("Я объяснила свою ситуацию, и они согласились испытать меня.","base","baseL") 
                    call her_main("Я получила высший балл и Дамблдор самолично принял их!","smile","happyCl",emote="06") 
                    call luna_main("Погоди... Если ты уже сдала свои С.О.В.ы, почему ты все еще в школе?", 6, 1, 2, 3) 
                    call her_main("Я не хотела пропускать школьную работу или свободное время с моими друзьями...","base","happyCl") 
                    call her_main("Так что я просто была на дополнительных занятиях в библиотеке после уроков в обмен на специальную рекомендацию от школы.","smile","happyCl") 
                    call her_main("Хотя, в последнее время я провожу здесь большую часть своего свободного времени...","base","down") 
                    call luna_main("Но почему ты тогда захотела заниматься со мной? Тебе ведь наверняка больше не нужен опрос?", 8, 1, 5, 2) 
                    call her_main("Я всегда хотела попрактиковаться в преподавании, и я могу помочь своей подруге, пока занимаюсь этим!","grin","baseL") 
                    call luna_main("Подруге?", 6, 1, 4, 2) 
                    call her_main("Конечно же, мы подруги, Полумна! Может быть даже лучшие подруги после всего, что с нами было...","base","squint") 
                    call luna_main("...", 5, 1, 4, 2) 
                    $ luna_tears = 1
                    call luna_main("Как угодно...", 7, 2, 2, 2) 
                    $ luna_flip = 1
                    call luna_main("Если вы двое закончили болтать, тогда я пойду на занятия...", 8, 1, 2, 2) 
                    ">Полумна быстро оделась перед уходом, не говоря ни слова тебе или Гермионе."
                    $ luna_wear_skirt = True
                    $ luna_wear_top = True
                    $ luna_wear_panties = True
                    $ luna_wear_bra = True
                    hide screen luna_chibi
                    hide screen luna
                    with d3
                    call her_main("...","annoyed","worriedL") 
                    call her_main("С ней все в порядке, сэр?","annoyed","worriedL") 
                    m "Думаю, да. Она просто не привыкла, что ты хорошо к ней относишься."
                    call her_main("Может быть... Если вы не против, я могу пойти и проведать ее.","angry","worried") 
                    m "Делай как знаешь. Мне все равно хочется спать."
                    call her_main("Спасибо [genie_name].","base","worriedCl") 
                    $ hermione_wear_skirt = True
                    $ hermione_wear_top = True
                    $ hermione_wear_panties = True
                    $ hermione_wear_bra = True
                    call update_her_uniform 
                    ">Гермиона быстро оделась, прежде чем погналась за Полумной."
                else:
                    jump luna_her_hj_end

            "-Отпустить их-":    
                label luna_her_hj_end:
                    m "Хорошо, вы двое можете идти."
                    $ luna_l_arm = 2
                    $ luna_flip = 1
                    $ luna_xpos = 300
                    call luna_main("*Хм*, только после того, как вы нам заплатите!", 7, 1, 2, 2) 
                    m "Верно, чуть не забыл."
                    call her_main("...","annoyed","suspicious") 
                    $ gryffindor += 50 
                    m "50 очков \'Гриффиндору\'!"
                    call her_main("Спасибо, [genie_name]...","base","closed") 
                    call luna_main("...", 5, 2, 1, 2) 
                    $ luna_gold += 150 
                    $ gold -= 150 
                    m "150 галлеонов Полумне."
                    call luna_main("Спасибо [l_genie_name]...", 5, 2, 1, 2) 
                    call her_main("...","annoyed","angryL") 
                    m "Если это все, думаю мне нужно вздремнуть."
                    call her_main("Ладно...","base","base") 
                    ">Гермиона и Полумна оделись, прежде чем вместе выйти из кабинета."
                    $ luna_wear_skirt = True
                    $ luna_wear_top = True
                    $ luna_wear_panties = True
                    $ luna_wear_bra = True
                    $ hermione_wear_skirt = True
                    $ hermione_wear_top = True
                    $ hermione_wear_panties = True
                    $ hermione_wear_bra = True
                    call update_her_uniform 
                    ">Ты смог расслышать как они вместе разговаривали и смеялись, когда закрывали дверь."

    call play_sound("door") #Sound of a door opening.
    hide screen luna
    hide screen luna_chibi
    $ luna_busy = True
    jump end_hg_pf


label luna_favour_6: #luna and hermione blowjob
    if luna_corruption == 14: #first time
        $ luna_corruption += 1
        m "У меня есть новая просьба для тебя на сегодня, [luna_name]!"
        call luna_main("...", 7, 1, 2, 2) 
        m "Если тебя это не слишком затруднит."
        call luna_main("Приберегите вашу просьбу [l_genie_name]... Я вполне уверена, что знаю, что вы хотите", 5, 2, 2, 1) 
        m "Знаешь?"
        call luna_main("Мхммм... Если я не ошибаюсь, вероятно вы хотите, чтобы я обхватила губами ваш грязный член...", 7, 1, 3, 1) 
        call luna_main("Я ошибаюсь, сэр?", 5, 2, 2, 1) 
        m "Конечно нет! Тогда приступим, не так ли?"
        call luna_main("Не сейчас... у меня есть одно условие.", 5, 1, 2, 1) 
        m "Назови его."
        call luna_main("Я хочу, чтобы вы позвали Гермиону.", 6, 2, 4, 1) 
        m "Мисс Грейнджер? Зачем?"
        call luna_main("Ну, учитывая то, что я впервые делаю что-то подобное, имеет смысл пригласить ее сюда, чтобы она поделилась своим... опытом.", 5, 2, 1, 1) 
        call luna_main("Черт знает, сколько раз она сосала ваш отвратительный член.", 8, 1, 2, 3) 
        m "Я сам сбился со счета."
        call luna_main("В таком случае, я предлагаю вам позвать ее.", 7, 1, 3, 3) 
        m "Хэй, я от такого точно не собираюсь отказываться!"
        ">Ты вызвал Гермиону в свой кабинет."
        call play_sound("door") #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте профессор...","base","closed") 
        call her_main("О, привет Полумна! Что он попросил у тебя сегодня? Еще разок подрочить?","base","suspicious") 
        call luna_main("Не совсем...", 7, 2, 1, 1) 
        call her_main("Так он наконец-то попросил отсосать ему?","base","down") 
        call luna_main("Мкхмммм.", 5, 1, 1, 1) 
        call her_main("Здорово! Я надеялась, что он попросит это в ближайшее время. Практиковаться на самотыке - это одно, не было другого варианта для настоящего дела!","soft","ahegao") 
        m "Вы практиковались?"
        call her_main("Конечно! {p}Хотя, ей еще есть, над чем поучиться...","upset","closed") 
        call luna_main("Это было не так уж и плохо...", 7, 1, 4, 4) 
        call her_main("Угх... Скажем так, вы будете рады результатам ее практики.","angry","base") 
        call her_main("На моем самотыке все еще видны следы укусов после ее первой попытки.","angry","down_raised") 
        call luna_main("Откуда мне было знать, что зубами нельзя пользоваться?", 7, 2, 2, 3) 
        call her_main("Я же говорила тебе, что это правило номер один! Кроме того, ты почти перекусила его пополам...","angry","wide") 
        g4 "!!!"
        m "Знаете что, думаю я обойдусь..."
        call her_main("Ну нет... вы уже попросили ее сделать это. Кроме того, ей нужен опыт.","annoyed","frown") 
        m "Может ей стоит еще немного попрактиковаться?"
        $ luna_flip = 1
        call luna_main("Перестаньте жаловаться... я больше сильно не кусаюсь.", 7, 2, 3, 2) 
        m "Ты все еще кусаешься?!!"
        call luna_main("Я же сказала, не сильно!", 8, 1, 2, 4) 
        m "Ты не должна кусаться вообще!"
        call her_main("Не волнуйтесь [genie_name], я буду рядом с ней. Я прослежу, чтобы она не сделала ничего лишнего.","grin","worriedCl") 
        m "Ну ладно тогда..."
        g4 "Но если ты укусишь мой член, вас обоих исключат!"
        call luna_main("Пффф... Будто бы нас могли бы исключить за то, что мы не умеем делать хороший минет...", 7, 2, 2, 1) 
        m "Смотри мне..."
        call her_main("Может мы просто начнем?","base","down") 
        m "..."
        call her_main("Хорошо... Тогда снимай одежду, Полумна","open","closed") 
        call luna_main("Мне обязательно?", 5, 2, 4, 4) 
        call her_main("Я говорила тебе, что твой внешний вид - это все, помнишь?","annoyed","closed") 
        call luna_main("Угх... ладно.", 5, 3, 4, 2) 
        call her_main("Отлично! Тогда я тоже разденусь, чтобы все было по-честному!","soft","squintL") 
        m "(Думаю эти двое смогут стать очень дружелюбными...)"
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
        call luna_main("...", 1, 2, 1, 1) 
        show screen blkfade 
        with d3
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png"
        ">Гермиона и Полумна вместе медленно раздеваются, медленно складывая свою одежду в стопки на твоем столе."
        ">В итоге Полумна встала перед тобой на колени, глядя тебе в глаза, а Гермиона стояла позади нее, изучая ее действия."
        call her_main("Вот так... зрительный контакт очень важен.","disgust","down_raised") 
        $ ccg_folder = "luna_bj"
        $ ccg1 = "herm"
        $ ccg3 = "gene"
        $ ccg2 = 1
        show screen ccg
        hide screen luna_chibi
        hide screen luna
        hide screen hermione_blink
        hide screen hermione_main
        hide screen blkfade 
        with d3
        lun "..."
        $ ccg2 = 2
        lun "Что теперь?"
        her "Высунь свой язык..."
        lun "..."
        $ ccg2 = 3
        lun "Ах..."
        her "Хорошо... теперь немного оближи кончик."
        lun "..."
        $ ccg2 = 4
        ">Полумна наклонилась вперед, начав лизать кончик твоего члена."
        m "Угх... вот так, шлюшка."
        her "Ммм... теперь еще раз. На этот раз больше работай язычком..."
        lun "..."
        $ ccg2 = 5
        ">Полумна снова наклонилась вперед и вновь начала облизывать твой член, в этот раз продолжив двигаться вдоль него."
        m "Да..."
        her "Теперь просто продолжай делать это, пока не почувствуешь вкус смазки."
        $ ccg2 = 6
        lun "Ладно..."
        $ ccg2 = 7
        ">Полумна продолжила облизывать головку твоего члена, проводя язычком по головке и время от времени по всей его длине."
        her "Просто представь, что это большой леденец..."
        lun "..."
        $ ccg2 = 8
        lun "Когда я должна начать сосать его?"
        her "Не сейчас... я скажу тебе, когда будет надо."
        $ ccg2 = 7
        lun "..."
        ">Полумна продолжила лизать его в еще более быстром темпе, в конце-концов, полностью сосредоточившись на головке твоего члена."
        m "Мммм... продолжай..."
        $ ccg2 = 8
        lun "Кажется я чувствую этот вкус, Гермиона..."
        her "Хорошо... Теперь, также как на практике. Широко открой рот."
        lun "..."
        $ ccg2 = 9
        ">Полумна широко открыла свой ротик, с нетерпением демонстрируя его."
        lun "Ах..."
        her "Хорошая работа... теперь засунь кончик в рот..."
        $ ccg2 = 10
        lun "..."
        ">Взволнованный, почти испуганный взгляд появился на лице Полумны."
        pause
        $ ccg2 = 8
        lun "Он такой большой... я не уверена, смогу ли я?"
        her "Тсс... все хорошо. Я здесь..."
        ">Гермиона кладет руку на голову Полумны."
        $ ccg2 = 11
        lun "Эй! Что ты задума-"
        ">Прежде чем Полумна пожаловалась, Гермиона натолкнула ее голову на твой ждущий член."
        $ ccg2 = 12
        pause
        lun "!!!"
        her "Ну что ж, поехали!"
        ">Однако вместо того, чтобы войти в ее рот, головка твоего члена застряла на входе, натирая верхний ряд ее зубов."
        g9 "Ааах... я сказал никаких зубов!"
        $ ccg2 = 13
        lun "!!!"
        ">Гермиона снова попыталась толкнуть голову Полумны вперед..."
        her "Давай же Полумна... Открой шире!"
        $ ccg2 = 14
        lun "..."
        ">Ты смог почувствовать, как Полумна пытается растянуть рот над головкой твоего огромного члена, сумев взять его немного глубже."
        $ ccg2 = 15
        lun "......"
        her "Хммм... полагаю, самотык, на котором мы тренировались, был недостаточно большим..."
        m "Угх... может быть нам стоит попробовать в другой раз..."
        her "И остановиться сейчас? Я так не думаю [genie_name]. Кроме того, как только она засунет головку себе в рот, все будет в порядке."
        her "Наверное ей нужен еще один толчок-"
        ">Гермиона резко закончила фразу с сильным точком головы Полумны."
        $ ccg2 = 14
        pause
        lun "!!!"
        ">Ты смог почувствовать, как челюсть Полумны растянулась немного больше, едва не впустив кончик твоего члена. "
        m "Я правда не думаю, что это следует-"
        ">Прежде чем ты закончил свое предложение, Гермиона дала последний толчок, заставив головку твоего члена напрячь рот Полумны."
        $ ccg2 = 16
        lun "!!!"
        her "Ну вот, наконец-то! Я же говорила вам, что она сможет [genie_name]!"
        $ ccg2 = 17
        lun "............."
        her "Хотя, возможно нам придется дать ей немного отдохнут, просто чтобы привыкнуть к этому..."
        $ ccg2 = 18
        pause
        lun "...................."
        her "Не забывай дышать через нос!"
        lun "............................."
        $ ccg2 = 19
        m "Ты уверена, что с ней все хорошо?"
        her "Она будет в порядке, сэр! Кроме того, я не думаю, что вы беспокоитесь о таких вещах..."
        $ ccg2 = 18
        m "Ну, я не помню, чтобы ты почти ломала свою челюсть, когда делала свой первый минет..."
        her "У Полумны просто рот меньше..."
        $ ccg2 = 19
        pause
        her "Она привыкнет к этому!"
        her "Кстати говоря, этого времени вполне достаточно..."
        $ ccg2 = 17
        lun "*Не..хпугл..дост..глпуг..аточно..глп*!!!"
        ">Ты чувствуешь, как Полумна пытается жалобно кричать, в то время, как ее рот забит твоим членом."
        m "Мммм, это хорошо."
        her "Ну тогда, время для второй части урока!"
        ">Ты видишь, как рука Гермионы крепко хватается за волосы Полумны."
        her "Теперь правило хорошего минета, по словам Ведьмовского Еженедельника, в любом случае, пытаться подражать чувствам влагалища."
        $ ccg2 = 19
        her "Так что, я просто хочу, чтобы ты держала язык прямо, а двигать тебя вперед и назад - моя забота, хорошо Полумна?"
        $ ccg2 = 18
        lun "*Мммгхм*..."
        her "Здорово! Ну тогда погнали!"
        ">Гермиона начинает толкать голову Полумны назад и вперед так глубоко, на сколько она может."
        $ ccg2 = 23
        ">В конце-концов она ловит ритм движения головы вперед, пока примерно половина твоего члена не оказывается во рту, а затем назад, пока ее челюсть не поймает твою головку."
        $ ccg2 = 16
        m "Мммм... да... именно так, маленькие шлюшки..."
        $ ccg2 = 23
        pause
        her "Как у нее получается, [genie_name]? Она держит язык хорошо и прямо?"
        $ ccg2 = 16
        m "О дааа... у нее получается... шикарно..."
        $ ccg2 = 20
        lun "..."
        $ ccg2 = 17
        her "Фантастика! Она больше не дотрагивается зубами, не так ли?"
        $ ccg2 = 21
        m "Нет... все отлично..."
        $ ccg2 = 18
        her "Хорошая работа Полумна! Теперь убедись, что хорошо сосешь, когда я двигаю головой вперед."
        $ ccg2 = 20
        lun "*Ммммкуууу*..."
        $ ccg2 = 17
        ">Это продолжается еще несколько минут. Полумна продолжает сосать твой член без устали, а Гермиона постоянно ее консультирует."
        $ ccg2 = 22
        ">Благодаря консультациям Гермионы, ты готов кончить прямо сейчас."
        $ ccg2 = 20
        her "Ммм... куда вы хотите кончить, [genie_name]?"
        $ ccg2 = 19
        ">Гермиона продолжает сильно двигать головой Полумны назад и вперед, во время разговора."
        $ ccg2 = 21
        her "Вы хотите спустить все это прямиком в ее маленькую грязную глотку?"
        $ ccg2 = 19
        pause
        lun "*мммммм*...{image=textheart}"
        $ ccg2 = 21
        ">Рот Полумны приятно вибрирует вокруг твоего члена."
        $ ccg2 = 17
        her "Или вы желаете обкончать все ее лицо?"
        $ ccg2 = 20
        m "Угх..."
        $ ccg2 = 17
        her "Я знаю, чего она хочет..."
        $ ccg2 = 21
        her "Она хочет, чтобы вы спустили все это ей в рот или в глотку..."
        $ ccg2 = 19
        lun "{image=textheart}{image=textheart}{image=textheart}"
        $ ccg2 = 20
        her "Она даже заставила меня пообещать, прежде чем мы пришли сюда..."
        $ ccg2 = 21
        lun "..."
        $ ccg2 = 19
        g9 "Угх... я больше не могу сдержаться!"
        $ ccg2 = 23
        pause
        g9 "ШЛЮХИ, Я КОНЧАЮ!!!"
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "{size=+5}АРГХ! ДААА!!!{/size}"
        pause
        $ ccg2 = 24
        lun "!!!!!!!!!!!!"
        her "Мммм, вот так [genie_name]... Выпустите все..."
        g4 "{size=+5}АХ...{/size}"
        ">Твоя сперма заполнила рот Полумны до краев, в то время как Гермиона крепко держала ее голову."
        $ ccg2 = 24
        pause
        lun "..."
        lun "......"
        $ ccg2 = 25
        pause
        lun "........."
        $ ccg2 = 26
        pause
        lun "............."
        $ ccg2 = 24
        lun "*глоть*"
        $ ccg2 = 27
        pause
        lun "Ах... {image=textheart}{image=textheart}{image=textheart}"
        #fade to black.
        hide screen ccg 
        with fade
        ">Полумна и Гермиона одеваются, пока ты сидишь в кресле и наслаждаешься шоу."
        call her_main("Ну так что думаешь, Полумна? Было не так уж и плохо?","grin","baseL") 
        call luna_main("Полагаю, нет. Хотя в следующий раз, я думаю, что смогу двигать головой самостоятельно!", 5, 2, 1, 2) 
        call her_main("Хммм, я не уверена, что ты к этому уже готова...","grin","worriedCl") 
        call luna_main("Как скажешь... Теперь на счет нашей оплаты, [l_genie_name]...", 6, 2, 2, 2) 
        m "Да, да. 60 очков \"Гриффиндору\" для Гермионы, и 150 галлеонов для тебя, вопросы?"
        call her_main("Вообще-то мы хотели поговорить с вам об этом, [genie_name]...","base","down") 
        call her_main("Мы поговорили с Полумной, и мы не уверены, справедливо ли то, что нам обоим платят в разных валютах.","base","worriedCl") 
        call her_main("Мы думаем, будет справедливее, если нам обоим заплатят и очками, и золотом.","base","closed") 
        m "Серьезно? Я удивлен, что мисс Лавгуд согласилась с этим."
        call luna_main("Ну, я не хотела-", 7, 2, 3, 2) 
        call her_main("...","annoyed","suspicious") 
        call luna_main("Но... Гермиона меня убедила.", 6, 2, 4, 1) 
        m "Ну тогда ладно..."
        m "(Не похоже, что меня волнует, кто получит эти бесполезные очки)"
        $ ravenclaw += 30
        $ gryffindor += 30
        m "30 очков \"Гриффиндору\" и \"Когтеврану\"!"
        $ luna_gold += 75
        $ gold -= 150 
        m "И вот 75 галлеонов каждой.."
        call her_main("Спасибо, [genie_name]!","base","base") 
        call luna_main("...", 7, 2, 2, 2) 
        call her_main("Полумна! Не будь грубой.","angry","angry") 
        call luna_main("...Спасибо [l_genie_name].", 5, 2, 4, 2) 
        call her_main("...","disgust","down_raised") 
        call her_main("Что ж, нам лучше уйти, сэр, нам еще нужно многому научиться!","grin","baseL") 
        call her_main("(Не говоря уже о практике с самотыком...)","soft","squintL") 
        call her_main("Пойдем Полумна!","open","baseL") 
        call luna_main("...", 1, 2, 1, 1) 
        ">Полумна и Гермиона вместе покинули кабинет, счастливо болтая, когда дверь закрылась."

    elif luna_corruption == 15: #second time
        $ luna_corruption += 1
        m "Как на счет еще одного минета?"
        call luna_main("...", 7, 1, 2, 2) 
        m "Да ладно тебе, похоже тебе понравился последний раз..."
        call luna_main("*Хмкмх* только потому что у вас волшебная сперма...", 5, 2, 2, 1) 
        m "Ну тогда у меня готова свежая порция для тебя!"
        call luna_main("Ладно, тогда... поторопитесь и позовите Гермиону.", 6, 2, 4, 1) 
        m "Опять? Я думал, ты хотела, чтобы она была здесь только в первый раз?"
        call luna_main("Не припомню, чтобы мне надо было объясняться перед вами...", 7, 1, 2, 2) 
        m "..."
        call luna_main("Кроме того, вы же не ожидаете, что я научусь всему только на одном уроке.", 5, 2, 1, 1) 
        m "Справедливо, к тому же, ты не услышишь мои недовольства."
        call luna_main("Хорошо...", 5, 1, 2, 1) 
        ">Ты вызвал Гермиону в свой кабинет."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте профессор!","base","closed") 
        call her_main("Хей Полумна! Что он хочет на этот раз? Еще один минет?","base","suspicious") 
        call luna_main("Мкхммм...", 5, 1, 1, 1) 
        call her_main("Отлично!!!","base","down") 
        call her_main("Вам должно понравится [genie_name]. Она постоянно практиковалась, с прошлого раза!","soft","ahegao") 
        m "Правда? Я не ожидал, что она будет так воодушевлена..."
        call luna_main("*Хмкхм* не похоже, что я воодушевлена этим...", 5, 2, 2, 2) 
        call her_main("Я говорила тебе перестать вести себя так холодно, Полумна!","grin","baseL") 
        call her_main("Вам надо было это услышать, [genie_name]... Она практически умоляла о дополнительных занятиях...","open","baseL") 
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
        call luna_main("...", 5, 3, 4, 1) 
        call her_main("Она настаивала, чтобы я провела весь наш последний урок, обучая ее правильной работе с языком...","base","squint") 
        call her_main("Я убедилась, что она сначала изучила трансфигурацию и гербологию...","grin","worriedCl",emote="05") 
        $ luna_flip = 1
        call luna_main("Может перестанем болтать и начнем уже!", 7, 2, 3, 2) 
        call her_main("Видите, я же говорила, что она просто жаждет этого!","soft","squintL") 
        m "Я с трудом могу в это поверить..."
        call luna_main("Замолчите! Вы оба!", 4, 2, 2, 2) 
        m "..."
        call her_main("Хорошо... давайте тогда начнем.","base","down") 
        call luna_main("Наконец-то...", 5, 3, 4, 1) 
        show screen blkfade 
        with d3
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png"
        ">Гермиона и Полумна вместе медленно раздеваются, и медленно складывают свою одежду в стопки на твоем столе."
        ">В итоге Полумна встала перед тобой на колени, глядя тебе в глаза, а Гермиона стояла позади нее, изучая ее действия."
        her "Не забывай смотреть в его глаза... Он любит это."
        $ ccg_folder = "luna_bj"
        $ ccg1 = "herm"
        $ ccg3 = "gene"
        $ ccg2 = 1
        show screen ccg
        hide screen luna_chibi
        hide screen luna
        hide screen hermione_blink
        hide screen hermione_main
        hide screen blkfade 
        with d3
        lun "..."
        $ ccg2 = 2
        lun "Теперь мне нужно высунуть свой язык наружу?"
        her "Да, очень хорошо..."
        lun "..."
        $ ccg2 = 3
        lun "Ах..."
        her "Хорошо... теперь ты знаешь, что нужно делать."
        lun "..."
        $ ccg2 = 4
        ">Полумна наклонилась вперед, начав с удовольствием облизывать головку твоего члена."
        m "Угх... вот так, шлюшка."
        her "Мммм... Именно так как мы обговаривали. Не забывай работать по всей его длине..."
        lun "..."
        $ ccg2 = 5
        ">Полумна снова наклонилась вперед, вновь облизывая твой член, в этот раз двигаясь дальше по твоему стволу."
        m "Да..."
        her "Не бойся лизать его яйца."
        $ ccg2 = 6
        lun "Хорошо..."
        $ ccg2 = 7
        ">Полумна продолжает лизать головку твоего члена, бегая язычком по всей его длине, время от времени возвращаясь к головке и яйцам."
        her "Так же, как мы практиковались..."
        lun "..."
        $ ccg2 = 8
        lun "Должна ли я начать сосать его?"
        her "Ты жаждешь этого, не так ли?"
        $ ccg2 = 7
        lun "..."
        her "Ну, если хочешь пососать его, спроси разрешение..."
        lun "!!!"
        lun "Мне обязательно?"
        her "Обязательно. Мы говорили об этом..."
        $ ccg2 = 1
        lun "Можно мне... пососать ваш член..."
        menu:
            "-Заставить ее умолять-":
                $ luna_dom -= 1
                $ luna_sub += 1
                m "Я даже не знаю... может быть, если ты попросишь немного милее..."
                lun "..."
                her "Продолжай..."
                lun "Ладно..."
                $ ccg2 = 2
                lun "Могу ли я отсосать вам, сэр?"
                m "Хммм, я не уверен... звучало не очень убедительно."
                $ ccg2 = 28
                lun "Да как вы смеет-"
                her "ПОЛУМНА!"
                $ ccg2 = 8
                lun "..."
                $ ccg2 = 2
                lun "Пожалуйста... можно мне пососать ваш гигантский член..."
                m "Продолжай..."
                lun "Пожалуйста..."
                $ ccg2 = 29
                lun "Я просто хочу попробовать..."
                lun "Почувствовать его в моем грязном ротике..."
                m "Вот теперь ты хорошо попросила!"
            "-Разрешить ей-":
                m "Начинай, шлюха."
        $ ccg2 = 30
        lun "*хмкхм*"
        her "Скажи спасибо..."
        $ ccg2 = 28
        lun "..."
        $ ccg2 = 2
        lun "Спасибо, сэр..."

        $ ccg2 = 9
        ">Полумна широко открыла свой ротик, с нетерпением демонстрируя его."
        lun "Ах..."
        her "Хорошая работа... теперь засунь его себе в рот..."
        $ ccg2 = 10
        lun "..."
        pause
        $ ccg2 = 8
        lun "Ты уверена-"
        her "Тссс... все хорошо. Я здесь..."
        ">Гермиона кладет руку на голову Полумны."
        $ ccg2 = 11
        lun "Эй! Я думаю, что смогу справиться сама-"
        ">Прежде чем Полумна снова начала жаловаться, Гермиона сильно толкнула ее на твой ждущий член."
        $ ccg2 = 16
        lun "!!!"
        her "Ну вот! Посмотри каких успехов ты достигла после первого раза!"
        $ ccg2 = 17
        lun "............."
        her "Хотя, я все еше думаю, что тебе нужен небольшой перерыв, чтобы позволить твоему ротику привыкнуть..."
        $ ccg2 = 18
        pause
        lun "...................."
        her "Не забывай дышать через нос!"
        lun "............................."
        $ ccg2 = 19
        m "Мммм, ее язык двигается как сумасшедший..."
        her "Хорошо... Мы вчера вечером, несколько часов практиковали работу ее языка..."
        $ ccg2 = 18
        m "Что ж, практика дает свои результаты!"
        her "Ты слышишь Полумна?"
        $ ccg2 = 31
        lun "{image=textheart}{image=textheart}{image=textheart}"
        pause
        her "Она немного волновалась, что вам не захочется..."
        her "Так или иначе, время к настоящему делу!"
        $ ccg2 = 17
        lun "*К..пхгл..како..блгл..му..углп...делу...блглуп*!!!"
        ">Ты чувствуешь, как Полумна пытается жалобно кричать, в то время как ее рот забит твоим членом."
        m "Мммм, как приятно."
        her "Ладно Полумна, мы собираемся двигаться немного быстрее, чем в прошлый раз!"
        ">Ты видишь как Гермиона еще крепче рукой ухватывается за волосы Полумны."
        her "Теперь позволь мне волноваться о скорости, а сама сосредоточься на работе язычком, хорошо?"
        lun "*Хоорооглукшоо*"
        $ ccg2 = 19
        her "Хорошая девочка..."
        $ ccg2 = 18
        lun "*Ммммгххх*..."
        her "Нуу... мы... начали!"
        ">Гермиона начала толкать голову Полумны назад и вперед так глубоко, на сколько было возможно."
        $ ccg2 = 23
        ">В конце-концов, она ловит ритм движения головы вперед, пока примерно половина твоего члена не оказывается во рту, а затем назад, пока ее челюсть не поймает твою головку."
        $ ccg2 = 16
        m "Мммм... да... именно так, маленькие шлюшки..."
        $ ccg2 = 23
        pause
        her "Ну как она, [genie_name]? Как ощущения от ее язычка?"
        $ ccg2 = 16
        m "Это... так... восхитительно..."
        $ ccg2 = 20
        lun "..."
        $ ccg2 = 17
        her "Здорово! Она не слишком торопится, не так ли?"
        $ ccg2 = 21
        m "Нет... Все отлично..."
        ">Все это время, пока Гермиона разговаривала с тобой, ее рука еще плотнее оборачивалась вокруг волос Полумны, заставляя ее голову двигаться назад и вперед до самых пузырьков."
        $ ccg2 = 18
        her "Теперь убедись, что жестко сосешь, когда я толкаю твою голову вперед, хорошо, Полумна..."
        $ ccg2 = 20
        lun "*Ммммкуууу*..."
        $ ccg2 = 17
        ">Это продолжается еще несколько минут. Полумна продолжает сосать твой член без устали, а Гермиона постоянно ее консультирует."
        $ ccg2 = 22
        m "Ууух... Приготовьтесь шлюшки... Осталось немного..."
        $ ccg2 = 20
        her "Ммм... куда бы вам хотелось кончить, [genie_name]?"
        $ ccg2 = 19
        ">Гермиона продолжала сильно двигать голову Полумны вперед и назад во время разговора."
        $ ccg2 = 21
        her "Вы хотите спустить все это прямиком в ее маленькую грязную глотку?"
        $ ccg2 = 32
        pause
        lun "*Мммммм*...{image=textheart}"
        $ ccg2 = 21
        ">Рот Полумны приятно вибрировал вокруг твоего члена."
        $ ccg2 = 17
        her "Или вы желаете обкончать все ее лицо?"
        $ ccg2 = 20
        m "Ууух..."
        $ ccg2 = 17
        her "Я знаю чего она хочет..."
        $ ccg2 = 21
        her "Она хочет, чтобы вы снова кончили ей в рот и в ее глотку..."
        $ ccg2 = 32
        lun "{image=textheart}{image=textheart}{image=textheart}"
        $ ccg2 = 20
        her "Но она не будет счастлива от этого..."
        $ ccg2 = 21
        lun "!!!"
        $ ccg2 = 19
        her "Так почему бы вам не накончать на эту сучку..."
        g9 "Ууух... я больше не могу сдерживаться!"
        ">Как только ты достиг оргазма, Гермиона отцепила голову Полумны от твоего члена."
        $ ccg2 = 33
        lun "ЭЙ!"
        g9 "ПОЛУЧИТЕ ЕЕ ВСЮ, ШЛЮХИ!!!"
        $ ccg2 = 35
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "{size=+5}ARGH! ДА!!!{/size}"
        pause
        $ ccg2 = 35
        lun "!!!!!!!!!!!!"
        her "Мммм, выпустите, [genie_name]... Выпустите ее всю..."
        her "Покройте ее ей..."
        g4 "{size=+5}АХ...{/size}"
        ">Твоя сперма изверглась над лицом Полумны, попадая в глаза и рот, пока Гермиона все это время крепко держала ее за голову, не давая ей отвернуться."
        $ ccg2 = 36
        pause
        lun "..."
        lun "......"
        $ ccg2 = 37
        pause
        lun "........."
        $ ccg2 = 38
        pause
        lun "............."
        $ ccg2 = 39
        lun "Гермиона! Ты обещала!"
        her "Жестоко. Теперь просто стой спокойно и смотри в глаза, как я тебе говорила..."
        $ ccg2 = 40
        lun "Я не могу... на них попала сперма..."
        her "Очень плохо."
        lun "..."
        $ ccg2 = 41
        pause
        lun "......."
        $ ccg2 = 42
        her "Хорошая девочка..."
        #fade to black.
        hide screen ccg 
        with fade
        ">Полумна и Гермиона одевались, пока ты сидел в кресле и наслаждался шоу.."
        call her_main("Ну вот, Полумна, как тебе?","grin","baseL") 
        call luna_main("Было неплохо...", 5, 2, 1, 2) 
        call luna_main("Хотя я больше люблю, когда он кончает мне в рот...", 5, 2, 1, 2) 
        call her_main("Я знаю... Но дело не в том, нравится ли тебе это.","grin","worriedCl") 
        call luna_main("Почему?", 6, 2, 2, 2) 
        call her_main("Потому что хороший минет помогает ему чувствовать себя хорошо.","grin","worriedCl") 
        call her_main("Я вижу, что у нас будет еще один урок после того, как нам заплатят, кстати говоря...","grin","worriedCl") 
        $ ravenclaw += 30
        $ gryffindor += 30
        m "По 30 очков \"Гриффиндору\" и \"Когтеврану\"!"
        $ luna_gold += 75
        $ gold -= 150 
        m "А так же по 75 галлеонов каждой"
        call her_main("Спасибо, [genie_name]!","base","base") 
        call luna_main("...", 7, 2, 2, 2) 
        call her_main("...","disgust","down_raised") 
        call luna_main("...спасибо вам, сэр.", 5, 2, 4, 2) 
        call her_main("Что ж, нам лучше уйти сэр, нам еще нужно многому научиться!","grin","baseL") 
        call her_main("(Не говоря уже о практике с самотыком...)","soft","squintL") 
        call her_main("Пойдем Полумна!","open","baseL") 
        call luna_main("...", 1, 2, 1, 1) 
        ">Полумна и Гремиона вместе покидают твой кабинет, весело болтая за закрывающейся дверью."

    else: #third time (repeatable)
        if luna_corruption <= 16:
            $ luna_corruption += 1
        m "Как на счет еще одного урока минета?"
        call luna_main("...", 5, 2, 2, 1) 
        call luna_main("Хорошо...", 5, 2, 4, 1) 
        call luna_main("Только поторопитесь и позовите Гермиону...", 5, 1, 1, 1) 
        m "Если ты настаиваешь..."
        ">Ты вызвал Гермиону в свой кабинет."
        $ renpy.play('sounds/door.mp3') #Sound of a door opening.
        $ hermione_SC.chibi.xpos = 600 #Near the desk.
        show screen hermione_blink #Hermione stands still.
        $ luna_flip = -1
        $ luna_r_arm = 2
        $ luna_xpos = 390
        call update_her_uniform 
        pause
        call her_main("Здравствуйте профессор!","base","closed") 
        call her_main("Привет Полумна! Еще один минет?","base","suspicious") 
        call luna_main("Мкхммм...", 7, 2, 1, 1) 
        call her_main("Ееей!!!","grin","worriedCl") 
        call her_main("Наконец-то мы сможем попрактиковать глубокий минет!","base","glance") 
        m "Серьезно? Ты уверена, что она готова к этому?"
        call luna_main("*Хмкхм* конечно готова...", 7, 2, 2, 4) 
        call her_main("Поверьте, сэр, она очень упорно тренировалась! ","open","baseL") 
        call her_main("Видели бы вы ее, [genie_name]... она почти заглотила мой 7-дюймовый самотык...","grin","ahegao") 
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
        call luna_main("...", 7, 2, 4, 2) 
        call her_main("Ну, на половину...","soft","squintL") 
        call her_main("Но я уверена, что она справится в настоящем деле...","grin","baseL") 
        $ luna_flip = 1
        call luna_main("Может мы перестанем болтать и приступим уже!", 7, 2, 2, 1) 
        call her_main("Видите, я же сказала, что она готова!","grin","worriedCl") 
        m "Я с трудом могу в это поверить..."
        call her_main("Ну ладно... Давайте тогда начнем.","grin","ahegao") 
        call luna_main("Наконец-то...", 5, 2, 4, 1) 
        show screen blkfade 
        with d3
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png"
        ">Гермиона и Полумна вместе медленно раздеваются, медленно складывая свою одежду в стопки на твоем столе."
        ">В итоге Полумна стала перед тобой на колени, глядя тебе в глаза, а Гермиона стояла позади нее, изучая ее действия."
        her "Не забывай смотреть в его глаза... он это любит."
        $ ccg_folder = "luna_bj"
        $ ccg1 = "herm"
        $ ccg3 = "gene"
        $ ccg2 = 1
        show screen ccg
        hide screen luna_chibi
        hide screen luna
        hide screen hermione_blink
        hide screen hermione_main
        hide screen blkfade 
        with d3
        lun "..."
        $ ccg2 = 43
        lun "Ах..."
        her "Отличная работа, Полумна..."
        $ ccg2 = 44
        lun "Спасибо..."
        her "Хорошо... Ты знаешь что делать."
        lun "..."
        $ ccg2 = 5
        ">Полумна наклонилась вперед, начав с удовольствием облизывать головку твоего члена."
        m "Уух... вот так, шлюшка."
        her "Мммм... не забывай о грязных словечках..."
        lun "..."
        $ ccg2 = 45
        ">Полумна снова наклоняется вперед, вновь облизывая твой член, на этот раз двигаясь дальше по всей длине."
        m "Да..."
        $ ccg2 = 5
        lun "Странный вкус..."
        $ ccg2 = 7
        ">Полумна продолжает лизать головку твоего члена, чередуя между лизанием и нежным посасыванием головки..."
        her "Это приятно, не правда ли?"
        lun "Да..."
        $ ccg2 = 9
        lun "Могу ли я начать сосать его, сэр?"
        her "Ты жаждешь его, не так ли..."
        $ ccg2 = 6
        lun "Да..."
        $ ccg2 = 46
        lun "Я не могу дождаться, когда он выстрелит свою липкую сперму в меня..."
        her "Очень хорошо... теперь скажи ему кто ты."
        lun "..."
        $ ccg2 = 47
        lun "Я шлюха, сэр..."
        her "Еще."
        $ ccg2 = 48
        lun "Я шлюха, ваш персональный спермобанк..."
        $ ccg2 = 49
        lun "Я грязная маленькая конченная шлюха, которая пристрастилась к директорской сперме..."
        her "Ну что ж, время заработать ее, конченная шлюха... Открой ротик пошире!"

        $ ccg2 = 9
        ">Полумна широко открыла свой рот, с нетерпением демонстрируя его."
        lun "Ах..."
        her "Хорошая работа... Мы начинаем!"
        ">Гермиона хватает Полумну за затылок и жестко толкает ее, заставляя твой член вонзиться в ее рот, доставая до входа в ее горло."
        $ ccg2 = 23
        lun "!!!"
        her "Поехали! Теперь член Дамблдора немного толще, чем самотык, с которым мы практиковались, поэтому убедись, что расслабила горло..."
        $ ccg2 = 20
        lun "............."
        her "Как она, [genie_name]? Она полностью его заглатывает?"
        m "Почти, на самом деле у нее не глубокий минет..."
        $ ccg2 = 21
        pause
        her "Понятно, секрет в том, чтобы попытаться проглотить его."
        her "Теперь я хочу толкнуть тебя еще раз, и я хочу, чтобы ты его проглотила, когда я это сделаю, хорошо?"
        lun "*ммммкуууу*"
        her "Ну... что ж, мы..."
        $ ccg2 = 17
        ">Гермиона толкнула голову Полумны на твой член."
        her "Погнали!"
        $ ccg2 = 50
        ">Гермиона сделала еще один резкий толчок, на этот раз заставляя твой член полностью войти в горло Полумны."
        lun "*глоть*"
        m "Ууух... вот так..."
        her "Хорошая работа, Полумна! Я знала ты сможешь это сделать!"
        $ ccg2 = 51
        lun "*Глллыыыккк*"
        ">Гермиона откидывает голову Полумны назад."
        $ ccg2 = 52
        m "Боже как же было приятно..."
        her "Мммм, не сомневаюсь... теперь убедись, что дышишь через нос, ведь когда я толкну твою голову обратно, ты не сможешь дышать, пока он в твоем горле, поняла?"
        $ ccg2 = 53
        lun "ммммкуууу"
        ">Гермиона снова толкает Полумну вперед."
        $ ccg2 = 54
        pause
        her "Видишь..."
        her "Это балансирующая игра... теперь приготовься, мы немного ускорим темп."
        $ ccg2 = 51
        lun "*Ка..пхгл..ко.глыкхп..го..глупг*!!!"
        ">Ты чувствуешь, как Полумна пытается жалобно кричать, в то время как ее рот забит твоим членом."
        m "Мммм, мне нравится, когда она так делает..."
        ">Ты видишь, как рука Гермионы еще крепче ухватывается за волосы Полумны."
        her "Не забывай дышать на обратном пути."
        $ ccg2 = 55
        lun "*Оккккххееейй*"
        her "Хорошая девочка..."
        $ ccg2 = 52
        lun "*глык*глык*глык*..."
        her "Именно так!"
        ">Гермиона начинает быстрее трахать лицом Полумны твой член."
        $ ccg2 = 54
        lun "*глык*агх*глык*..."
        $ ccg2 = 52
        m "Мммм... Да... Именно так, маленькие шлюшки..."
        $ ccg2 = 54
        pause
        her "Теперь это немного быстрее и сложнее, чем обычно ты делала, когда сосала самостоятельно."
        $ ccg2 = 52
        her "Но это потрясающее чувство, не так ли?"
        $ ccg2 = 54
        m "О дааа... это просто... невероятно..."
        $ ccg2 = 52
        her "Я разговаривала с Полумной, [genie_name]."
        $ ccg2 = 56
        lun "...*глык*{image=textheart}*глык*..."
        $ ccg2 = 52
        her "Мммм, я знаю, тебе нравится это."
        $ ccg2 = 54
        ">Гермиона без устали заставляет тебя трахать горло Полумны."
        $ ccg2 = 52
        lun "*глык*глык*глык*"
        $ ccg2 = 56
        lun "*глык*{image=textheart}*глык*{image=textheart}*глык*"
        $ ccg2 = 52
        ">Это продолжается еще несколько минут. Полумна бездумно пронзала горло, пока Гермиона продолжала ее консультировать."
        $ ccg2 = 57
        m "Ууух... Приготовьтесь шлюшки... Осталось недолго..."
        $ ccg2 = 58
        her "Ммм... вот так, [genie_name]..."
        $ ccg2 = 54
        ">Гермиона продолжала сильно толкать голову Полумны назад и вперед, пока разговаривала."
        $ ccg2 = 52
        her "Я думаю она хочет, чтобы вы снова кончили ей в глотку..."
        $ ccg2 = 56
        pause
        lun "*Ммммм*...{image=textheart}"
        $ ccg2 = 58
        ">Рот Полумны приятно вибрирует вокруг твоего члена."
        $ ccg2 = 54
        her "Но мы не можем этого допустить, не так ли?"
        $ ccg2 = 52
        m "Ууух..."
        $ ccg2 = 51
        her "Шлюхи вроде нее не заслуживают того, чтобы получить то, чего хотят..."
        $ ccg2 = 57
        her "Она не заслуживает всей этой сладкой спермы для себя, не так ли?"
        $ ccg2 = 52
        lun "{image=textheart}{image=textheart}{image=textheart}"
        $ ccg2 = 54
        her "Ей нужно научиться делиться..."
        $ ccg2 = 52
        lun "..."
        $ ccg2 = 54
        her "Так почему бы вам не облить {b}спермой{/b} всех шлюх..."
        g9 "Ууух... я больше не могу сдерживаться!"
        ">Как только ты достиг оргазма, Гермиона оторвала голову Полумны от твоего члена."
        $ ccg2 = 59
        lun "Хууаааах!"
        pause
        g9 "ПОЛУЧАЙТЕ ЕЕ ВСЮ, ШЛЮХИ!!!"
        show screen white 
        pause.1
        hide screen white
        pause.2
        show screen white 
        pause .1
        hide screen white
        with hpunch
        g4 "{size=+5}АРГХ! ДА!!!{/size}"
        pause
        $ ccg2 = 60
        lun "!!!!!!!!!!!!"
        her "Мммм, выпустите ее, [genie_name]... выпустите ее всю..."
        her "Обкончайте ее..."
        g4 "{size=+5}ААХ...{/size}"
        ">Твоя сперма заполнила рот Полумны до краев, в то время как Гермиона крепко держала ее голову."
        $ ccg2 = 61
        pause
        lun "..."
        lun "......"
        $ ccg2 = 62
        pause
        lun "........."
        $ ccg2 = 63
        pause
        lun "............."
        $ ccg2 = 64
        lun "Ууух....."
        her "Не думаю, что она может говорить..."
        lun "*Гхрбблбл*"
        her "Вы должны были жестче трахать ее глотку, [genie_name]..."
        her "Ну ладно уж!"
        lun "..."
        $ ccg2 = 65
        pause
        show screen blkfade
        with d3
        ">Гермиона наклонилась перед Полумной и начала слизывать сперму с ее лица."
        $ ccg1 = "blank"
        $ ccg3 = "blank"
        $ ccg2 = 66
        hide screen blkfade
        with d3
        her "Мммм, я же говорила тебе, что мы должны делиться тем, чем он платит, не так ли?"
        lun "Д-да..."
        $ ccg2 = 67
        her "Мммм... {size=-5}хорошая девочка...{/size}"
        show screen blkfade
        with d3
        hide screen ccg 
        with fade
        ">Полумна и Гермиона одевались, пока ты сидел в кресле, наслаждаясь шоу"
        hide screen blkfade
        with d3
        call her_main("Ну что скажешь Полумна, как тебе?","grin","baseL") 
        $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png"
        $ luna_tears = 3
        call luna_main("......", 5, 3, 4, 2) 
        call luna_main("Невероятно...", 5, 2, 4, 1) 
        call her_main("Я же говорила, что тебе понравится, не так ли?","grin","worriedCl") 
        call luna_main("Да, Гермиона...", 8, 3, 4, 1) 
        call her_main("Хорошо, а теперь, я думаю, что нам нужно заняться более интересными исследованиями, [genie_name], не могли бы вы нам заплатить?","grin","worriedCl") 
        $ ravenclaw += 30
        $ gryffindor += 30
        m "По 30 очков \"Гриффиндору\" и \"Когтеврану\"!"
        $ luna_gold += 75
        $ gold -= 150 
        m "И по 75 галлеонов каждой"
        call her_main("Спасибо [genie_name]! В любое время, когда вы захотите трахнуть эту маленькую развратную глотку Полумны, просто дайте нам знать!","base","base") 
        call luna_main("...Списибо, сэр.", 5, 3, 4, 1) 
        call her_main("Что ж, нам лучше уйти, сэр, нам еще нужно многому научиться!","grin","baseL") 
        call her_main("(Не говоря уже о практике с {b}большим{/b} членом...)","soft","squintL") 
        call her_main("Ну же, Полумна!","open","baseL") 
        call luna_main("...", 1, 3, 4, 1) 
        ">Полумна и Гермиона вместе покинули твой кабинет, радостно болтая за закрывающейся дверью."

    call play_sound("door") #Sound of a door opening.
    hide screen luna
    hide screen luna_chibi
    $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_1.png"
    $ luna_tears = 0
    $ luna_busy = True
    jump end_hg_pf


    jump luna_away
label luna_favour_7:
    m "Полумна."
    call luna_main("Да, сэр...", 1, 1, 4, 1) 
    m "Сегодня я хочу новую услугу от тебя."
    call luna_main("Правда?", 4, 1, 1, 1) 
    m "Сегодня мы..."
    call luna_main("Подождите!", 4, 1, 2, 1) 
    call luna_main("Прежде, чем скажите...", 5, 2, 4, 1) 
    call luna_main("Можете пожалуйста позвать Гермиону?", 5, 1, 4, 2) 
    m "Но ты ведь даже не знаешь, о чем именно я собирался тебя просить!"
    call luna_main("Я догадываюсь, сэр...", 7, 1, 2, 1) 
    call luna_main("И если вы не против, я бы хотела, чтобы Гермиона тоже была здесь.", 5, 2, 4, 1) 
    m "Ну что ж, я не собираюсь тебе отказывать!"
    call luna_main("Спасибо, сэр...", 2, 1, 4, 1) 
    ">Ты вызвал Гермиону в свой кабинет."
    $ luna_xpos = 300
    $ luna_flip = -1
    call her_main("Хей Полумна!!!","grin","wink") 
    call her_main("[genie_name].","normal","happyCl") 
    call her_main("И чего же он хочет от нас сегодня?","smile","glance") 
    call her_main("Очередной минет?","grin","baseL") 
    call luna_main("Он еще не сказал.", 5, 2, 4, 1) 
    call luna_main("Я просто хотела, чтобы ты была здесь.", 6, 8, 4, 1) 
    call her_main("Ты имеешь в виду...","shock","happy") 
    call her_main("Оуу это так мило Полумна.","grin","soft") 
    call her_main("Вам стоило бы повежливее ее просить, сэр!","mad","narrow") 
    m "Ты даже не знаешь что име-"
    call her_main("Сэр, ни для кого уже ни секрет, что вы обычно просите дальше.","open","closed") 
    call her_main("По крайней мере, постарайтесь сделать это для нее немного романтичнее...","smile","soft") 
    m "Романтичнее?"
    call her_main("Придумайте что-нибудь!","open","angry") 
    call luna_main("Вам действительно не стоит об этом беспокоиться... [l_genie_name]...", 1, 3, 4, 2) 
    call her_main("Тсс! Твой первый раз должен быть хоть немного особенным, Полумна!","upset","angryL") 
    m "..."
    m "Полумна Лавгуд."
    m "Не окажешь ли ты мне честь?"
    $ luna_flip = 1
    call luna_main("...", 4, 1, 4, 1) 
    call her_main("(Это круче всего, что я когда-либо слышала...)","open","wink") 
    call luna_main("Я...", 4, 2, 4, 1) 
    call luna_main("Я......", 4, 2, 4, 2) 
    call luna_main("Я не могу!", 4, 3, 4, 3) 
    call her_main("Что?","shock","wide") 
    call her_main("Почему нет, Полумна? Мы ведь уже говорили об этом...","soft","worried") 
    call her_main("Мы даже все прошлые выходные \'практиковались\'...","normal","worriedL") 
    call luna_main("Я знаю...", 1, 2, 3, 4) 
    call luna_main("Просто...", 1, 3, 4, 14) 
    call luna_main("Не думаю, что смогу справиться...", 1, 2, 4, 3) 
    call luna_main("Я не такая как ты... Я не могу быть хороша во всем...", 3, 2, 4, 15) 
    show screen blkfade
    "*Шлеп*"
    ">Ты закрыл глаза и отшатнулся, ожидая, что жжение на лице начнется в любой момент, но этого так и не началось."
    $ luna_cheeks = "characters/luna/body/face/cheeks/cheeks_2.png" 
    hide screen blkfade 
    with d3
    ">Вместо этого, ты заметил ярко-красную отметину, формирующуюся на лице Полумны."
    call her_main("Тебе нужно прекратить думать об этом, прямо сейчас!","open","angry") 
    call luna_main("Но я не-", 1, 2, 4, 4) 
    call her_main("Полумна... ты должна перестать сравнивать себя с другими людьми.","open","wink") 
    call her_main("Ты самая милая, симпатичная и приятная девушка в этой школе и я не знаю, что с тобой недавно случилось, но ты просто должна успокоиться и наслаждаться жизнью. ","open","wink") 
    $ luna_tears = 2
    call luna_main("Но...", 4, 3, 4, 2) 
    call her_main("Тссс... Все хорошо...","soft","soft") 
    call her_main("Почему бы нам не начать наслаждаться большим членом нашего директора, а?","grin","happy") 
    call her_main("Тебе станет лучше от этого?","smile","wink") 
    call luna_main("Д-да...", 5, 2, 4, 1) 
    show screen blkfade 
    with d3
    hide screen luna
    hide screen hermione_main
    $ luna_tears = 0
    her "Хорошо... Теперь давай разденемся и запрыгнем на стол [genie_name]а!"
    lun "Гермиона... Я все еще не уверена на счет этого..."
    lun "Не знаю, готова ли я..."
    her "Тссс, все хорошо... Я начну первой, ладно?"
    lun "Правда? Ты сделаешь это для меня?"
    her "Конечно! Кроме того, я действительно хочу сделать это..."
    her "Я уверена, тебе это очень сильно понравится!"
    lun "Надеюсь на это..."
    her "[genie_name], вы готовы?"
    $ ccg_folder = "luna_sex"
    $ ccg1 = "luna_1"
    $ ccg2 = "herm_1"
    $ ccg3 = "blank"
    show screen ccg
    hide screen bld1
    hide screen blkfade 
    with d3
    m "Еще как!"
    pause
    menu:
        "-Быть нежным...-":
            ">Ты разводишь ноги Гермионы, медленно разводя их в стороны, поднося головку своего члена к ее нежной киске."
            $ ccg2 = "herm_2"
            her "А теперь не торопитесь [genie_name], чтобы у Полумны было хорошее представление о том, что ей-"
            ">Ты легонько подносишь головку своего члена к ее ожидающей киске."
            $ ccg2 = "herm_3"
            her "{image=textheart}Ах{image=textheart}"
            m "Мммм, вот так шлюшка... Мы можем это сделать медленно и приятно..."
            ">Ты засовываешь остальную часть своего члена в ее маленькую дырочку."
            $ ccg2 = "herm_4"
            her "Ах{image=textheart}{image=textheart}{image=textheart}..."
            pause
            her "Так {image=textheart}прияяяятно{image=textheart}..."
            $ ccg1 = "luna_2"
            lun "Ммм..."
            g4 "{size=+10}Ну что ж, поехали!{/size}"
            ">Ты начинаешь двигать своими бедрами к Гермионе туда-сюда, ее киска сжимается вокруг твоего твердого члена."
            $ ccg2 = "herm_5"
            her "Ах{image=textheart}... ух{image=textheart}... ах{image=textheart}..."
            her "{size=-15}жестче...{/size}"
            $ ccg1 = "luna_3"
            lun "Что это с Гермионой?"
            her "{size=-10}жестче...{/size}"
            $ ccg1 = "luna_4"
            lun "Я думаю вам лучше остановиться, сэр... Мне кажется вы можете сделать ей больно!"
            $ ccg2 = "herm_6"
            her "ЖЕСТЧЕ!!!"
            g4 "Угх... прими его, ты грязная шлюха."
            $ ccg1 = "luna_5"
            lun "..."
            her "Да, да!"
            her "Я грязная маленькая шлюха..."
            $ ccg2 = "herm_7"
            her "Глупо {image=textheart}трахаться{image=textheart} перед своей лучшей подругой..."
            $ ccg1 = "luna_6"
            lun "(Лучшей?...)"
            $ ccg2 = "herm_8"
            her "Я даже собираюсь кончить перед ней!"
            $ ccg2 = "herm_5"
            her "Ах... я сейчас..."
            $ ccg1 = "luna_7"
            lun "Уже?"
            her "Д-д-да... {size=+5}Я{image=textheart}{image=textheart}{image=textheart}{/size}"
            $ ccg2 = "herm_9"
            her "{size=+5}КОНЧАЮ!!!{/size}"
        "-Быть грубым!-":
            ">Ты разводишь ноги Гермионы, поднося головку своего члена к ее нежной киске."
            her "А теперь просто не торопитесь, чтобы у Полумны было хорошее представление о том, что ей-"
            ">Ты резко вставил в нее, засунув свой член по самые яйца."
            her "!!!"
            g4 "Ммм, вот так шлюха... Там все еще так туго."
            her "Ах{image=textheart}{image=textheart}{image=textheart}... это..."
            pause
            her "Так {image=textheart}прияяятноо{image=textheart}..."
            $ ccg1 = "luna_5"
            lun "Ммм..."
            g4 "{size=+10}Ну что ж, поехали!{/size}"
            ">Ты начинаешь двигать своими бедрами к Гермионе туда-сюда, ее киска сжимается вокруг твоего твердого члена."
            $ ccg2 = "herm_5"
            her "Ах{image=textheart}... ух{image=textheart}... ах{image=textheart}..."
            her "{size=-15}Жестче...{/size}"
            $ ccg1 = "luna_3"
            lun "Что это с Гермионой?"
            her "{size=-10}Жестче...{/size}"
            $ ccg1 = "luna_4"
            lun "Я думаю вам лучше остановиться, сэр... Мне кажется вы можете сделать ее больно!"
            $ ccg2 = "herm_6"
            her "ЖЕСТЧЕ!!!"
            g4 "Угх... Прими его, грязная шлюха."
            $ ccg1 = "luna_5"
            lun "..."
            her "Да, да!"
            her "Я грязная маленькая шлюха..."
            $ ccg2 = "herm_7"
            her "Глупо {image=textheart}трахаться{image=textheart} перед своей лучшей подругой..."
            $ ccg1 = "luna_6"
            lun "(Лучшей?...)"
            $ ccg2 = "herm_8"
            her "Я даже собираюсь кончить перед ней!"
            $ ccg2 = "herm_5"
            her "Ах... я сейчас..."
            $ ccg1 = "luna_7"
            lun "Уже?"
            her "Д-д-да... {size=+5}Я{image=textheart}{image=textheart}{image=textheart}{/size}"
            $ ccg2 = "herm_9"
            her "{size=+5}КОНЧАЮ!!!{/size}"
    ">Влагалище Гермионы яростно дрожит, пока ее глаза закатываются... "
    pause
    $ ccg2 = "herm_10"
    m "Угх... вот так, девочка..."
    $ ccg2 = "herm_11"
    her "Так{image=textheart}{image=textheart}{image=textheart} прияяяяяяяяятноооооо...{image=textheart}"
    $ ccg1 = "luna_8"
    lun "Ух ты..."
    ">Ты вытаскиваешь свой твердый, как камень член из маленькой дырочки Гермионы, не смотря на все ее усилия обхватить твой торс ногами. "
    $ ccg2 = "herm_12"
    her "Пожалуйста... Еще немного [genie_name]..."
    m "Так-так [hermione_name]... не будь жадиной..."
    $ ccg2 = "herm_13"
    her "..."
    her "Вы правы, сэр..."
    $ ccg2 = "herm_14"
    her "Прости Полумна..."
    $ ccg2 = "herm_15"
    her "Я просто такая жадная маленькая шлюха..."
    pause
    $ ccg1 = "luna_9"
    lun "Я знаю..."
    $ ccg2 = "herm_14"
    her "..."
    ">Ты отходишь от потного тела Гермионы, направляясь к молочно-белому телу Полумны."
    $ ccg1 = "luna_10"
    ">Ты разводишь ее ноги, подводя свой член к ее уже капающей киски."
    m "Ты готова [luna_name]?"
    $ ccg1 = "luna_11"
    lun "Я... я не думаю..."
    $ ccg1 = "luna_12"
    lun "Ты уверена, что все будет хорошо, Гермиона?"
    $ ccg2 = "herm_16"
    $ ccg1 = "luna_13"
    ">Гермиона нежно берет Полумну за руку."
    pause
    her "Я обещаю."
    $ ccg1 = "luna_14"
    lun "Спасибо Гермиоооонаааааааах"
    ">Ты решил прервать этот милый момент, медленно вставляя головку своего члена в мягкую киску Полумны."
    $ ccg1 = "luna_15"
    lun "Ах... он... такой горячий..."
    $ ccg2 = "herm_17"
    her "Ммммм, дааа именно..."
    $ ccg1 = "luna_16"
    lun "Ах...{image=textheart}{image=textheart}{image=textheart}"
    her "Мммм... Похоже ей нравится [genie_name]..."
    $ ccg1 = "luna_17"
    ">Полумна едва сдерживает робкий маленький стон в ответ."
    $ ccg2 = "herm_18"
    her "Может быть она готова к большему?"
    $ ccg1 = "luna_18"
    lun "Ах... да..."
    lun "Только пожалуйста... Помедленнее, сэр..."
    her "Хммм, я не уверена, что он сможет себя контролировать."
    show screen blkfade
    with d3
    ">Гермиона наклоняется и шепчет на ухо Полумне."
    $ ccg_folder = "luna_kiss"
    $ ccg1 = "1"
    $ ccg2 = "blank"
    $ ccg3 = "blank"
    hide screen blkfade
    with d3
    her "Я знаю, что не сможет."
    pause
    show screen blkfade
    with d3
    $ ccg_folder = "luna_sex"
    $ ccg1 = "luna_18"
    $ ccg2 = "herm_18"
    $ ccg3 = "blank"
    hide screen blkfade
    with d3
    ">Словно подчеркивая конец фразы Гермионы, ты медленно просунул, на всю оставшуюся длину в тугое влагалище Полумны."
    hide screen blkfade
    with hpunch
    $ ccg1 = "luna_19"
    lun "{size=+10}!!!{/size}"
    $ ccg1 = "luna_20"
    lun "Ааааах"
    $ ccg2 = "herm_19"
    her "Мммм, наверное это было слишком, сэр..."
    m "Угх... я ничего не мог с собой поделать."
    ">Ты медленно вытащил свой член из нее, пока не остался в ней лишь кончик, и прежде чем толкать вперед, поздравил себя с новоприобретенным \'писькиным домиком\'."
    g4 "Вот черт, она такая узкая..."
    g4 "Я едва могу двигаться..."
    $ ccg1 = "luna_20"
    lun "Аааааааах..."
    ">Ты медленно проникаешься все глубже, ритмично двигая бедрами. Каждый толчок заставлял губки Полумны нежно стонать."
    $ ccg2 = "herm_20"
    her "Как она [genie_name]?"
    m "Невероятна..."
    $ ccg1 = "luna_21"
    lun "Спасибо, сэр..."
    $ ccg1 = "luna_22"
    ">Ты начал замечать слезы, которые начали появляться в уголках глаз Полумны."
    $ ccg2 = "herm_16"
    her "Все в порядке Полумна?"
    $ ccg2 = "herm_18"
    her "Тебе ведь не слишком больно?"
    $ ccg1 = "luna_23"
    lun "Эт-то ерунда!"
    $ ccg2 = "herm_17"
    her "Ты уверена? Если больно, мы можем остановиться..."
    $ ccg1 = "luna_24"
    lun "Нет!"
    lun "Это просто... Я... Просто..."
    lun "Так..."
    $ ccg1 = "luna_25"
    lun "Счастлива..."
    ">Ты начинаешь замечать, что руки Полумны и Гермионы дрожат, когда Гермиона плотно прижимается к Полумне."
    $ ccg2 = "herm_21"
    her "Так тебе нравится?"
    $ ccg1 = "luna_26"
    lun "Ах..."
    lun "Да... Я думаю..."
    $ ccg1 = "luna_27"
    lun "Это немного больно... но это..."
    $ ccg1 = "luna_26"
    lun "Ах...{image=textheart}{image=textheart}{image=textheart}"
    $ ccg1 = "luna_25"
    lun "Все же приятно..."
    $ ccg2 = "herm_19"
    her "Еееей!!! Я знала, что ты полюбишь это! С этого момента все станет еще веселее!"
    $ ccg1 = "luna_29"
    lun "С этого... момента?"
    her "Уф... Ты же не думаешь, что Дамблдор будет счастлив, если трахнет эту сладкую киску лишь один раз?"
    $ ccg1 = "luna_24"
    lun "Ах...{image=textheart}{image=textheart}{image=textheart} Думаю нет..."
    $ ccg2 = "herm_18"
    her "Я знаю, не будет..."
    $ ccg1 = "luna_29"
    lun "Ч-что?"
    $ ccg2 = "herm_17"
    her "Тссс... просто наслаждайся."
    $ ccg1 = "luna_26"
    lun "Х-хорошо...{image=textheart}"
    g4 "Боже, так узко..."
    $ ccg1 = "luna_25"
    lun "Ах... Спасибо... сэр..."
    $ ccg2 = "herm_21"
    her "Хорошая девочка, ему нравится, когда ты называешь его так."
    $ ccg1 = "luna_18"
    lun "Правда?"
    $ ccg2 = "herm_18"
    her "Ммммм... но еще больше ему нравится, когда ты описываешь ему то, что чувствуешь."
    $ ccg1 = "luna_23"
    lun "Я..я не знаю... ах...{image=textheart} если бы я могла это сделать..."
    lun "Я слишком стесняюсь!"
    $ ccg2 = "herm_17"
    her "Я бы тоже этого хотела..."
    $ ccg1 = "luna_18"
    lun "..."
    lun "Ну тогда ладно..."
    $ ccg1 = "luna_21"
    lun "Это... ах...{image=textheart} будто бы он чешет там, куда я никогда не доставала."
    her "Ммммм, я знаю это чувство..."
    lun "Ах...{image=textheart} это пройдет?"
    $ ccg2 = "herm_18"
    her "Со временем... Но не надолго..."
    $ ccg1 = "luna_17"
    lun "Ах...{image=textheart}"
    $ ccg1 = "luna_20"
    lun "Что ты имеешь в виду?"
    $ ccg2 = "herm_19"
    her "Ммммм... не волнуйся, я уверена Дамблдор будет счастлив избавить тебя от этого зуда..."
    $ ccg2 = "herm_18"
    her "Или, если он будет слишком занят... ну... ты всегда можешь прийти ко мне..."
    $ ccg1 = "luna_17"
    lun "{image=textheart}{image=textheart}{image=textheart}"
    $ ccg1 = "luna_18"
    lun "Л-ладно..."
    $ ccg_folder = "luna_kiss"
    $ ccg1 = "2"
    $ ccg2 = "blank"
    $ ccg3 = "blank"
    hide screen blkfade
    with d3
    her "{size=-5}Хорошая девочка{/size}"
    pause
    ">Когда Гермиона шептала Полумне, ты чувствовал, как ее киска сжимала твой член."
    show screen blkfade
    with d3
    $ ccg_folder = "luna_sex"
    $ ccg1 = "luna_18"
    $ ccg2 = "herm_18"
    $ ccg3 = "blank"
    hide screen blkfade
    with d3
    g9 "Ммммм да!"
    g9 "Сделай это снова [hermione_name]!"
    $ ccg2 = "herm_22"
    her "Сделать что?"
    g9 "Назови ее хорошей девочкой!"
    $ ccg1 = "luna_16"
    lun "{image=textheart}{image=textheart}{image=textheart}"
    g9 "Угх... Боги мои! Ее пизденка каждый раз сходит с ума!"
    $ ccg1 = "luna_30"
    lun "Не правда... {image=textheart}ах...{image=textheart}"
    $ ccg2 = "herm_17"
    her "Оооу..."
    $ ccg2 = "herm_19"
    her "У кого-то есть грязный фетиш, не правда ли?"
    $ ccg1 = "luna_24"
    lun "Нет... это не так!"
    $ ccg1 = "luna_22"
    lun "Это просто... ммммм...{image=textheart}{image=textheart}"
    lun "Это потому что... ах...{image=textheart}"
    $ ccg1 = "luna_21"
    lun "Потому что {image=textheart}папочка{image=textheart} звал меня так..."
    $ ccg2 = "herm_18"
    her "И когда ты слышишь {b}хорошая девочка...{/b}"
    $ ccg1 = "luna_16"
    lun "Ммммм{image=textheart}{image=textheart}"
    g9 "Черт, дааа..."
    $ ccg2 = "herm_17"
    her "Твоей киске становиться приятно?"
    $ ccg1 = "luna_20"
    lun "Д-д-да...{image=textheart}"
    $ ccg1 = "luna_24"
    lun "Это плохо?"
    $ ccg2 = "herm_23"
    her "Нет!"
    $ ccg2 = "herm_24"
    her "Это совершенно естественно для тебя, возбуждаться от того, что тебя называют хорошей девочкой-"
    $ ccg1 = "luna_17"
    lun "А{image=textheart}А{image=textheart}Аааааа{image=textheart}"
    $ ccg2 = "herm_25"
    her "Прямо как твой {b}папочка{/b} говорил..."
    $ ccg1 = "luna_31"
    lun "{size=+10}!!!{/size}" 
    $ ccg1 = "luna_32"
    lun "Ммммм я думаю, я уже близо Гермиона!"
    g9 "Аргх!!! Я тоже!"
    menu:
        "-Кончить внутрь-":
            g9 "ПРИГОТОВЬСЯ ШЛЮШКА!"
            $ ccg1 = "luna_33"
            lun "Ч-ч-что?"
            $ ccg2 = "herm_26"
            her "Разве вы не собирались сделать это наружу [genie_name]?"
            g9 "ВОТ ТАК!!!"
            $ ccg2 = "herm_27"
            her "Видимо нет..."
            $ ccg1 = "luna_34"
            lun "Вы ведь не хотите..."
            g9 "АРГХ!!!"
            ">Твой член извергается внутри Полумны, выплескивая лавину твоей густой спермы в ее узенькую маленькую вульву."
            g9 "ДЕВЯТЬ БОГОВ!"
            $ ccg1 = "luna_35"
            lun "Это{image=textheart}я не могу{image=textheart}что{image=textheart}ааааааааааах{image=textheart}{image=textheart}{image=textheart}"
            $ ccg1 = "luna_36"
            lun "..."
            $ ccg2 = "herm_25"
            her "Ммммм, просто наслаждайся Полумна..."
            $ ccg2 = "herm_24"
            her "Будь {b}хорошей девочкой{/b}, для своего папочки и просто позволь ему до краев накачать тебя спермой..."
            $ ccg1 = "luna_37"
            lun "{image=textheart}Ах{image=textheart}"
            $ ccg2 = "herm_26"
            her "Ммммм"
            her "{b}Хорошая{/b}"
            $ ccg1 = "luna_36"
            lun "Ммммм{image=textheart}{image=textheart}"
            $ ccg2 = "herm_25"
            her "{b}Девочка{/b}"
            $ ccg1 = "luna_38"
            lun "Ах...{image=textheart}{image=textheart}{image=textheart}{image=textheart}"
            pause
            show screen blkfade
            with d3
            ">Этого было слишком жестко для Полумны, которая упала в обморок на твоем столе, сперма все еще вливалась в нее благодаря такому шикарному сексу."
        
        "-Кончить наружу-":
            g9 "ПРИГОТОВЬСЯ ШЛЮШКА!"
            $ ccg1 = "luna_33"
            lun "Ч-ч-что?"
            g9 "ПАПОЧКА КОНЧАЕТ!!!"
            $ ccg2 = "herm_24"
            her "Мммм... Сделайте это [genie_name]!"
            $ ccg1 = "luna_39"
            lun "Ах-ах-ах..."
            g9 "АРГХ!!!"
            ">Ты вытаскиваешь свой член в последнюю секунду, яростно надрачивая его, пока твоя густая сперма выстреливает, струю за струей."
            g9 "ДЕВЯТЬ БОГОВ!"
            $ ccg1 = "luna_40"
            lun "Это{image=textheart}я не могу{image=textheart}что{image=textheart}ааааааааааах{image=textheart}{image=textheart}{image=textheart}"
            $ ccg1 = "luna_41"
            lun "..."
            $ ccg2 = "herm_25"
            her "Ммммм, просто наслаждайся Полумна..."
            $ ccg2 = "herm_24"
            her "Будь {b}Хорошей девочкой{/b} для своего папочки и просто позволь ему покрыть себя его противной спермой..."
            $ ccg1 = "luna_42"
            lun "{image=textheart}Ах{image=textheart}не надо{image=textheart}называть{image=textheart}ее{image=textheart}противной...{image=textheart}{image=textheart}{image=textheart}"
            $ ccg2 = "herm_26"
            her "Ммммм"
            her "{b}Хорошая{/b}"
            $ ccg1 = "luna_43"
            lun "Мммм{image=textheart}{image=textheart}"
            $ ccg2 = "herm_25"
            her "{b}Девочка{/b}"
            $ ccg1 = "luna_44"
            lun "Ах...{image=textheart}{image=textheart}{image=textheart}{image=textheart}" 
            pause
            show screen blkfade
            with d3
            ">Все эти ощущения слишком огромны для Полумны, она падает в обморок на твоем столе, покрытая толстым слоем спермы."
    hide screen ccg
    hide screen blkfade 
    with d3
    call her_main("Я думаю, что вы сломали ее...","grin","wink") 
    m "Она в порядке..."
    m "Если я правильно помню, у тебя был аналогичный ответ и в первый раз..."
    call her_main("[genie_name]!","shock","happy") 
    m "В любом случае, ты можешь забрать ее в общую комнату?"
    call her_main("Мне нельзя в общую комнату Когтеврана...","base","glanceL") 
    call her_main("Думаю, мне придется отвести ее в свою комнату...","grin","down_raised") 
    m "Я уверен, что это единственная причина..."
    call her_main("Я не знаю, о чем вы говорите, сэр...","base","glanceL") 
    ">С помощью волшебной палочки Гермионы, одежда Полумны скользнула обратно на ее обнаженную фигуру."
    call her_main("Wingardium Leviosaaaaa!","open","happyCl") 
    ">Тело Полумны мягко поднимается в воздух, словно она была звездой волшебного шоу."
    call her_main("Ну, мне уже пора, [genie_name], становится немного поздно.","grin","happy") 
    m "Спокойной ночи, [hermione_name]."
    call her_main("Спокойной ночи, {size=-5}папочка{/size}...","grin","narrow") 
    ">Гермиона поворачивается и покидает кабинет, Полумна в бессознательном состоянии плывет по воздуху вслед за ней."

    jump luna_away
label luna_favour_8:
    jump luna_away
label luna_favour_9:
    jump luna_away
label luna_favour_10:
    jump luna_away
label luna_favour_11:
    jump luna_away
label luna_favour_12:
    jump luna_away
label luna_favour_13:
    jump luna_away
