label hat_intro:
    $ hat_known = True
    who2 "Эй."
    m "Что? Кто это сказал?"
    menu:
        "-Оглянуться-":
            ">Ты оборачиваешься и смотришь примерно в направлении голоса."
            m "Никого там нет..."
            who2 "..."
            who2 "Ты смотришь прямо на меня Дамблдор."
        "-Посмотреть под столом-":
            ">Ты бросаешь беглый взгляд под стол."
            m "Там нет никого..."
            who2 "......"
            who2 "Позади тебя."
            ">Ты оборачиваешься."
            g4 "Кто здесь?! {p} Покажись!"
            who2 "Ты смотришь прямо на меня Дамблдор."
    hat "Или я должна сказать, Джинн."
    g4 "(Говорящая шляпа!)"
    m "(Подожди, она может разговаривать? Это вообще нормально?)"
    m "Что ты хочешь...{p} шляпа?"
    hat "Я {size=+5}сортирующая{/size} шляпа, и я хочу поговорить."
    m "Что ж, продолжай, не похоже, что в этой комнате у меня есть более важные дела."
    hat "Итак, о том, что ты делал с Гермионой Грейнджер..."
    m "А, об этом, мммммм... Это не то, что-"
    hat "Я хочу."
    g4 "Что?"
    hat "Я хочу помочь тебе развратить другую девушку."
    m "Другую девушку?"
    hat "Ведь, сейчас уже не так весело возиться с девчонкой Грейнджер, она уже слишком развращена."
    m "Итак, что это для тебя значит, шляпа?"
    hat "Развлечение. Ты понимаешь, как скучно сидеть весь день в этой комнате, уставившись на стену и ничего не делать..."
    m "..."
    hat "О, да... Тогда ты должен оценить мое предложение, как тебе отбить скуку."
    m "И как ты планируешь \'развратить девочку\' лежа на полке?"
    hat "Я сортирующая шляпа, я сортирую людей."
    m "..."
    m "И как это может помочь?"
    hat "Ну, обычно меня в начале года одевают на головы студентов."
    hat "Затем я читаю их личность, используя Legilimency чтобы решить, в какой факультет их отправить."
    m "И как это нам поможет?"
    hat "Ну, я могу делать больше, чем просто читать личности, я могу изменять их."
    g9 "Правда?"
    hat "Ну, я имею в виду в теории... Настоящий Дамблдор никогда не позволял мне попробовать. Даже на \"себе\"."
    g9 "Так ты говоришь, что если я приведу сюда студентку, ты сможешь сделать из нее все, что я захочу?"
    hat "В какой-то степени."
    m "Что это значит?"
    hat "Я могу изменить, качества, присущие их факультетам, и их личности изменятся в соответствии с этим, но я не могу полностью изменить человека."
    m "Таким образом, мне придется сделать всю тяжелую работу?"
    hat "Если ты называешь сексуальное изнасилование подростков тяжелой работой..."
    m "Я подумаю об этом."
    hat "Давай, я уверена, у тебя будет достаточно времени, чтобы все обдумать, пока ты будешь сидеть один..."
    hat "Но... {p}если хочешь по-настоящему повеселиться, пригласи эту девочку мисс Грейнджер, и пусть она приведет одну из своих распутных подружек."
    hat "И тогда наденьте меня на ее голову, и мы повеселимся."
    hat "До тех пор..."
    m "Что?"
    hat "{size=+5}z{/size}{size=+4}z{/size}{size=+3}z{/size}{size=+2}z{/size}{size=+1}z{/size}"
    m "Ох..."
    return

    

label hat_intro_2: #Bringing in Hermione
    m "[hermione_name], я хотел поговорить с тобой кое о чем."
    call her_main("О чем, [genie_name]?","open","base") 
    m "Ты чувствуешь, что кто-либо из твоих друзей находится в неправильном факультете?"
    call her_main("Что вы имеете в виду, под неправильным факультетом?","soft","base") 
    m "Ты знаешь кого-нибудь, кто добьется больших успехов сменив факультет?"
    call her_main("Это странный вопрос, [genie_name].","open","base") 
    call her_main("Я полагаю, что Невилл Долгопупс не очень смелый, может быть, ему было бы лучше в \"Пуффендуе\"...","open","suspicious") 
    m "(Возможно, нужен кто-то другой....)"
    m "Кто-нибудь еще приходит на ум?"
    call her_main("Не думаю...","open","worriedL") 
    m "Ну ладно, просто-"
    call her_main("Подождите, я знаю! Полумна Лавгуд!","scream","angryCl") 
    m "И почему?"
    call her_main("Ну конечно, вы видели ее оценки [genie_name]...","open","closed") 
    call her_main("Достаточно сказать, едва ли она \"Когтевранка\". Вероятно, она лучше подходит для \"Пуффендуя\".","annoyed","suspicious") 
    m "Фантастика. Не могла бы ты попросить ее прийти ко мне в кабинет сегодня вечером?"
    call her_main("Зачем? Вы же не собираетесь просить ее об услугах?","annoyed","annoyed") 
    m "Ничего подобного. Это чисто школьные дела."
    call her_main("...","annoyed","annoyed") 
    call her_main("Прекрасно... Просто не делайте ничего плохо...","annoyed","suspicious") 
    m "Честью бойскаутов!"
    call her_main("Ну, если это все, то [genie_name], мне лучше пойти в класс.","open","closed") 

    jump end_hg_pf

label hat_intro_3: #Luna change scene 
    $ luna_hair = 2
    call play_sound("стук") 
    "*тук* *тук* *тук*"
    lun "Это Полумна Лавгуд, сэр..."
    m "Заходи, заходи..."
    call play_sound("door") 
    ">Полумна стоит перед тобой."
    $ luna_chibi("stand")
    call luna_main("Гермиона сказала, что вы хотели меня видеть?", 1, 2, 1, 2) 
    m "Да. Речь идет о вашем факультете."
    call luna_main("Когтевран?", 1, 1, 5, 2) 
    m "Да. Недавно я разговаривал с сортировочной шляпой, и я обеспокоился тем, что она, возможно, пару лет назад ошиблась при распределении на факультеты."
    call luna_main("На самом деле? Так что мне придется поменять факультет?", 1, 1, 4, 3) 
    m "Конечно же, нет!"
    call luna_main("*Фух*!", 2, 1, 1, 1) 
    m "Я хотел надеть шляпу на твою голову, чтобы убедиться, что она сделала правильный выбор."
    call luna_main("А, ну ладно!", 1, 2, 1, 1) 
    ">Ты поворачиваешься и тянешься к шляпе."
    m "Почти... Просто ухватить за краешек..."
    hat "Осторожно!"
    ">Ты тянешь тяжелую шляпу со шкафа."
    hat "*Псс*{size=-5}Отличная работа! Теперь просто положи меня ей на голову.{/size}"
    m "А вот, мисс Лавгуд..."
    ">Ты осторожно одеваешь шляпу ей на голову."
    call luna_main("...", 1, 2, 1, 3) 
    call luna_main("Это-", 1, 2, 5, 3) 
    hat "{size=+5}Хммм, {/size}да... {size=-5}Да...{/size} Я вижу. Весьма интересно... {size=+5}Очень{/size}{p} {size=+5}Интересно...{/size}"
    call luna_main("Что интересного?", 1, 1, 5, 2) 
    hat "Что? А ничего, ничего. Просто закрой глаза, постарайся немного поспать..."
    call luna_main("Поспать?", 6, 2, 5, 2) 
    call luna_main("Почему я... хочу{p}...", 3, 1, 4, 2) 
    call luna_main("...", 1, 6, 4, 2) #hypno eyes
    m "Она в порядке?"
    hat "Она в порядке. Просто немного отдохнет. Теперь об ее личности..."
    hat "О да... Хммм, {p}хорошо, полагаю, это может сработать ..."
    hat "{size=-5}Да... уверена, что Салазар был бы горд...{/size}"
    hat "Еще немного...."
    call luna_main("...", 1, 6, 4, 2) #hypno eyes
    call luna_main("...", 1, 6, 1, 2) #hypno eyes
    $ luna_unlocked = True
    call luna_main("...", 1, 6, 1, 2) #hypno eyes
    m "Подожди, что случилось?! Ее глаза изменили цвет!"
    hat "Правда? Хммм... не ожидала, что... и какого они цвета?"
    m "Зеленые."
    hat "Ну, это кажется довольно логичным."
    m "Почему, что ты сделала с ее личностью?"
    hat "Не много, просто сделала его немного больше похожим на змею..."
    m "Что дальше?"
    hat "Ну, кажется она, становится немного... не в себе..."
    hat "Вероятно, в твоих интересах отправить ее в свою комнату и дать ей выспаться."
    m "Она сможет меня услышать?"
    hat "Да, она довольно... в ясном состояние..."
    ">Ты снимаешь шляпу с головы Полумны."
    m "Большое спасибо, мисс Лавгуд. Думаю, тебе лучше пойти спать. "
    call luna_main("Да... постель...", 1, 6, 1, 2) #hypno eyes
    hide screen luna_chibi
    hide screen luna
    with d3
    $ luna_wear_acc = False
    $ luna_hair = 1
    ">Ты кладешь шляпу на шкаф"
    m "Так что ты сделала с ее личностью?"
    hat "Сейчас... нет смысла портить веселье. Придется подождать..."
    m "Хммм"
    $ luna_busy = True
    ">Теперь Полумну можно вызывать!"
    
    return




###Need another intro event here, introducing Luna and setting up the favour selling stuff.

