# TODO: Translation updated at 2018-11-09 09:09

# game/__Renpy__/Main_Night.rpy:132
translate russian night_resume_961bc74b:

    # ">Повышение уровня развращенности Гермионы без каких-либо публичных заданий, заблокирует вашу игру на определенной концовке."
    ">Повышение уровня развращенности Гермионы без каких-либо публичных заданий, заблокирует вашу игру на определенной концовке."

# game/__Renpy__/Main_Night.rpy:133
translate russian night_resume_4f17f839:

    # ">Это сообщение будет повторяться до тех пор, пока вы не увеличите уровень ее развращенности или не выполните определенное количество публичных заданий!"
    ">Это сообщение будет повторяться до тех пор, пока вы не увеличите уровень ее развращенности или не выполните определенное количество публичных заданий!"

translate russian strings:

    # __Renpy__\Main_Night.rpy:135
    old "-Не учи, ученого!-"
    new "-Не учи, ученого!-"

