# TODO: Translation updated at 2018-11-09 09:09

# game/__Renpy__/Main_Day.rpy:259
translate russian day_resume_961bc74b:

    # ">Повышение уровня развращенности Гермионы без каких-либо публичных заданий, заблокирует вашу игру на определенной концовке."
    ">Повышение уровня развращенности Гермионы без каких-либо публичных заданий, заблокирует вашу игру на определенной концовке."

# game/__Renpy__/Main_Day.rpy:260
translate russian day_resume_4f17f839:

    # ">Это сообщение будет повторяться до тех пор, пока вы не увеличите уровень ее развращенности или не выполните определенное количество публичных заданий!"
    ">Это сообщение будет повторяться до тех пор, пока вы не увеличите уровень ее развращенности или не выполните определенное количество публичных заданий!"

# game/__Renpy__/Main_Day.rpy:341
translate russian day_main_menu_6b99fca0:

    # m "Уже темнеет..."
    m "Уже темнеет..."

# game/__Renpy__/Main_Day.rpy:342
translate russian day_main_menu_0d5cbab1:

    # m "Я пропустил целый день, осматривая эту комнату?"
    m "Я пропустил целый день, осматривая эту комнату?"

translate russian strings:

    # __Renpy__\Main_Day.rpy:262
    old "-Понятно-"
    new "-Понятно-"

    # __Renpy__\Main_Day.rpy:262
    old "-Не учи ученого!-"
    new "-Не учи ученого!-"

