# TODO: Translation updated at 2018-11-09 09:10

translate russian strings:

    # script.rpy:832
    old "Все в порядке, мне уже есть 18 лет!"
    new "Все в порядке, мне уже есть 18 лет!"

    # script.rpy:832
    old "Мне нету 18 (да кто в здравом уме, сюда жмакнет?)"
    new "Мне нету 18 (да кто в здравом уме, сюда жмакнет?)"

    # script.rpy:843
    old "Да, меня не задевают подобные ...измы!"
    new "Да, меня не задевают подобные ...измы!"

    # script.rpy:843
    old "Выпусти меня немедленно, супостат!!!"
    new "Выпусти меня немедленно, супостат!!!"

