

### EVENT 0 ###

#First event in the game. Gennie finds himself at the desk.
label event_01: 
    call bld 
    m "..................?"
    m "Ваше величество?"
    m "......................................................."
    g4 "Я сделал это снова, не так ли?"
    g4 "Телепортировался неизвестно куда..."
    m "Что с этими ингредиентами?"
    m "Они оказались сильнее, чем я думал."
    m "Что бы это ни было, мне здесь делать нечего..."
    m "Лучше отменить заклинание и вернуться в свою магическую лавку, пока принцесса Жасмин, снова не разозлилась на меня..."
    m "....................."
    m "Хотя..."
    m "В этом месте есть что-то странное... это..."
    m "Оно почти переполнено...."
    g4 "{size=+5}МАГИЕЙ?!{/size}"
    m "Да... магия, я чувствую это. Такая мощная и все же, каким-то образом..."
    m "....чуждая."
    m "Интересно..."
    m "Думаю, останусь здесь ненадолго...."
    hide screen bld1
    with d3
    return


### EVENT 1 ###

#First time genie meets snape
label event_00:
    call play_music("dark_fog") 
    call play_sound("door") 

    call sna_chibi("stand","door","base") 
    with d3
    pause.3

    call bld 
    g4 "{size=-3}(Это форма жизни, коренного населения?!){/size}"
    hide screen bld1

    $ tt_xpos=650
    $ tt_ypos=180
    show screen thought 
    with d3
    pause 1

    call bld 
    m "{size=-3}(Достаточно похож на человека...){/size}"
    m "{size=-3}(Может, если я не буду обращать на него внимание, он уйдет...?){/size}"
    hide screen bld1
    hide screen thought 
    with d3
    
    call sna_walk("door","mid",4) 
    pause.2

    show screen bld1
    call sna_main("","snape_01",xpos="base",ypos="base") 
    call ctc 

    who2 "Альбус... У тебя есть минутка?"
    hide screen snape_main
    
    menu:
        m "..."
        "\"Вообще-то, я немного занят.\"":
            call sna_main("","snape_04") 
            who2 "Ну, разве ты не всегда занят, Альбус?"
        "\"Конечно. Что это?\"":
            pass
        "\"И альбус тебе тоже.\"":
            call sna_main("","snape_05") 
            who2 "Что?"
            call sna_main("","snape_04") 
            who2 "Альбус, я не в настроении для твоих... шуточек."
        "\"Отведи меня к своему предводителю.\"":
            call sna_main("","snape_01") 
            who2 "Что?"
            who2 "Хм...?"
            who2 "Ты имеешь в виду министра магии?"
            call sna_main("","snape_03") 
            who2 "Я бы предпочел избежать без особой необходимости иметь дело с этими бюрократами..."
            hide screen snape_main
            with d3
            m "Хорошо, не важно... Как я могу помочь?"
            
    call sna_main("","snape_06") 
    who2 "Мне нужно обсудить с тобой, кое-что важное..."
    who2 "Я думаю, нам нужно пересмотреть нашу политику допуска." 
    hide screen snape_main
    with d3
    m "................?"
    call sna_main("","snape_03") 
    who2 "Половина моих... так называемых \"учеников\" ничего, но раздражают бездари. Это делает мою жизнь несчастной."
    hide screen snape_main
    with d3
    m "................"
    call sna_main("","snape_06") 
    who2 "Большинство из них принадлежат вашему драгоценному \"Гриффиндору\"..."
    hide screen snape_main
    with d3
    m "......?"
    call sna_main("","snape_03") 
    who2 "Жалкая семья Уизли, шумная девочка Грейнджер и, конечно, герой всех несовершеннолетних правонарушителей по всему миру...."
    call sna_main("","snape_08") 
    who2 "{size=+3}Мальчик-Поттер!{/size}"
    call sna_main("","snape_01") 
    who2 "Запомни мои слова, Альбус. \"Гриффиндорский факультет\" станет пагубным для этой школы!"
    hide screen snape_main
    with d3
    m "...................."
    call sna_main("","snape_01") 
    who2 "Ничего, кроме надоедливых бездарей, их много!"
    call sna_main("","snape_06") 
    who2 "И если этого было недостаточно, то теперь они распространяют всякие гадкие слухи об учителях!"
    who2 "Особенно о твоем покорном слуге..."
    hide screen snape_main
    with d3
    m "......................"
    call sna_main("","snape_05") 
    who2 "Ты не веришь в эти слухи, Альбус?"
    hide screen snape_main
    with d3

    menu:
        m ".............."
        "\"Конечно, нет!\"":
            call sna_main("","snape_09") 
            who2 "Хорошо..."
            who2 "Ты хорошо меня знаешь. Я бы не опустился до такого..."
        "\"Нет дыма без огня\"":
            call sna_main("","snape_10") 
            who2 "Альбус?! Ты серьезно!"
            who2 "Это не что иное, как грязная ложь, заявляю тебе официально!"

    hide screen snape_main
    with d3
    m "........................."
    call sna_main("","snape_04") 
    who2 "Эти жалкие детишки измотали меня в конец. Думаю, за сегодня я заслужил отдых."
    call sna_main("","snape_09") 
    who2 "................"
    
    stop music fadeout 1.0
    
    hide screen snape_main
    with d3
    hide screen bld1

    call sna_walk("mid","leave",3) 
    call bld 

    m "Хм..."
    m "Так... Этот высокий, задумчивый чувак принял меня за кого-то...?"
    m "Это значит, что я видимо, окутан заклинанием сокрытия..."
    m "........."
    m "В общем, я Джинн, замаскированный под человека, который, в свою очередь, замаскирован под другого человека..."
    m "Нет, получается такая глупость..."
    #a4 "Shut it! Nobody understands a true genius. (Заткнись! Никто не понимает истинного гения.)"
    
    $ days_without_an_event = 0

    $ mQuest_A.counter = 1 #Main Quest Milestone!
    call update_quests 

    jump day_start


### EVENT 2 ###

#owl event
label event_02:
    $ letters += 1 #Adds one letter in waiting list to be read. Displays owl with envelope.
    call play_sound("owl") 
    show screen owl
    call bld 
    m "Что? Сова?"
    hide screen bld1
    with d3

    $ mQuest_A.counter = 2 #Main Quest Milestone!

    return


### EVENT 3 ###

#Sanpe talks to genie about hermione, snape becomes suspicious
label event_03: 
    call play_music("dark_fog") 
    call play_sound("door") 

    call sna_walk("door","mid",2) 
    call bld 

    m "{size=-3}(Опять, этот задумчивый мужик...){/size}"
    call sna_main("","snape_01",xpos="base",ypos="base") 
    who2 "Альбус!"
    m "Эй.......... ты..."
    who2 "Ты должен что-то сделать с этой девчонкой Грейнджер..."
    call sna_main("","snape_06") 
    who2 "Честно... У меня заканчиваются способы воздействия, эта... эта..."
    call sna_main("","snape_04") 
    who2 "Эта маленькая ведьма!"

    menu:
        m "..."
        "\"Грейнджер? Гермиона Грейнджер, верно?\"":
            who2 "Да, она..."
            who2 " Она тоже входит в \"группировку Поттера\"."
        "\"Я тебя прикрою, Джек, ведьмы сошли с ума!\"":
            who2 "Что...? Альбус вы ведете себя странно в последнее время."
            who2 "Все в порядке?"
            menu:
                m "..."
                "\"Я в порядке. Продолжай.\"":
                    who2 "Как скажите..."
                "\"Ты же меня знаешь. Я люблю розыгрыши.\"":

                    who2 "Хм....."

        "\".....................................................\"":
            pass 

    who2 "Помнишь, те времена когда за проступки студентов прилюдно пороли?"
    who2 "Клянусь, если бы мы могли это вернуть, оно решило бы все наши проблемы..."
    who2 "Да... Я бы с удовольствием привязал эту девушку к столбу для порки перед всей школой..."
    call sna_main("","snape_20") 
    who2 "Затем поднял ее юбку, и....."
    call sna_main("","snape_12") 
    who2 "*Кхем!* К сожалению, в настоящее время мы, преподаватели, строго ограничены в дисциплинарных мерах, которые мы имеем в своем распоряжении..."
    who2 "Я знаю, что ты так же бессилен, как и я в этом вопросе, но я заявляю тебе, этой девушке лучше перестать испытывать мое терпение."

    menu:
        m "..."
        "\"Я позабочусь об этой маленькой шлюшке!\"":
            call sna_main("","snape_05") 
            who2 "...?!"
            who2 "Альбус..."
            who2 "Ты ведешь себя странно в последнее время..."
        "\"Никто никогда не говорил, что будет легко.\"":
            call sna_main("","snape_06") 
            who2 "Иногда мне кажется, что я предпочел бы иметь дело с классом, полным Дементоров..."
        "\"Завтра тебе станет лучше.\"":
            call sna_main("","snape_06") 
            who2 "Ты, наверное, прав..."

    who2 "Хм..."
    call sna_main("","snape_06") 
    who2 "Возможно, мне лучше пойти поспать."
    who2 "Я должен быть в отличной форме каждое утро..."
    who2 "Ты не можешь показать слабость этим детям, иначе они сожрут тебя со всеми потрохами..."
    call sna_main("","snape_24") 
    who2 "Спокойной ночи, Альбус."
    
    
    hide screen snape_main
    hide screen bld1
    with d3

    call sna_walk("mid","door",3) 
    pause.2

    who2 "................."

    hide screen snape_01_f
    show screen snape_01 #Snape stands still.
    with d3
    pause.2

    who2 "И еще одна вещь..."
    show screen bld1
    show screen snape_main
    with d3
    who2 "Ты не должен воспринимать серьезно слухи, которые ты услышишь обо мне и девочках из Слизерина..."
    hide screen snape_main
    with d3
    m "Заметано"

    hide screen bld1
    hide screen snape_01
    show screen snape_01_f #Snape stands still.
    with d3
    pause.2

    call play_sound("door") 
    hide screen snape_01_f #Snape stands still.
    with d3
    pause.5

    $ mQuest_A.counter = 3 #Main Quest Milestone!
    
    jump day_start

#NOT IN USE
label event_04:
    return

### EVENT 5 ###

#Snape comes in, has a talk with Genie, then the duel starts.
label event_05: 
    call play_music("dark_fog") 
    call play_sound("door") 
    
    call sna_walk("door","mid",2) 
    call bld 

    call sna_main("","snape_01",xpos="base",ypos="base") 
    call ctc 

    who2 "Добрый вечер, Альбус."
    who2 "Я хочу снова поговорить с тобой об этих проклятых детях..."
    who2 "Но сначала я хочу спросить тебя кое о чем..."
    call sna_main("","snape_05") 
    who2 "Ты заметил, что-то странное, происходящее здесь в последнее время?"

    menu:
        m "..."
        "{size=-2}\"Как ты, особенно ноешь?\"{/size}":
            who2 "Что? Н-но... Эти дети..."
            call sna_main("","snape_06") 
            who2 "Ну, может быть, ты прав..."
        "{size=-2}\"Эта сова принесла мне почту, мужик!\"{/size}":
            who2 "Сова? Что с ней?"
            call sna_main("","snape_25") 
            who2 "Это не то, что я имею в виду..."
            call sna_main("","snape_29") 
            who2 "Ну, ничего страшного..."
        "{size=-2}\"Да нет. Все как всегда.\"{/size}":
            who2 "Хм... Может, я просто параноик..."

    call sna_main("","snape_24") 
    who2 "Причина, почему я здесь сегодня, \"группировка Поттера\""
    call sna_main("","snape_01") 
    who2 "Есть много вещей, за которые можно вычесть у Гриффиндора очки, ты же знаешь... "
    who2 "И мисс Грейнджер возглавляет этот список..."
    call sna_main("","snape_06") 
    who2 "Она практически не дает мне покоя."
    call sna_main("","snape_05") 
    who2 "Кстати говоря, в последнее время она тебе не присылала письма?"

    menu:
        m "..."
        "\"Гермиона Грейнджер? Нет, от нее ничего нет.\"":
            who2 "Ясно... Значит, она тогда блефовала."
            call sna_main("","snape_16") 
            who2 "Какая настырная ведьма."
        "\"Да... Каждый чертов день...\"":
            who2 "Действительно?"
            who2 "В частности, есть обо мне какая-нибудь ложь?"
            who2 "Надеюсь, ты знаешь лучше, как реагировать на подобные сплетни..."
    
    call sna_main("","snape_03") 
    who2 "Она бы никогда не призналась, но я знаю, что она распространяла эти гадкие слухи обо мне по всей школе..."
    call sna_main("","snape_29") 
    who2 "Гхт... (говорит шепотом).... ведьма."
    call sna_main("","snape_09") 
    who2 "Я бы никогда не опустился так низко, чтобы торговать факультетскими очками в обмен на сексуальные услуги..."
    who2 "Конечно, мы используем очки факультета, чтобы мотивировать студентов, но это совсем другое..."
    who2 "Я не могу говорить за остальной персонал, хотя..."
    call sna_main("","snape_13") 
    who2 "Истории, которые я слышу о Минерве МакГонагалл и тех бедных первокурсниках Гриффиндора, могут быть правдой..."
    call sna_main("","snape_01") 
    who2 "Ну, я просто хотел убедиться, что ты принимаешь эти слухи обо мне такими, какие они есть..."
    who2 "Мерзкая ложь, придуманная кучкой избалованных детей."
    

    who2 "О.... Прежде чем я уйду..."
    who2 "Есть одна вещь, о которой я сейчас хотел спросить тебя..."
    call sna_main("","snape_09") 
    who2 "........................."
    call sna_main("","snape_05") 
    who2 "Как меня зовут?"

    menu:
        m "..."
        "\"Что? Что за вопрос?\"":
            call sna_main("","snape_06") 
            who2 "Ты прав..."
            who2 "Прости... Я полагаю, я просто параноик..."
            call sna_main("","snape_05") 
            who2 "Но ты никогда не можешь быть слишком осторожным со слухами о  \"ты сам знаешь, ком\" он все еще жив..."
        "\"Высокий задумчивый парень?\"":
            call sna_main("","snape_06") 
            who2 "Альбус, в последнее время ты приобрел своеобразное чувство юмора, которое меня не волнует ни в малейшей степени..."
            who2 "Может, тебе стоит проводить немного меньше времени в компании этого большого болвана Хагрида."
        "-\{Использовать магию, чтобы получить правильный ответ\}-":
            $ d_flag_01 = True
            hide screen snape_main
            with d3
            call blktone 
            ">Ты используешь свои феноменальные космические силы, чтобы заглянуть в саму ткань Вселенной и получить правильный ответ."
            call hide_blktone 
            call sna_main("","snape_03") #SNAPE
            who2 "?!!"
            m "Что это за вопрос, Северус?"
            who2 "Прости... Я полагаю, я просто параноик..."

    call sna_main("","snape_06") 
    who2 "Ну, спокойной ночи, Альбус."
    hide screen snape_main
    hide screen bld1

    call sna_walk("mid","door",3) 
    pause.2
   
    stop music fadeout 1.0
    who2 "........................"

    hide screen snape_01
    hide screen snape_01_f
    hide screen bld1
    hide screen snape_main

    show screen blkfade
    with d3

    $ renpy.play('sounds/07_run.mp3') 
    pause 2
    g4 "???"
    
    show screen snape_defends
    call hide_blkfade 
    show screen ctc
    
    call play_music("hitman") #TENSE THEME
    
    call ctc 

    call bld 

    if d_flag_01:
        sna_[6] "Кто ты, сволочь!"
        g4 "Что? Это я... Абиус! Я имею в виду, Альбус!"
        sna_[4] "Ты не обманешь меня."
        sna_[4] "Только что ты использовал какую-то инородную магию!"
        sna_[6] "Покажи мне свою истинную сущность, дьявол! Кто ты такой?!"
    else:
        sna_[1] "Меня зовут Северус Снейп!"
        sna_[1] "Теперь, ты скажешь, кто ты...!"
        
    g4 "!!!"
    sna_[1] "Полегче... Просто ответь на мой вопрос."
    m "Хорошо, хорошо. Просто успокойся, хорошо?"
    sna_[1] "........"

    $ d_points = 0
    $ d_flag_01 = False
    $ d_flag_02 = False
    $ d_flag_03 = False

    label no_wait:
    menu:
        m "..."
        "\"Я тебе не враг.\"" if not d_flag_01:
            $ d_flag_01 = True
            $ d_points +=1
            sna_[1] "Это первое, что говорит враг."
        "\"Я всего лишь турист. Я сейчас же уйду отсюда.\"" if not d_flag_02:
            $ d_flag_02 = True
            $ d_points +=1
            sna_[1] "Ты никуда не пойдешь."
        "\"Я работаю на Альбиса Думбледора!\"" if not d_flag_03:
            $ d_flag_03 = True
            $ d_points +=1
            sna_[1] "Это Альбус Дамблдор, придурок!"

    if d_points == 2:
        pass
    else:
        jump no_wait

    sna_[1] "Кто послал тебя сюда? Что ты сделал с настоящим Альбусом?"
    sna_[1] "Сбрось свою маскировку и немедленно покажи свою истинную сущность, это мое последнее предупреждение!"

    $ d_points = 0
    $ d_flag_01 = False
    $ d_flag_02 = False
    $ d_flag_03 = False

    label no_wait_2:
    menu:
        m "..."
        "\"Я не могу. Это трудно объяснить...\"" if not d_flag_01:
            $ d_flag_01 = True
            $ d_points +=1
            sna_[1] "Меня не интересуют твои объяснения. Я не поверю, ни единому твоему слову!"
        "\"Перестань угрожать мне, человек!\"" if not d_flag_02:
            $ d_flag_02 = True
            $ d_points +=1
            sna_[1] "\"Человек\"?"
            sna_[1] "Ты намекаешь, что ты {size=+5}не{/size} человек?"
            sna_[1] "Тогда кто ты такой?! Развей свое колдовство маскировки немедленно!"
        "\"Я не причиню тебе вреда, клянусь!\"" if not d_flag_03:
            $ d_flag_03 = True
            $ d_points +=1
            sna_[1] "Так ли это?"
            sna_[1] "Докажи тогда это. Развей сейчас же, свою магию маскировки!"

    if d_points == 2:
        pass
    else:
        jump no_wait_2
            
    sna_[1] "Я услышал достаточно!"
    g4 "О великие пески пустыни! Ты позволишь мне объяснить, человек?!"
    sna_[1] "Больше нечего объяснять!"
    sna_[1] "Поскольку ты отказываешься сотрудничать, я возьму тебя под стражу силой!"
    g4 "Что?! Подожди!"
    
    if skip_duel == True:
        jump snape_lost
    
    stop music 
    call play_music("boss_theme") 
    call play_sound("glass_break") 

    pause.1


    show screen snape_glass
    pause 3

    hide screen genie
    hide screen snape_defends

    $ mQuest_A.counter = 5 #Main Quest Milestone!
    call update_quests 

    jump duel


### EVENT 6 ###

#THE TALK AFTER THE DUEL ENDS.
label event_06: 
    $ potions = 0 #Makes sure there are no potions left in the possessions. 
     
    stop music fadeout 2.0

    g4 "*Задыхаясь*"
    g4 "Готов сейчас поговорить?!"
    sna_[8] "(...н-невозможно...)"
    
    call play_music("dark_fog") 
    
    hide ch_gen
    show image "images/dueling/snape/no_magic.png" at Position(xpos=690, ypos=250, xanchor="center", yanchor="center") 
    
    m "Я говорил тебе, что ты мне не ровня..."
    call bld 

    m "Но ты дал мне хороший бой со своими способностями..."
    sna_[1] "То, как ты колдуешь заклинания голыми руками..."
    sna_[1] "Ни один человек не может делать это... кто-"
    sna_[4] "{size=+5}Кто же ты?{/size}"
    sna_[1] "Какая-то форма демона призванная \"тем-чье-имя-нельзя-называть\"?"
    m "Призваная кем?"
    sna_[2] "Сам \"знаешь, кем\"!"
    m "Что?"
    sna_[7] "......................"
    m "............................"
    m "Послушай, я не демон..."
    m "И я уверен, что, черт возьми, не призван \"Я даже не знаю, кем\"!"
    sna_[1] "............................."
    m "Я был эм..."
    m "...Проводил эксперимент в своем мире, во время которого что-то пошло не так, и я оказался здесь."
    m "Вот и все..."
    sna_[1] ".........................."
    sna_[1] "Что тогда стало с настоящим Альбусом Дамблдором?"
    m "Я уверен, что он в порядке."
    m "Он, наверное, удивлен, оказавшись в моем мире, как и я, что оказался здесь..."
    sna_[1] "...................................."
    sna_[1] "Когда это произошло?"
    m "Четыре дня назад..."
    sna_[1] "Ты можешь вернуться?"
    m "Думаю, да..."
    sna_[2] "Почему же ты тогда здесь?"
    m "Не уверен..."
    m "Магия этого мира такая странная... Возможно, мне просто стало любопытно."
    sna_[1] "..................."
    sna_[1] "Тебе нужно это исправить..."
    m "Исправить что?"
    sna_[4] "Все. Ты должен вернуть Альбуса и покинуть наш мир."

    menu:
        m "..."
        "\"Да, да, я знаю. Тогда я ухожу.\"":
            m "Да, да, я знаю..."
            m "Что ж, тогда мне пора уходить. Извините за беспокойства."
            sna_[1] "Никакого беспокойства..."
        "\"Но мне здесь нравится! Я могу остаться?\"":
            sna_[1] "Абсолютно нет."
            sna_[1] "Кто бы ты ни был, ты не из этого мира бытия."
            sna_[1] "Твое присутствие здесь, нарушает естественный порядок вещей."
            sna_[1] "И сейчас этой школе как никогда, нужен хороший директор."

    sna_[1] "Счастливого пути домой."
    m "Эм... Спасибо, мистер. Северус. Удачи тебе с твоими студентами и \"группировкой Поттера\"."
    sna_[1] "\"Группировкой Поттера\"?"
    sna_[7] "О, точно, эти педики..."

    menu:
        "-Отменить заклинание-":
            pass
    menu:
        "-Отменить заклинание-":
            pass
    menu:
        "-Отменить заклинание-":
            pass

    sna_[1] "Это сработало? Альбус, это правда ты?"

    menu:
        m "..."
        "\"Да, это я. Так хорошо вернуться!\"":
            sna_[1] "Рад, что ты вернулся, старый друг. Ты в порядке?"
            m "Я в порядке, Северус, спасибо."
            sna_[1] "Как это было, в том другом мире?"
            m "Много песка и очень жарко, но в остальном довольно приятно."
            sna_[1] "Я вижу... Ты скучал по своему брату?"
            menu:
                m "..."
                "\"Да, я так по тебе скучал!\"":
                    sna_[1] "......................."
                    sna_[1] "Да, точно...."
                "\"У меня нет брата, Северус.\"":
                     sna_[1] "........................"
                     sna_[1] "Может, у тебя и нет, но настоящий Альбус Дамблдор знает."
                "-Использовать магию, чтобы получить правильный ответ-":
                    call bld 
                    ">Ты используешь свои феноменальные космические силы, чтобы заглянуть в саму ткань Вселенной и получить правильный ответ."
                    hide screen bld1
                    with d3
                    m "Мой младший брат Аберфорт? Почему я скучаю по нему?"
                    sna_[1] "Я чувствую это, когда ты используешь свою чужеродную магию..."

        "\"Нет. Это все еще я. Не-человеческий парень.\"":
            pass

    sna_[1] "Почему ты все еще здесь, тварь?"
    m "Я не уверен... Я пытался отменить заклинание, но ничего не произошло..."
    sna_[7] "Невероятно..."
    sna_[1] "Что это означает? Что ты останешься здесь навсегда?"
    m "Конечно, нет..."
    m "Мое присутствие здесь вообще возможно только потому, что заклинание компенсирует дисбаланс, вызванный самим собой..."
    m "Созданное заклинание со временем пройдет, и я вернусь в свой мир."
    m "Точно так же ваш друг-Дамблдор будет возвращен сюда."
    sna_[1] "Я вижу..."
    sna_[1] "Как скоро заклинание пройдет?"

    menu:
        m "..."
        "\"Через пару дней.\"":
            sna_[1] "Я понял..."
        "\"Неделю или около того...\"":
            sna_[1] "Хм.... Неделю, да..."
        "\"Возможно месяцы...\"":
             sna_[1] "Так долго?"
             sna_[1] "Теперь это не так \"отлично\"?"
        "\"Я понятия не имею...\"":
            sna_[1] "....................."
            sna_[2] "Блестяще..."

    m "Хорошо, честно говоря, я не уверен, как вернуться..."
    m "Все это время я думал, что я могу отменить заклинание, когда я захочу..."
    sna_[1] "..................................................."
    sna_[1] ".................................."
    sna_[1] "..................."
    m "Снейп?"
    sna_[1] "..................................................."
    m "Северус?"
    sna_[6] "Да-да..."
    sna_[1] "Слушай, уже очень поздно, и день был слишком напряженным..."
    sna_[7] "Мне нужно все это обдумать."
    sna_[1] "Я приду к тебе завтра, после уроков."
    sna_[6] "До тех пор держи свою истинную личность и наш разговор в секрете, хорошо?"
    m "Без проблем."
    sna_[1] "Тогда ладно..."
    sna_[1] "Но прежде чем я уйду, у меня есть еще один вопрос..."
    m "Я слушаю..."
    sna_[2] "........"
    sna_[1] "Если ты не человек, тогда..."
    sna_[7] "Кто ты такой?"
    m "...Я Джинн."
    sna_[1] "Джинн?"
    m "Да, я обладаю феноменальными космическими способностями и все такое..."
    sna_[1] "Серьезно?"
    m "О, да."
    sna_[1] "Невероятно..."
    sna_[1] "Что ж, увидимся завтра.... Джинн."
    m "Я буду ждать здесь..."

    sna_[7] "(Джинн? Это что-то новенькое...)"

    $ mQuest_A.counter = 6 #Main Quest Milestone!
    call update_quests 
    hide screen duel

    jump day_start

#THE TALK WITH SNAPE THE DAY AFTER THE DUEL.
label event_07: 
    call play_music("dark_fog") 
    call play_sound("door") 
    
    call sna_walk("door","mid",2) 
    call bld 

    call sna_main("","snape_01",xpos="base",ypos="base") 
    show screen ctc
    with d3

    sna "..................."
    hide screen snape_main
    with d3
    m "Добрый вечер..."
    show screen snape_main
    with d3
    sna "Заклинание все еще действует?"
    hide screen snape_main
    with d3
    m "Да. Оно оказалось очень стабильным."
    show screen snape_main
    with d3

    sna "Ясно..."
    sna "Прошлой ночью. Меня посетило несколько мыслей..."
    sna "И я думаю, что придумал решение..."
    m "Серьезно? Отлично! Я слушаю."
    hide screen snape_main
    with d3

    call sna_main("Давай просто подождем...","snape_29") 
    m "Прости?"
    call sna_main("А что еще мы можем сделать?","snape_06") 
    sna "Обычно я предупреждаю Министерство магии и позволяю им позаботиться обо всех происшествиях..."
    sna "Но на этот раз я бы предпочел избежать любых дел с этими гнилыми бюрократами..."
    call sna_main("Кроме того, потеря директора, даже временная, может повредить репутации школы...","snape_10") 
    sna "А что если заклинание пройдет завтра или возможно сегодня?"
    call sna_main("Я не вижу причин для волнений...","snape_09") 
    m "Хм..."
    call sna_main("Так что пока мы продолжим маскарад...","snape_03") 

    m "Что мне делать?"
    call sna_main("Просто действуй, как всегда Альбус делает: никогда не оставляй эту башню и попытайся избегать каких-либо контактов с другими обитателями замка...","snape_05") 
    m "Что...."
    m "..."
    g4 "Это же невероятно скучно!"
    g4 "И что я буду безвылазно здесь делать?"
    call sna_main("Ты же Джинн. Придумай себе какое-нибудь развлечение.","snape_01") 
    m "Моя магия, кажется, по некоторым причинам, здесь должным образом не работает..."
    m "И моя Лампа в другом измерении..."
    call sna_main("Ну, и что ты ждешь от меня?","snape_03") 
    sna "Может, прислать тебе пару девочек из Слизерина?"
    g9 "Я понятия не имею, что такое \"Слизерин\", но я думаю, что это поможет..."
    call sna_main("Это очевидно была шутка.","snape_04") 
    call sna_main("Хотя...","snape_09") 
    sna "Хм..."
    call sna_main("Ну, в любом случае, я не знаю, как {size=+7}тебе{/size} развлекаться. Это уже {size=+7}твоя{/size} проблема.","snape_01") 
    m "О, но это так!"
    m "Я бессмертен и всемогущ..."
    m "Скука - одна из худших вещей, которые могут случиться со мной!"
    g4 "И я против того, чтобы сидеть взаперти в маленьком пространстве, и ничего не делать!"
    g4 "Я могу потерять рассудок..."
    g4 "О! Ах! Я думаю, что это уже происходит!"
    call sna_main(".......","snape_03") 
    g4 "Я теряю рассудок! Становится трудно дышать!"
    call sna_main("....","snape_04") 
    g4 "Здесь так темно..."
    g4 "Ты все еще здесь?"
    call sna_main("....","snape_03") 
    m "........."
    call sna_main("Ты закончил?","snape_10") 
    m "Да..."
    m "Серьезно, я не вижу, какую все это дело, принесет мне пользу."
    call sna_main("У тебя есть выбор?","snape_01") 
    m "Я думаю..."
    m "Вместо того, чтобы сидеть тихо здесь, на своей заднице весь день, я мог бы исследовать ваш мир..."
    call sna_main("Хм...","snape_03") 
    call sna_main("Хорошо, хорошо, чего ты хочешь?","snape_01") 
    m "Научи меня своей магии..."
    call sna_main("Моей магии?","snape_05") 
    m "Да... как вы колдуете свои заклинания..."
    m "Это меня интригует..."
    call sna_main("Хм...","snape_04") 
    call sna_main("Согласен.","snape_06") 
    m "Да, а также пришли мне парочку этих \'девочек\' из \"Слизерина\"..."
    call sna_main("...............","snape_05") 
    sna "........................."
    call sna_main("Ха-ха-ха!!!","snape_28") 
    m "Что? Чего я сказал?"
    call sna_main("А-ха-ха-ха-ха...","snape_28") 
    call sna_main("Нет... нет... ... я извиняюсь...","snape_02") 
    sna "Просто для меня ты все еще выглядишь и говоришь как Альбус..."
    sna "Услышать, как профессор Дамблдор говорит про подобные вещи: \"Пришли мне парочку этих девочек\"..."
    call sna_main("Это истерика... ","snape_22") 
    call sna_main("Но ты не поймешь...","snape_09") 
    m "Хех..."
    g9 "Отправь ко мне этих шлюх, Северус. Сегодня я чувствую себя одиноким."
    call sna_main("Ха-ха-ха! Прекрати, ты меня {w}убиваешь!","snape_28") 
    sna "Ха-ха-ха!"
    m "Нет, я серьезно... Можешь ли это устроить?"
    call sna_main("Хм...","snape_02") 
    sna "Поглядим..."
    sna "Ты, как наш новый директор, открываешь для меня очень интересные возможности..."
    sna "Мне нужно время, чтобы понять, как использовать эту ситуацию в своих \"интересах\"."
    m "Ты имеешь ввиду {size=+7}наших{/size} интересах, верно?"
    call sna_main("О, да. Да, конечно...","snape_06") 
    sna "Я думаю, мы закончили на сегодня..."
    call sna_main("Спокойной ночи... Джинн.","snape_24") 
    m "Да. Спокойной ночи, Северус."

    hide screen snape_main
    hide screen ctc
    hide screen bld1
    with d3

    call sna_walk("mid","door",3) 
    pause.2
    
    call sna_head(".................","snape_06",xpos="base",ypos="base") 
    call sna_head("\"Отправь ко мне этих шлюх, Северус!\" Ха-ха-ха.","snape_28") 

    call play_sound("door") 
    hide screen snape_01_f #Snape stands still. (Mirrored).
    with d3

    m "Хм... "
    m "Полагаю, я как обычно, просто свернусь в клубок на этом столе..."
    pause.2

    $ mQuest_A.counter = 7 #Main Quest Milestone! #END OF MAIN QUEST A.
    call update_quests 
    #">Ты разблокировал возможность вызвать Северуса Снейпа в свой кабинет."
    
    $ hanging_with_snape = True

    jump day_start


### EVENT 8 ###

#HERMONE SHOWS UP FOR THE FIRST TIME. IN USE.
label event_08: 
    stop music fadeout 1.0
    pause 1

    call play_sound("knocking") #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    m "А?"

    call play_sound("knocking") #Sound someone knocking on the door.
    "*Тук-тук-тук!*"
    pause.7

    m "Кто-то стучится в дверь..."
    m "Дерьмо... Я должен избегать контактов с людьми!"
    m "Хм... Каковы шансы, что тот, кто стучится в мою дверь, не является человеком?"
    m "Да, довольно малые..."

    call play_sound("knocking") #Sound someone knocking on the door.
    "*Тук-тук-тук*"
    m "Какой настойчивый ублюдок..."

    $ d_flag_01 = False #When False Genie doesn't know Hermione's name.
    $ d_flag_02 = False #When TRUE Genie knows it's a girl knocking on the door.

    menu:
        m "..."
        "\"Кто там?\"":
            $ d_flag_01 = True
            who "Это я, профессор..."
            who "Гермиона Грейнджер. Можно войти?"
            m "{size=-4}(Это та несчастная, которая преследовала меня своими письмами в последнее время...){/size}"

            menu: 
                m "..."
                "\"Уходите, пожалуйста. Я занят.\"":
                    her "Но, профессор, мне действительно нужно поговорить с вами..."
                    m "..........................................."
                    her "Профессор? Я собираюсь войти!"
                    m "{size=-4}(Дерьмо...){/size}"
                "\"Да, да, ты можешь войти.\"":
                    pass  

        "\"Входите!\"":
            pass
        "\"Уходи!\"":
            $ d_flag_02 = True #When TRUE Genie knows it's a girl knocking on the door.
            who "Но, профессор, мне действительно нужно поговорить с вами..."
            m "..........................................."
            who "Профессор? Я собираюсь войти!"
            m "{size=-4}(Дерьмо...){/size}"
        "\"................\"":
            $ d_flag_02 = True #When TRUE Genie knows it's a girl knocking on the door.
            who "Профессор, вы там?"
            m "{size=-4}(Уходи...){/size}"
            who "Профессор, мне действительно нужно поговорить с вами..."
            m "..........................................."
            her "Профессор? Я собираюсь войти!"
            m "{size=-4}(Дерьмо...){/size}"

    pause.2
    call play_sound("door") #Sound of a door opening.

    call her_chibi("stand","door","base") 
    with d3
    pause.5

    if not d_flag_01:
        m "?!!"
    if not d_flag_02: #When TRUE Genie knows it's a girl knocking on the door.
        m "{size=-3}(Девочка?){/size}"
        
    call play_music("chipper_doodle") 
    
    call her_walk("door","mid",3) 
    pause.5
    
    show screen bld1
    show screen ctc
    
    call her_main("","base","base",xpos="base",ypos="base") 
    call ctc 

    call her_main("Доброе утро, профессор.","normal","base") 

    menu:
        "\"Доброе утро... девочка.\"":
            her "{size=-4}(\"Девочка\"?){/size}"
            pass
        "\"Доброе утро, Гермиона.\"" if d_flag_01:
            pass
        "\"Доброе утро, дитя.\"":
            her "{size=-4}(\"Дитя\"...?){/size}"
        "\"................................\"":
            pass

    her "Я очень занята расписанием своих занятий, но сегодня утром я освободилась, чтобы увидеть вас, профессор."
    her "Вы, наверное, тоже знаете, почему я здесь."
    call her_main("Вопрос, который я в последнее время, безуспешно пытаюсь довести до вашего сведения.","open","angryCl") 
    her "Я не могу понять, почему вы не действуете, чтобы это остановить, профессор!"
    her "Это просто не может так продолжаться!"
    call her_main("Неравенство начинает сказываться на всех факультетах...","open","base") 
    her "Просто потому, что Гриффиндор более сплоченнее, чем остальные..."
    her "Как вы думаете это справедливо, что люди, которые заслуживают быть в лидерах вместо этого оказываются позади?"
    her "Вы считаете, что это справедливо, профессор?"
    call her_main("","normal","base") 
    m "{size=-4}(Посмотрите на эту красивую маленькую ведьму.){/size}"
    m "{size=-4}(Посмотрите, как она негодует... Она очаровательна.){/size}"
    m "{size=-4}(Черт, я не видел женщину несколько недель.){/size}"

    menu:
        "\"(Пожалуй немного передерну затвор, пока она говорит.)\"":
            $ jerk_off_session = True #Affects next conversation with Snape.
            $ d_flag_01 = True #If TRUE genie jerks off under the desk.    
        "\"(Нет, это глупо! Мне нужно вести себя прилично!)\"":
            $ d_flag_01 = False #NOT JERKING OFF.
            pass

    if d_flag_01:
        hide screen bld1
        with d3
        call nar(">Ты опускаешь руки под стол и обхватываешь свой член...") 
        hide screen genie
        call gen_chibi("jerking_off_behind_desk") 
        with d3

    m "Да, продолжай, дорогая."
    show screen bld1
    call her_main("\"Да\"?! Так вы считаете, это справедливо?","angry","angry") 
    m "О, конечно нет, я имел в виду \"нет\". Но продолжай в любом случае..."
    call her_main("Какое облегчение. Я рада, что вы согласны со мной, профессор...","normal","base") 
    call her_main("Как я уже говорила, весь вопрос просто смешен, и я не могу поверить, что это нынче происходит!","open","angryCl") 

    if d_flag_01:
        hide screen hermione_main
        hide screen bld1
        call nar(">*Fap!* *Fap!* *Fap!*","start") 
        call nar(">Ты продолжаешь гладить свой член...","end") 
        show screen hermione_main
        show screen bld1
        with d3
    else:
        m "Я вижу..."

    her "Я бы поняла, если бы что-то подобное произошло в средние века..."
    her "Но мы давно оставили средневековье позади, не так ли?"

    if d_flag_01:
        g9 "{size=-4}(Посмотрите на эти розовые щеки. Я хочу потыкать в них своим членом.){/size}"
        hide screen hermione_main
        call nar(">Ты продолжаешь дрочить свой член...") 
        show screen hermione_main
        with d3
    else:
        m "Эм... Я полагаю, что вы сделали. Я имею в виду, мы сделали."

    her "Так что это вредит всей системе распределения очков между факультетами."
    her "Но это не предел!"
    her "Это вредит и всей нашей системе образования..."
    her "И что еще более важно, мотивация среди студентов неуклонно снижается за счет этого!"

    if d_flag_01:
        m "{size=-4}(Поглядите какие у этой девочки сиськи!){/size}"
        m "{size=-4}(Да... Я хочу между ними поместить свой член...){/size}"

    her "Как видите, ситуация тяжелая..."
    call her_main("Но мы все еще можем, все исправить...","open","base") 
    her "Как президент Студенческого Представительного Органа нашей школы..."
    her "У меня есть несколько предложений о том, как сделать это более эффективно."

    if not d_flag_01:
        m ".............."

    her "Прежде всего, система очков факультетам, должна быть сохранена!"
    call her_main("Вам нужно лучше контролировать распределение очков, сэр.","normal","base") 

    if d_flag_01:
        g4 "{size=-4}(Да, шлюха... Мерзкая маленькая шлюха... Бьюсь об заклад, ты любишь сосать члены... Не так ли? Да, держу пари, что да...){/size}"
        hide screen hermione_main
        with d3
        call nar(">Ты дрочишь сильнее свой твердый, как камень член!") 
        show screen hermione_main
        with d3

    her "Конечно, в этом вы согласны со мной, профессор, не так ли?"

    if d_flag_01:
        g4 "{size=-4}*Тяжелые вздохи*{/size}"
        call her_main("Профессор...?","normal","frown") 
        g4 "{size=-4}(Дерьмо. Чего она сейчас от меня хочет?){/size}"
        g4 "Да, это все так. Пожалуйста, продолжай..."
        her "Эм... Итак, как я уже говорила..."
        m "{size=-4}(О... Это был неприятный момент... Было близко, я чуть не \"кончил\".){/size}" 
        m "{size=-4}(Может, мне стоит остановиться, прежде чем я попаду в неприятности.){/size}"

        menu:
            "\"(Да, пришло время ее послушать.)\"":
                show screen genie
                with d3
                $ d_flag_01 = False #NOT JERKING OFF ANY MORE.
                pass
            "\"(Нет! Я хочу продолжать дрочить!)\"":
                pass

    else:
        m "{size=-4}(Правда? Честно говоря, мне плевать...){/size}"
        m "Хм... Я предполагаю, что я так и делаю..."
        her "{size=-4}(\"Предполагать\"?){/size}"
        her "{size=-4}(Когда профессор Дамблдор стал таким... безучастным?){/size}"

    call her_main("Еще одна мера, которую вы могли бы принять во внимание, - это ужесточение контроля над персоналом...","open","angryCl") 
    her "Особенно учителя..."
    call her_main("Надеюсь, я не перехожу черту, сэр, но некоторые учителя действительно нуждаются в надзоре...","normal","base") 

    if d_flag_01:
        g4 "{size=-4}(Да! Ты маленькая шлюха! Ты маленькая шлюха!) *Задыхаясь*{/size}"
    else:
        m "......................."

    call her_main("Я понимаю, что у вас может не быть времени на это, профессор. В конце концов, вы директор нашей школы, и очень занятой человек.","open","angryCl") 
    her "Стоять впереди всех, для меня иногда тоже тяжело..."

    if d_flag_01:
        g4 "{size=-4}(Она сказала \"стояк\"!) *Задыхаясь*{/size}"

    her "Но вы могли бы делегировать эту задачу мне..."
    her "Просто доверьтесь мне, профессор." 

    if d_flag_01: 
        call her_main("Да, вы можете это сделать! Просто положитесь на меня, сэр!","base","base") 
        stop music fadeout 1.0
        
        call cum_block 

        g4 "{size=-4}(Вот черт, получилось!) *Ох!*{/size}"
        hide screen hermione_main
        hide screen bld1
        with d3
        call gen_chibi("cumming_behind_desk") 
        with d3
        pause 3
        
        show screen bld1
        call her_main("Профессор?! Что с вами..?","angry","wide") 
        call gen_chibi("jerking_behind_desk") 
        show screen genie_jerking_sperm_02
        with d3
        g4 "Ах... ДААААА.....!"
        her "???"
        g4 "*Тяжелые вздохи* Да! да...."
        call gen_chibi("cum_on_desk") 
        with d3
        pause.2
        m "Да, девочка. Все именно так, как ты говоришь, и я обязательно.... обо всем этом позабочусь."
    else:
        m "Хорошо... Я подумаю о твоем предложении, обещаю."

    call her_main("Неужели?","normal","frown") 
    her "хм..........."

    call play_music("chipper_doodle") 

    call her_main("Какое облегчение! Благодарю вас, профессор.","open","angryCl") 

    if d_flag_01:
        m "Нет, не надо благодарностей..."
        call her_main("Хм...","normal","frown") 

    call her_main("Мои занятия вот-вот начнутся, так что мне лучше идти.","open","angryCl") 
    her "Спасибо, что уделили мне время..."
    
    call her_walk("mid","leave",2) 

    if d_flag_01:
        m "{size=-4}(Это было потрясающе...) *Задыхаясь*{/size}"
        m "{size=-4}(Хотя мои брюки испорчены...){/size}"
    else:
        m "................."
        m "(Она симпатичная, но с ней придется поработать...)"

    hide screen genie_jerking_sperm_02
    with d3

    $ mQuest_B.counter = 1 #Main Quest Milestone!

    $ snape_against_hermione = True #Turns True after event_08. Activates special date with Snape # 01.
    $ event08_happened = True

    call play_music("brittle_rille") 

    return


### EVENT 9 ###

#Second visit from Hermione. Says she sent a letter to the Minestry. 
#Takes place after first special event with Snape, where he just complains about Hermione.
label event_09:
    stop music fadeout 3.0
    call play_sound("knocking") #Sound someone knocking on the door.
    "*Тук-тук-тук!*"

    menu:
        "\"Кто там?\"":
            her "Это я, Гермиона Грейнджер." 
            m "(Это снова та молоденькая ведьмочка...)" 
            her "Могу я войти, сэр?"
            menu:
                m "..."
                "\"Абсолютно нет! Я занят! Приходи позже!\"":
                    her "Но..."
                    her "Хорошо... Я прийду завтра..."
                    return
                "\"Конечно. Заходи, заходи.\"":
                    pass
        "\"Я занят. Вернись позже.\"":
            her "Но..."
            her "Ну ладно..."
            return
        "\"Да, заходи.\"":
            pass
        "\"...................................\"":
            call play_sound("knocking") #Sound someone knocking on the door.
            "*Тук-тук-тук!*"
            m "............................."
            her "Профессор, я войду..."
            m "{size=-4}(Дерьмо!){/size}"

    $ event09 = True #You let Hermione in. This event will stop looping now.

    call play_sound("door") #Sound of a door opening.
    
    call her_walk("door","mid",3) 
    pause.5
    call bld 
    
    call play_music("chipper_doodle") 
    
    call her_main("","normal","base",xpos="base",ypos="base") 
    call ctc 

    call her_main("Доброе утро, профессор Дамблдор.","open","angryCl") 

    menu:

        "\"Доброе утро, дитя.\"":
            call her_main("{size=-4}(опять \"дитя\"...){/size}","annoyed","frown") 
            call her_main("Сэр, я была бы признателена, если бы вы отнеслись ко мне как к равной...","open","angryCl") 
            m "{size=-4}(Я буквально на миллионы лет старше тебя, ведьма. Мы практически равны.){/size}"
            m "...................."
            call her_main("................","annoyed","frown") 
        "\"Доброе утро, мисс Грейнджер.\"":
            her "Эм... Итак, о причине моего присутствия здесь..."
        "\"Да, да, что угодно...\"":
            pass
    
    her "Сэр, я вижу, что независимо от того, что бы я не делала, я просто не могу достучаться до вас."
    call her_main("Поэтому в свете вашей небрежности, я решила взять инициативу на себя!","open","angryCl") 
    m "Решила...?"
    her "Да! Мы, гордые студенты Хогвартса, ненавидим сексизм..."
    her "Ни один человек не может рассматриваться по-разному, исходя из половых признаков."
    m "Но..."
    call her_main("Пожалуйста, позвольте мне закончить, профессор!","angry","angry") 
    call her_main("Я организую \"Движение за права мужчин\" в нашей школе!","open","angryCl") 
    g4 "О боже, это так типично!"
    g4 "Во всем винова--"
    stop music fadeout 1.0
    m "Подожди, ты сказала, движение за {size=+5}МУЖСКИЕ{/size} права?"
    call play_music("chipper_doodle") 
    call her_main("Вы не представляете, как трудно современным мальчикам в нашей школе...","open","worried") 
    menu:
        "\"Понятия не имею...\"":
            call her_main("Нет, это не так, потому что вы отказываетесь нас слушать, сэр!","open","angryCl") 
            her "Но мы заставим вас услышать нас..."
        "{size=-3}\"Это буквально самая глупая идея, которую я когда-либо слышал.\"{/size}":
            call her_main("Я подозревала, что вы скажите что-то подобное...","normal","frown") 

    call her_main("Знаете ли вы, что некоторые девочки в школе продают определенные услуги за очки своим факультетам...?","annoyed","frown") 
    her "Иногда даже для хороших оценок..."
    m "Действительно?"
    call her_main("Не из \"Гриффиндора\", конечно...","open","angryCl") 
    her "И это то, что ставит нас в невыгодное положение - наша честность!"
    her "Что касается мальчиков - им приходится работать в десять раз больше, чем девочкам, чтобы просто пройти тест..."
    her "Или, если им повезет, получить одно очко факультета..."
    call her_main("Это сексизм в чистом виде!","open","base") 
    menu:
        m "..."
        "\"Что ты хочешь от меня?\"":
            call her_main("Ничего!","normal","base") 
            m "Прекрасно. Я хорош в этом."
        "\"Я не знаю, что сказать...\"":
            call her_main("Вам больше не нужно ничего говорить, профессор.","normal","base") 
        "\"Ты ведешь себя нелепо!\"":
            call her_main("Я? Ну, мы еще посмотрим...","normal","frown") 

    call her_main("Я уже отправила письмо в Министерство магии.","open","angryCl") 
    with hpunch
    g4 "{size=+7}Что ты сделала?!{/size}"
    m "{size=-4}(Подождите, мне вообще-то наплевать на это?){/size}"
    her "Простите, но Вы не оставили мне выбора, профессор."

    her "А теперь, если вы меня извините, я должна идти на занятия..."
    
    call her_walk("mid","leave",2) 

    m "...................."
    

    $ mQuest_B.counter = 2 #Main Quest Milestone!

    $ hermione_is_waiting_01 = False #Makes sure this event is not repeated.
    $ snape_against_hermione_02 = True #Turns True after event_09. Activates second event when hanging out with Snape.
    
    call play_music("brittle_rille") 

    return


### EVENT 11 ###

#Third visit, after second special date with Snape. Hermione complains that she almost failed a test. (EVENING EVENT!)
label event_11: 
    stop music fadeout 1.0
    call play_sound("knocking") #Sound someone knocking on the door.
    "*Тук-тук-тук!*"

    her "Профессор, я войду!"
    m "...."

    call play_music("chipper_doodle") 
    call play_sound("door") #Sound of a door opening.

    $ hermione_wear_robe = True
    call update_her_uniform 

    call her_walk("door","mid",2.1) #Hermione Chibi stands still after.

    call bld 
    pause.5
    
    call her_main("","annoyed","frown",xpos="base",ypos="base") 
    call ctc 

    call her_main("Добрый вечер, профессор.","annoyed","angryL") 

    menu:
        "\"-взгляд полный ненависти-\"":
            call her_main("Вы можете смотреть на меня сколько угодно, сэр.","normal","frown") 
            her "Это не заставит проблемы исчезнуть из этой школы."
        "*вздох раздражения*":
            call her_main("Сейчас неподходящее время?","normal","base") 
            call her_main("Ну, раз уж я уже здесь...","open","base") 
        "\"....................................\"":
            call her_main("Профессор?","open","base") 
            m "Да, да..."

    call her_main("Нечто... странное случилось сегодня...","open","angryCl") 
    call her_main("Я не знаю, как это описать...","normal","frown") 
    call her_main("................................","annoyed","frown") 
    call her_main("Думаю, я чуть не провалила тест...","annoyed","angryL") 

    menu:
        "\"Такое иногда случается со студентами.\"":
            call her_main("С другими студентами, да. Но не со мной, сэр!","annoyed","angryL") 
            call her_main("Никогда...","soft","baseL") 
        "\"(Так держать, Снейп!)\"":
            call her_main("Простите?","normal","base") 
            m "Что?"
            m "О, я сказал, это слишком ужасно. Как ты себя чувствуешь?"
            call her_main(".................","normal","frown") 
        "\"Так зачем мне это рассказывать?\"":
            her "Потому что... это не обычное событие!"

    her "Я не уверена, что происходит..."
    m "Коварный план против вас, мисс Грейнджер?"
    call her_main("Это не смешно, сэр.","normal","base") 
    call her_main("Вы должны считать меня \"мерилом\" для нашей системы образования.","open","angryCl") 
    her "Если я \"почти\" завалила тест, остальные студенты обязательно провалят его."
    m "Это так...?"
    call her_main("Да, профессор. Что-то пошло не так...","normal","frown") 
    call her_main(".................................","annoyed","angryL") 
    call her_main("Но что, если это не так?","open","worried") 
    her "Что делать, если все тесты будут с этого момента такими трудными?"
    call her_main("Мне нужно заниматься усерднее!","open","worriedL") 

    label cant_say:
    menu:
        "\"Я могу поучить вас, Мисс Грейнджер.\"":
            call her_main("Вы, профессор?","open","base") 
            call her_main("О, спасибо за ваше предложение, но я не думаю, что это будет необходимо, сэр.","soft","base") 
            call her_main("Лучший репетитор-это книга, и у меня в распоряжении вся библиотека Хогвартса.","open","closed") 
        "\"Мудрое решение, Мисс Грейнджер.\"":
            call her_main("Спасибо, профессор.","soft","base") 
        "\"Тебе нужно положить мой член в свой рот.\"":
            m "Ты должна положить мой чл--"
            call her_main("А?","soft","base") 
            m "{size=-4}(Нет, я не могу этого сказать...){/size}"
            call her_main("......?","annoyed","suspicious") 
            jump cant_say

    m "............"
    call her_main("Ну, если у вас все, то мне пора на занятия.","open","closed") 
    m "Конечно..."

    call her_walk("mid","leave",2) 
    
    $ hermione_wear_robe = False
    $ only_upper = False #Otherwise skirt shows up under the robe.
    
    $ mQuest_B.counter = 3 #Main Quest Milestone!

    $ event11_happened = True #Allows next event to start.
    $ days_without_an_event = 0 #Resets the counter. This counts how many days have passed since this event happened.
    
    call play_music("night_theme") 

    return


### EVENT 12 ###

#Hermione complains that she might have failed a test. (EVENING EVENT!)
label event_12:
    call play_sound("door") 

    call her_walk("door","desk",2.8) 
    
    call play_music("chipper_doodle") 

    her "Профессор! Мне надо поговорить с Вами!"
    m "(Так она даже не потрудилась постучаться?)"
    call bld 

    call her_main("Профессор, сегодня случилось что-то ужасное!","open","worried",xpos="right",ypos="base") 
    her "Сегодня я провалила тест..."
    her "Я не могу поверить в происходящее!"
    call her_main("Как такое вообще возможно?!","angry","wide") 

    menu:
        "\"Ты должна больше учиться, девочка!\"":
            call her_main("Но я всю ночь готовилась к этому тесту!","soft","base",tears="soft") 
        "\"Не переживай... Все будет хорошо.\"":
            call her_main("Вовсе нет! Это катастрофа!","mad","worriedCl",tears="soft_blink") 

    call her_main("И хуже всего то, я думаю, что я единственная, кто его не сдала...","angry","base",tears="soft") 
    call her_main("И как я буду при этом выглядеть?","angry","base",tears="soft") 
    call her_main("Я буду знать точно, когда получу результаты, хотя...","normal","baseL",tears="soft") 
    call her_main("Да, я уверена, что все остальные тоже не сдали его...","soft","baseL") 
    call her_main("Я имею в виду, они не должны, верно?","open","worried") 
    call her_main(".....................","soft","baseL") 
    call her_main("....верно?","open","worried") 

    menu:
        "{size=-3}\"Конечно. В конце концов, ты лучшая студентка.\"{/size}":
            call her_main("Точно...","annoyed","frown") 
            her "Или, по крайней мере, я была ею до сегодняшнего дня..."
            call her_main("Я не могу поверить, в происходящее!","mad","worriedCl",tears="soft_blink") 
        "{size=-3}\"Ты бы лучше подготовилась, если бы я был твоим репетитором.\"{/size}":
            $ tutoring_offer_made = True #Affects conversation in the next event.
            call her_main("хм...","annoyed","suspicious") 
            call her_main("Да, возможно это может помочь, я полагаю...","soft","baseL") 
            call her_main("Я ценю ваше предложение, профессор, но...","open","base") 
            her "Могу я подумать об этом?"
            m "Только недолго..."
        "{size=-3}\"Я полагаю, мы скоро узнаем.\"{/size}":
            call her_main("Да, я полагаю, что так и будет...","soft","base") 

    call her_main("Мне очень жаль, профессор, я, вероятно, слишком бурно реагирую, но в любом случае...","grin","worriedCl",emote="05") 
    call her_main("Но вы должны понимать, что на кону моя репутация!","open","base") 
    call her_main("Должно быть что-то не так с тестом...","annoyed","angryL") 
    her "И хотя я его провалила, вероятно, я все еще должна получить наибольшее количество баллов за тест..."
    her "Как обычно..."
    call her_main("Что ж, мне лучше сейчас уйти. У нас есть еще встреча в \"ДПМ\" сегодня.","open","angryCl") 
    her "Я дам вам знать о новых идеях, которые мы придумаем сегодня вечером."
    m "Я жду с нетерпением..."
    
    call her_walk("desk","leave",3) 
    
    $ mQuest_B.counter = 4 #Main Quest Milestone!

    $ event12_happened = True #Allows next event to start.
    $ days_without_an_event = 0 #Resets the counter. This counts how many days have passed since this event happened.
    
    jump day_start


### EVENT 13 ###

#Hermione complains that she did fail the test. (EVENING EVENT!)
label event_13: 
    call play_sound("door") 

    call her_walk("door","mid",2) 
    
    her "....................."
    m "???"
    
    call her_walk("mid","desk",1.6) 
    
    her "............"
    m "Мисс Грейнджер?" 
    her "..............................."
    m "Мисс Грейнджер?!!" 
    call bld 

    call her_main("","upset","dead",tears="mascara",xpos="right",ypos="base") 
    call ctc 

    her "Да?"
    her "О, я уже здесь?"
    her "Мне очень жаль, сэр... Я..."
    her ".................."
    her "Кажется, что это случилось..."
    her "Это случилось... хм..."
    her "...В конце концов, я провалила этот тест."
    her "Я..."
    call her_main("Извините, профессор...","upset","worriedCl",tears="mascara_soft_blink") 
    her "Я не знаю, почему я здесь..."
    her "Я думаю, я лучше пойду..."
    m "..................."
    
    call her_walk("desk","leave",1,action="run") 
  
    pause.3
    m "............."
    m "Она будет в порядке...?"
    m "Я думаю..."

    $ mQuest_B.counter = 5 #Main Quest Milestone!

    $ event13_happened = True #Allows next event to start.
    $ days_without_an_event = 0 #Resets the counter. This counts how many days have passed since this event happened.
    
    jump day_start


### EVENT 14 ###

#Гермиона приходит после ее срыва (когда она провалила тест). Она просит о репетиторстве. Репетиторство разблокировано.
label event_14: 
    call play_music("chipper_doodle") 
    call play_sound("door") 

    call her_walk("door","mid",2) 
    call bld 
    
    call her_main("Доброе утро, профессор.","base","base",xpos="base",ypos="base") 
    m "Чем я могу помочь вам сегодня, мисс Грейнджер?"
    call her_main("Ну, во-первых, я ужасно сожалею о своем вчерашнем виде, сэр...","open","angryCl") 
    call her_main("Я никогда в своей жизни не проваливала тест, поэтому я не уверена, как реагировать...","open","suspicious") 
    call her_main("Но теперь мне уже лучше...","open","angryCl") 
    m "Я вижу..." 
    her "Я не стану отнимать у вас много времени, обещаю..."

    if tutoring_offer_made:
        her "Я здесь, чтобы принять ваше предложение."

        menu:
            "\"Какое предложение?\"":
                her "Недавно вы предложили позаниматься со мной, сэр..."
                menu:
                    "\"О... Срок действия этого предложения истек.\"":
                        call her_main("Как...","open","base") 
                        her "Истек, сэр?"
                        her "Н-но...."
                        call her_main("Но мне нужен репетитор, а вы самый умный волшебник, которого я знаю...","open","worried") 
                        call her_main("Пожалуйста, сэр. Мне очень нужна ваша помощь.","angry","worried") 
                        menu:
                            "\"Покажи мне свои сиськи и договорились!\"":
                                call her_main("м-мои...?","angry","wide") 
                                call her_main("............","annoyed","worriedL") 
                                her "....."
                                with hpunch
                                call her_main("{size=+5}Профессор Дамблдор!!!{/size}","scream","angryCl") 
                                m "{size=-5}(Ну, по крайней мере, я попытался...){/size}"
                                her "Я не какая-то \"Слизеринская\" подстилка!"
                                m "Конечно, нет, мисс Грейнджер."
                                m "Это было испытание... Ты сдала его. Хорошая работа."
                                call her_main("Что...?","open","base") 
                                call her_main("Да, конечно. Иногда я такая глупая. Простите за крики, сэр.","grin","worriedCl",emote="05") 
                                m "Мое предложение все еще в силе. Если хочешь, я могу тебя обучать."
                                call her_main("..............","annoyed","worriedL") 
                            "\"Хорошо, хорошо, хорошо...\"":
                                pass
                    "\"О, это правильно. Прекрасно.\"":
                        pass

            "\"Великолепно! С сегодняшнего дня?\"":
                pass

    else:
        call her_main("Я... хм...","normal","frown") 
        her "Сэр, я надеюсь, что это не слишком невежественно, если спрошу..."
        m "Да?"
        her "Эм... было бы хорошо, если бы..."
        her "..............."
        call her_main("Как вы думаете, вы могли бы немного обучить меня, сэр?","annoyed","frown") 
        menu:
            "\"Полагаю, это возможно.\"":
                pass
            "\"Хм... Вообще-то, я очень занят.\"":
                call her_main("Сэр, пожалуйста, вы самый умный волшебник, которого я знаю!","open","worried") 
                m "{size=-4}(Ты и понятия не имеешь на сколько, маленькая ведьма.){/size}"
                m "Ну, я полагаю, это можно организовать..."

    call her_main("Благодарю вас, сэр. Я вам очень благодарна.","base","base") 
    call her_main("Просто скажите мне когда и я принесу свои книги!","open","closed") 
    call her_main("Я должна учиться еще усерднее с этого момента...","annoyed","frown") 
    call her_main("И я буду брать частные уроки у вас, сэр, как можно чаще.","base","base") 
    call her_main("Но это не все...","normal","frown") 
    her "Сейчас \"ДПМ\" вплотную изучает нашу систему образования..."
    her "Я думаю, что могут быть махинации..."
    m "Ты шутишь!"
    her "У меня уже есть список подозреваемых, но это мы обсудим позже...."
    m "Эм... хорошо..."
    call her_main("Мои занятия скоро начнутся. Мне лучше идти...","open","worriedL") 
    
    call her_walk("mid","leave",2) 
    
    stop music fadeout 1.0

    $ mQuest_B.counter = 6 #Main Quest Milestone!
    #>Ты открыл возможность вызвать Гермиону Грейнджер в свой кабинет."

    $ summoning_hermione_unlocked = True #Unlocks after event_14. Adds "Summon Hermione" button to the door.
    $ hermione_takes_classes = True
    $ tutoring_hermione_unlocked = True

    $ event14_happened = True #Allows next event to start.
    $ days_without_an_event = 0 #Resets the counter. This counts how many days have passed since this event happened.
    
    call play_music("brittle_rille") 

    return


### EVENT 15 ###

#Hermione comes and asks to buy a favour from her.
label event_15: 
    call play_sound("knocking") 

    "*Тук-тук-тук!*"

    menu:
        "\"Кто там?\"":
            her "Это я, Гермиона Грейнджер." 
            m "(Это опять та молоденькая ведьмочка...)" 
            her "Могу я войти, сэр?"
            menu:
                m "..."
                "\"Абсолютно нет! Я занят! Приходи позже!\"":
                    her "Но..."
                    her "Хорошо... Я вернусь завтра..."
                    return
                "\"Конечно. Заходи.\"":
                    pass
        "\"Я занят. Вернись позже.\"":
            her "Но..."
            her "Ну, ладно..."
            return
        "\"Да, заходи.\"":
            pass
        "\"...................................\"":
            call play_sound("knocking") 
            "*Тук-тук-тук!*"
            m "............................."
            her "Профессор, я зайду..."
            m "{size=-4}(Дерьмо!){/size}"
    
    call play_sound("door") 

    call her_walk("door","mid",3) 
    
    call her_main("Добрый вечер, профессор...","soft","baseL",xpos="base",ypos="base") 
    her "........................"
    call her_main("........................","annoyed","worriedL") 
    her "........................"
    call her_main("Эм......","open","base") 
    call her_main(".................","annoyed","worriedL") 
    m "Что случилось, мисс Грейнджер?"
    call her_main("Ну, эм...","open","base") 
    her "Видите ли... \"Гриффиндор\" больше не лидирует..."
    call her_main("И... все так усердно работают...","annoyed","worriedL") 
    her "И они обращаются ко мне за помощью, но я не знаю, что делать..."
    m "............................"
    her "Профессор Дамблдор...."
    stop music fadeout 2.0
    call her_main("Я хочу, чтобы вы купили у меня услугу!","scream","worriedCl") 
    call her_main("","normal","worriedCl") 

    menu:
        "\"Ты имеешь в виду сексуальную услугу?\"":
            call her_main("Эм... Я не уверена...","angry","worriedCl",emote="05") 
            her "Ту, которая поможет набрать нашему факультету дополнительные очки..."
            call her_main("Я могу написать эссе для вас или...","open","base") 
            call her_main("Или, может быть, почистить вашу башню..?","angry","worriedCl",emote="05") 
            m "{size=-4}(Почистить мою башню? Хех... Где-то здесь должна быть пошлая шутка...){/size}"
            m "Ну, тогда, я думаю, мы что-нибудь придумаем."
        "\"Ну, если вы настаиваете...\"":
            pass
        "\"Я так не думаю, мисс Грейнджер.\"":
            call her_main("Н-но... Нам нужны очки...","open","base") 
            her "Профессор, пожалуйста, я действительно в отчаянии..."
            m "В отчаянии, говорите..?"
            m "Ну, ладно..."

    call play_music("chipper_doodle") 
    call her_main("Благодарю вас, профессор...","base","base") 
    
    label choose_favor_agagin:
    $ d_flag_01 = False
    $ d_flag_02 = False
    $ d_flag_03 = False
    $ d_flag_04 = False
    her "Так... Что это будет?"

    menu:
        "\"Покажи мне свой язык...\"":
            $ d_flag_01 = True
            pass
        "\"Стой там. Дай мне взглянуть на тебя.\"":
            $ d_flag_02 = True
            pass
        "\"Сделай глупое лицо...\"":
            $ d_flag_03 = True
            pass
        "\"Скажи \"Я была плохой девочкой\".\"":
            $ d_flag_04 = True
            pass

    her "Эм..."
    her "Сколько очков... я за это получу?"
    $ d_flag_05 = False # 20 Points.
    $ d_flag_06 = False # 40 Points.
    $ d_flag_07 = False # 10 Points.
    $ d_flag_08 = False # 1 Point.

    menu:
        "\"1 очко.\"":
            if d_flag_02: #Stand there.
                $ d_flag_08 = True # 1 Point.
                pass
            else:
                her "Я не думаю, что это стоит того..."
                jump choose_favor_agagin
        "\"10 очков.\"":
            if d_flag_02: #Stand there.
                $ d_flag_07 = True # 10 Points.
                pass
            else:
                her "Я не думаю, что это стоит того..."
                jump choose_favor_agagin
        "\"20 очков.\"":
            $ d_flag_05 = True
            her "Так мало...?"
            pass
        "\"40 очков.\"":
            $ d_flag_06 = True
            pass
    
    call her_main("Эм, хорошо...","","",xpos="mid") 

    if d_flag_01: #Show me your tongue.
        call her_main("М-мой... язык, сэр?","grin","worriedCl",emote="05") 
        m "Да, девочка. Открой рот и покажи язык."
        call her_main("{size=-7}(Так чудно...){/size}","annoyed","angryL") 
        call her_main("Эм... ну, хорошо...","normal","frown") 
        call her_main("Здесь...","open","suspicious") 
        call her_main(".............","open_tongue","glance") 
        her "............."
        call her_main(".................","open_tongue","angryL") 
        call ctc 

        menu: 
            "\"Отлично. Вот твои очки.\"":
                pass
            "\"Недостаточно хорошо. Ты можешь сделать лучше\"":
                call her_main("...............","annoyed","angryL") 
                her "Хорошо, я постараюсь сделать лучше, сэр..."
                call her_main("Как насчет этого?","open","worried") 
                call her_main("А-А-А-А..................","scream","baseL") 
                call her_main("............................","open_wide_tongue","squintL") 
                call her_main("......................................","open_wide_tongue","down_raised") 
                her "..................................................."
                her "...................................................................."
                call her_main(".......................................................................................................","open_wide_tongue","angryCl") 

    if d_flag_02: #Stand still...
        call her_main("Так, я просто должна стоять здесь...?","base","base") 
        m "Хорошо... Теперь повернись... медленно."
        her "хм... хорошо..."
        hide screen hermione_main
        hide screen bld1
        pause.5

        show screen hermione_stand_f #Hermione stands still.
        with d7

        call her_head(".................................","annoyed","baseL") 

        menu:
            m "Хм..."
            "\"Тебе идет форма, мисс Грейнджер...\"":
                call her_head("............","soft","baseL",cheeks="blush") 
                call her_head("Спасибо, профессор Дамблдор...","open","baseL",cheeks="blush") 
            "\"У тебя красивое тело, мисс Грейнджер...\"":
                call her_head("?!!","soft","wide") 
                call her_head("..............","annoyed","angryL",cheeks="blush") 
                call her_head("Благодарю вас, профессор...") 
            "\"Этого достаточно. Вот твои очки...\"":
                show screen hermione_stand #Hermione stands still.
                with d7
                pause.5
                show screen bld1
                with d3
                jump stupid_enogh
        
        m "Отлично, теперь ты можешь повернуться..."
        show screen hermione_stand #Hermione stands still.
        with d7
        pause.7

        show screen hermione_main
        call bld 
        her "................."

    if d_flag_03: #STUPID FACE
        call her_main("Глупое лицо...","grin","worriedCl",emote="05") 
        her "Давайте попробую..."
        label stupid_faces:
        call her_main("Как насчет этого?","silly","silly") 

        menu:
            "\"Хорошо! Очень глупо! В смысле, глупо.\"":
                jump stupid_enogh
            "\"Не достаточно глупо.\"":
                pass

        call her_main(".........","annoyed","angryL") 
        call her_main("А как насчет этого?","disgust","narrow") 

        menu:
            "\"Ха-ха! Ты выглядишь как идиотка!\"":
                jump stupid_enogh
            "\"Нет, не достаточно глупо.\"":
                pass

        call her_main(".........","annoyed","angryL") 
        call her_main("Что, если я сделаю так?","full","ahegao_intense") 

        menu:
            "\"Хорошо! Очень глупо.\"":
                jump stupid_enogh
            "\"Не, недостаточно глупо.\"":
                jump stupid_faces
    
    if d_flag_04: #BAD GIRL
        call her_main("Я...","normal","frown") 
        her "Я была очень плохой девочкой..."
        g9 "Ты была очень, очень, очень плохой девочкой?"
        her "Да, сэр..."
        her "Я была очень, очень, очень, очень плохо..."

        label to_early_for_sucking_cocks:
        menu:
            g9 "..."
            "\"Ты должна быть наказана?\"":
                call her_main("Должна ли я быть наказана?","open","worried") 
                call her_main("Эм...","soft","baseL") 
                her "....................."
                call her_main("Ну, я не идеальна, если вы об этом, сэр...","annoyed","angryL") 
                call her_main("Но нужно ли меня наказывать... хм?","soft","baseL") 
                call her_main("Это действительно мне решать...? Я имею в виду...","normal","frown") 
                her "Какое это имеет отношение к делу?"
                m "Много вопросов, девочка."
                m "Просто скажи, что тебя нужно наказать!"
                call her_main("Хорошо. Я должна быть наказана!","angry","angry") 
                call her_main("{size=-5}(И я, действительно иногда так думаю...){/size}","normal","worriedCl") 
                m "Хорошая девочка."
                call her_main("................??","upset","wink") 
                m "Так это было совсем не сложно, не так ли?"
                call her_main("н-нет , сэр...","annoyed","worriedL") 
                m "Значит, хорошо..."
            "\"Хочешь, чтобы тебя отшлепали?\"":
                call her_main("Хочу ли я...","open","worried") 
                call her_main("Быть о-отшлепанной???","angry","wide") 
                call her_main("Пф!","angry","angry") 
                call her_main("Профессор, я не думаю, что меня это устраива--","open","angryCl") 
                m "Извини, позволь мне перефразировать вопрос..."
                m "Насколько сильно тебе нужны эти очки?"
                call her_main("..................","annoyed","frown") 
                call her_main("Да, сэр. Мне нужно, чтобы меня отшлепали.","open","angryCl") 
                m "Ладно, пока что этого достаточно..."
                call her_main("{size=-4}(Пока что?){/size}","normal","frown") 
            "\"Иди сюда и пососи мой член!\"":
                m "{size=-5}(Слишком рано для этого... Сначала мне нужно ее подготовить.){/size}"
                jump to_early_for_sucking_cocks
    
    label stupid_enogh:
    if d_flag_05:
        m "20 очков \"Гриффиндору\"."
        $ gryffindor +=20
    elif d_flag_06:
        m "40 очков \"Гриффиндору\"."
        $ gryffindor +=40
    elif d_flag_07:
        m "10 очков \"Гриффиндору\"."
        $ gryffindor +=10
    elif d_flag_08:
        m "1 очко \"Гриффиндору\"."
        $ gryffindor +=1
    
    call her_main("Yay!..............","grin","worriedCl",emote="05",xpos="base") 
    her "Это было довольно легко..."
    her "Как вы думаете, вы могли бы купить больше моих услуг в будущем, профессор?"

    menu:
        "\"Я не думаю, что это хорошая идея.\"":
            call her_main("Пожалуйста, профессор...","angry","worried") 
            her "Нам действительно, очень нужны дополнительные способы получения очков..."
            m "......."
            call her_main("Вы - уважаемый волшебник и, честно говоря...","annoyed","worriedL") 
            her "Единственный человек в этой школе, которого я могу попросить об этом..."
            m "Ну, если ты настаиваешь..."
        "\"Это вполне возможно...\"":
            pass
            
    call her_main("Благодарю вас, профессор. Огромное спасибо.","base","base") 
    call her_main("Что ж... думаю, я лучше пойду...","base","base") 
    m "............"

    call her_walk("mid","door",2) 
    pause.3

    if d_flag_01: #Show me your tongue
        her "{size=-4}(Хм...){/size}"
        her "{size=-4}(Студенты постоянно показывают учителям свои языки...){/size}"
        her "{size=-4}(Хотя, обычно когда учитель на них не смотрит...){/size}"
        her "{size=-4}(Нет ничего аморального в том, что я сегодня сделала...){/size}"
        her "{size=-4}(Я заработала своему факультету дополнительные очки...){/size}"
        
    if d_flag_02: #Stand still...
        her "{size=-4}(Я могу просто стоять и давать профессору смотреть на себя...){/size}"
        her "{size=-4}(В этом нет ничего плохого ...){/size}"

    if d_flag_03:
        her "{size=-4}(Глупое лицо...){/size}"
        her "{size=-4}(Глупое лицо...){/size}"
        her "{size=-4}(Мне нужно попрактиковаться в этом.){/size}"

    if d_flag_04:
        her "{size=-4}(Я плохая девочка...){/size}"
        her "{size=-4}(Я очень плох...){/size}"
        her "{size=-4}(Да, я легко могу говорить такие вещи...){/size}"
        her "{size=-4}(Нет ничего в этом ужасного...){/size}"

    call her_chibi("leave") 

    stop music fadeout 1.0 

    $ mQuest_B.counter = 8 #Main Quest Milestone! END OF QUEST B.
    #">Вы открыли возможность покупать сексуальные услуги у Гермионы."
    
    $ buying_favors_from_hermione_unlocked = True 

    $ event15_happened = True #Turns TRUE after event_15
    $ days_without_an_event = 0 #Resets the counter. This counts how many days have passed since this event happened.

    return
    
    
init python:
    class wt_silver_event(object):
        day_wait = 0
        completed = False
        
        
    
    
    
    
    
