

#Spell Training.
label astoria_spell_training:
    if astoria_spells[0] == 0 and astoria_affection == 0:
        jump imperio_spell_1_training
    elif astoria_spells[0] == 1 and astoria_affection == 1: #You have to try the spell once before you can train the next one.
        jump imperio_spell_2_training
    elif astoria_spells[0] == 2 and astoria_affection == 2: #You have to try the spell once before you can train the next one.
        jump imperio_spell_3_training
    elif astoria_affection >= 3: #ADD Max affection level.
        call nar(">В настоящее время нет больше заклинаний для обучения!")
        jump astoria_requests
    else:
        call nar(">Ты пока еще не использовал свое последнее разблокированное заклинание!\n>Ты должен использовать его прежде, чем приступить к тренировке следующего.")
        jump astoria_requests



label imperio_spell_1_training: #first level imperio spell

    #Spell Intro.
    if astoria_spell_progress == 0:
        #talk about needing to practice the spell, what it does new and about sitting on lap
        call ast_main("","smile","base","base","mid",xpos="right",ypos="base",trans="fade")
        m "Так, мне удалось достать книгу совершенно новых заклинаний моего старинного друга."
        m "Возможно, он сам их и создал..."
        call ast_main("Правда? Значит, их больше никто не знает?","happy","base","base","mid")
        m "Ни души."
        call ast_main("Круто...","grin","happyCl","base","mid")
        call ast_main("Так, а я могу их увидеть?","grin","angry","angry","mid")
        m "Конечно. Просто запрыгивай ко мне на колени и мы сможем начать читать ее вместе."
        call ast_main("ЧТО???","scream","wide","wide","wide")
        call ast_main("Зачем мне сидеть у тебя на коленях?","open","angry","angry","mid")
        call ast_main("Достаточно того, что ты заставил меня тусоваться с той старой ведьмой...","disgust","angry","angry","R")
        call ast_main("Почему я не могу просто использовать стул?","disgust","angry","angry","mid")
        m "У меня только один стул..."
        call ast_main("Здесь есть еще один стул! Дурачек!!!","scream","wide","wide","mid")
        m "Нет, это..."
        m "Моя антикварная полка..."
        g9 "Кроме того, это будет весело!"
        call ast_main("Весело?","pout","angry","angry","mid")
        g9 "Это будет весело, для меня..."
        call ast_main("Тьфу...","disgust","ahegao","ahegao","ahegao")
        call ast_main("Хотя бы скажи мне, что делает твое заклинание, а я решу...","open","closed","base","mid")
        m "Хорошо. Давай я открою и взгляну."
        call ctc

        call ast_main("","pout","narrow","narrow","mid")
        pause.5
        call nar(">Ты пытаешься открыть книгу, но понимаешь, что она не поддается.")
        m "(Ну же?)"
        call ast_main("Давай же, старик...","pout","narrow","narrow","L")
        m "Я... Не могу открыть..."
        call ast_main("Что? Ты же не настолько слаб, Дамби?","tongue_silly","angry","angry","mid")
        m "Я не калека!"
        call ast_main("Пфффф, Я думаю, большинство калек способно открыть книгу.","smile","base","base","mid")
        pause.8
        m "Я думаю, она закрыта магией..."
        call ast_main("Серьезно? Тогда она, должно быть, мощная...","worried","wide","wide","wide")
        call ast_main("А на обложке что-нибудь написано?","open","base","base","mid") #need soggy to draw the book here
        m "Нет..."
        call ast_main("А сзади?","pout","base","base","R")
        m "Нет, а... подожди.. Есть стихотворение."
        call ast_main("О чем там говорится, Дамби?","grin","angry","angry","mid")
        m "Когда Марс и Венера встречаются, мои знания вам открываются..."
        call ast_main("Что это значит?!","open","wide","wide","mid")

        label astoria_book_question:
            menu:
                "-Мы должны встретиться, что бы ее открыть?-":
                    pass
                "-Нам нужно подождать парад планет, пока Венера и Марс поравняются?-":
                    call ast_main("Но, это может занять вечность!","open","ahegao","ahegao","ahegao")
                    call ast_main("Это должно быть, что-то еще Дамби!","pout","angry","angry","mid")
                    jump astoria_book_question
                "-Мы должны найти древних римских богов, что бы ее открыть?-":
                    call ast_main("Перестань быть таким тупицей!","pout","narrow","narrow","R")
                    jump astoria_book_question

        call ast_main("Ох... Поэтому ты хотел, что бы я сидела у тебя на коленках?","disgust","base","base","down")
        m "Ко-онечно... Зачем же еще мне это просить?"
        call ast_main("Нмпф...","pout","angry","angry","R")
        call ast_main("Хорошо... Просто не делай ничего похабного!","open","closed","base","mid")

        hide screen astoria_main
        hide screen bld1
        call blkfade

        call nar(">Астория залезает к тебе на колени.")

        #Set up CG scene here.
        $ ccg_folder = "astoria_sit"
        $ ccg("e6","b3","m1")

        pause.5
        hide screen blkfade
        with fade

        ast "Думаю, это не так уж и плохо.."
        $ ccg("e3","b0","m0")
        ast "Теперь, давай начнем читать!"
        m "(Снейп, надеюсь это не ловушка...)"
        call nar(">Ты и Астория начинаете вместе переворачивать страницы, на которых стали появляться слова.","start")
        call nar(">Когда Астория перелистывает страницы, вы слышите, как между страниц медленно протекает сексуальный стон...","end")
        $ ccg("e1","b1","m1")
        ast "Книга только что стонала?"
        m "Я думаю да..."
        $ ccg("e3","b0","m0")
        ast "Круто! Все книги о страшных заклинаниях, из запрещенного раздела библиотеки, делают так же?"
        $ ccg("e0","b1","m3")
        ast "Хотя, обычно они звучат не так..."
        m "Давай просто посмотрим, какое первое заклинание?"
        call nar(">Астория медленно открывает книгу, перелистывая ее до первого же заклинания, которое смогла найти.")
        $ ccg("e0","b0","m3")
        ast "\"Imperio Heart\""
        $ ccg("e1","b3","m1")
        ast "Imperio?!!"
        $ ccg("e6","b3","m1")
        ast "Все его знают, даже тупые собаки!"
        m "А что означает Heart?"
        $ ccg("e2","b3","m1")
        ast "Да какая разница! Это и не секрет вовсе!"
        m "Просто погоди секунду, давай прочтем хотя бы первую строчку."
        $ ccg("e6","b1","m4")
        ast "Хорошо..."
        $ ccg("e0","b1","m4")
        ast "\"Imperio Heart - запретный вариант непростительного проклятия.\""
        ast "\"В то время, как обычный Imperio позволяет контролировать только разум жертвы, Imperio Heart позволяет заклинателю-\""
        ast "\"внедрять желания в сердце жертвы, оставляя ум нетронутым...\""
        ast "..."
        $ ccg("e7","b1","m1")
        ast "Что это должно значить, Дамби?"
        m "Полагаю, это значит, что ты можешь заставить Сьюзан хотеть чего-то?"
        $ ccg("e7","b2","m4")
        ast "Разве, я не могу сделать это обычным заклинанием?"
        m "Я не уверен..."
        m "Хотя, когда ты на днях сотворила его, она и правда потеряла свободу воли."
        m "Так что... Может, это позволит ей ее сохранить?"
        $ ccg("e0","b1","m4")
        ast "Хммммм..."
        $ ccg("e7","b1","m3")
        ast "Так это заклинание позволяет изменить ее желания, но не контролировать ее полностью?"
        $ ccg("e7","b3","m1")
        ast "На первый взгляд, оно даже хуже обычного заклинания!"
        m "Нет, если ты хочешь скрыть тот факт, что околдовала ее..."
        $ ccg("e0","b0","m0")
        ast "Ох... Это значит, что мы можем что-то поменять в ней без ее ведома?"
        m "Кажется, что так."
        $ ccg("e3","b0","m1")
        ast "Круто!"
        $ ccg("e3","b3","m2")
        ast "Может быть, мы могли бы превратить ее в жирную шлюху, которая ходит по школе и трясет своими большими сиськами."
        call nar(">Ты чувствуешь, как у тебя от этой идеи... начинает твердеть...")
        m "Хмм..."
        $ ccg("e7","b4","m1")
        ast "Дамби!!!"

        call blkfade

        call nar(">В миг, Астория быстро соскакивает с твоих колен.")

        #Hide CG scene.
        hide screen ccg

        pause.5
        hide screen blkfade

        call ast_main("Что это было?!","scream","closed","angry","mid",trans="fade")
        m "Я понятия не имею, о чем ты говоришь..."
        call ast_main("Лучше держи свои грязные мыслишки при себе, старик!","scream","angry","angry","angry")
        call ast_main("Или тебе придется самому сидеть с той старой каргой!","clench","angry","angry","angry")
        m "Хорошо... Извини..."
        call ast_main("...","pout","angry","angry","R")

        hide screen bld1
        hide screen astoria_main
        call blkfade

        call nar(">Астория снова запрыгивает к тебе на колени.")

        $ astoria_spell_progress = 1

    if astoria_spell_progress < 4:
        call astoria_spell_practice
        if astoria_spell_progress < 4:
            call play_sound("door")
            hide screen astoria_main
            hide screen bld1
            hide screen blkfade
            with fade

            if daytime:
                jump night_start
            else:
                jump day_start

    call ast_main("Не волнуйтесь, сэр, мы можем попробовать его позже.","smile","base","base","mid")
    m "С нетерпением жду этого."
    m "Спокойной ночи, Астория."
    call ast_main("Спокойной ночи, Дамби!","grin","closed","base","mid")
    hide screen astoria_main
    with d3
    pause.5

    call nar(">Астория быстро выходит из твоего кабинета, едва ухмыляясь уголком рта.")

    call give_reward(">Поздравляем! Астория изучила новое заклинание!","images/store/astoria_unlock_02.png")

    #Unlocks spell 1.
    $ astoria_spells[0] = 1

    if daytime:
        jump night_start
    else:
        jump day_start


label imperio_spell_2_training: #second level imperio spell
    if astoria_spell_progress == 0:
        #talk about what it does new and about sitting on lap


        call ast_main("","smile","base","base","mid",xpos="right",ypos="base",trans="fade")
        m "Готова попрактиковаться в следующем заклинании?"
        ast "Угу!"
        pass

        $ astoria_spell_progress = 1

    if astoria_spell_progress < 4:
        call astoria_spell_practice
        if astoria_spell_progress < 4:
            call play_sound("door")
            hide screen astoria_main
            hide screen bld1
            with d3

            if daytime:
                jump night_start
            else:
                jump day_start

    call give_reward(">Поздравляем! Астория выучила новое заклинание!","images/store/astoria_unlock_02.png")

    #Unlocks Spell 2.
    $ astoria_spells[0] = 2

    if daytime:
        jump night_start
    else:
        jump day_start


label imperio_spell_3_training: #third level imperio spell
    if astoria_spell_progress == 0:
        #talk about what it does new and about sitting on lap
        call ast_main("Итак, мы будем изучать запрещенное заклинание Imperio, [ast_genie_name]?","grin","angry","angry","mid",xpos="right",ypos="base",trans="fade")
        m "Я готов, как никогда..."

        $ astoria_spell_progress = 1

    if astoria_spell_progress < 4:
        call astoria_spell_practice
        if astoria_spell_progress < 4:
            call play_sound("door")
            hide screen astoria_main
            hide screen bld1
            with d3

            if daytime:
                jump night_start
            else:
                jump day_start

    call give_reward(">Поздравляем! Астория выучила новое заклинание!","images/store/astoria_unlock_02.png")

    #Unlocks Spell 3.
    $ astoria_spells[0] = 3

    if daytime:
        jump night_start
    else:
        jump day_start


#susan event labels are on the other page.
label hornify_spell_1_training: #first level hornify spell
    #Start grinding her hips in front of genie
label hornify_spell_2_training: #second level hornify spell
    #Takes her top of and starts shaking her boobs for genie
label hornify_spell_3_training: #third level hornify spell
    #Plays with herself in front of astoria and genie


label slutify_spell_1_training: #first level sluttify spell
    #Underwear becomes slutty
label slutify_spell_2_training: #second level sluttify spell
    #Skirt becomes short, vest only and slutty Underwear
label slutify_spell_3_training: #third level sluttify spell
    #Pink heart dress and no underwear


label orgasmio_spell_1_training: #first level orgasmio spell
    #Mild orgasm
label orgasmio_spell_2_training: #second level orgasmio spell
    #Intense orgasm
label orgasmio_spell_3_training: #third level orgasmio spell
    #Extreme orgasm, Astoria casts the spell multiple times






### SPELL PRACTICE / SIT ON LAP CG ###
label astoria_spell_practice:
    hide screen astoria_main
    hide screen bld1
    call blkfade

    #Set up CG scene here!
    $ ccg_folder = "astoria_sit"
    $ ccg("e6","b3","m1")

    hide screen blkfade
    with fade
    pause.8

    $ renpy.call('astoria_lap_sit_'+str(astoria_affection)+'_'+str(astoria_spell_progress))

    pause.8
    call blkfade

    #Hide CG scene here!
    hide screen ccg

    hide screen astoria_main
    hide screen bld1
    hide screen blkfade
    with fade

    $ astoria_spell_progress += 1
    $ astoria_busy = True

    return


#
label astoria_lap_sit_0_1:
    call nar(">Астория с легкостью прыгает на твои колени.")
    $ ccg("e6","b1","m3")
    ast "Я полагаю, это не так уж и плохо..."
    $ ccg("e7","b0","m1")
    ast "Во всяком случае, твои бедра намного мягче деревянных скамеек в библиотеке..."
    m "Просто начинай читать заклинание..."
    $ ccg("e6","b1","m4")
    ast "Должна ли я..."
    $ ccg("e0","b1","m4")
    ast "Это выглядит довольно трудно..."
    m "Разве не ты просила научить тебя этому?"
    $ ccg("e7","b4","m1")
    ast "Я думала, что это будет проще, чем оказалось, Дамби!"
    m "Жесть..."
    $ ccg("e0","b1","m4")
    call nar(">Ты и Астория проводите ночь над книгой заклинаний, обсуждая то, как оно работает...")
    call nar(">Твой растущий интерес к чужой магии отвлекает тебя от пошлостей с Асторией...")
    $ ccg("e2","b2","m1")
    ast "Ах... Думаю, я лучше сейчас лягу спать, Дамби..."
    m "Так рано? Но у нас осталось еще так много страниц..."
    $ ccg("e7","b4","m1")
    ast "Она такая сложная!"
    m "О, хорошо... Я мог бы изучить немного больше за сегодня..."
    ast "Не читай заранее!"
    m "Хорошо..."
    $ ccg("e7","b0","m1")
    ast "Отлично... Спокойной ночи, Дамби!"

    call nar("С веселой улыбкой, Астория спрыгивает с твоих коленей и покидает кабинет.")

    return

label astoria_lap_sit_0_2:
    call nar(">Астория с легкостью запрыгивает на твои колени.")
    $ ccg("e7","b1","m3")
    ast "Мне действительно нужно сидеть здесь?"
    m "Это так плохо?"
    $ ccg("e6","b1","m4")
    ast "Я думаю, нет..."
    $ ccg("e7","b1","m3")
    ast "Но, вы можете притащить другой стул?"
    m "Могу предложить вот этот, который рядом с камином."
    $ ccg("e6","b1","m1")
    ast "Этот деревянный?"
    $ ccg("e7","b4","m1")
    ast "Но он выглядит таким неудобным!"
    m "Тогда тебе придется довольствоваться моими коленями."
    $ ccg("e2","b4","m1")
    ast "Хорошо!"
    call nar(">Ты и Астория проводите ночь за книгой заклинаний, молча читая ее...")
    $ ccg("e0","b0","m0")
    ast "Следующая страница!"
    m "Уже? Мне осталось дочитать еще несколько строк..."
    $ ccg("e7","b4","m0")
    ast "Ох! Ты так медленно читаешь, дурашка!"
    m "Ты права... Должно быть потому, что уже так поздно..."
    $ ccg("e7","b2","m1")
    ast "Мы можем продолжить?"
    m "Нет, если ты не хочешь, что бы я отставал..."
    $ ccg("e2","b4","m4")
    ast "*хм* Я не буду мириться со старческой медлительностью..."
    ast "Я могу тоже пойти в постель."
    $ ccg("e6","b4","m4")
    ast "Спокушки, Дамби..."
    call nar("С угрюмой гримасой, Астория слезает с твоих коленей и покидает кабинет.")

    return

label astoria_lap_sit_0_3:
    call nar(">Астория с легкостью прыгает на твои колени.")
    $ ccg("e7","b0","m1")
    ast "Мы можем сейчас начать читать?"
    m "Я готов, если ты готова."
    $ ccg("e0","b0","m1")
    ast "Хорошо... Я не могу дождаться, что бы изучить {b}веселенькое{/b} заклинаньице."
    $ ccg("e7","b4","m1")
    ast "Вы знаете, чему ваша дурацкая школа пыталась научить меня сегодня?"
    m "Понятия не имею..."
    $ ccg("e6","b4","m4")
    ast "Они настаивали, что бы я выучила заклинание для поиска ближайших драконов..."
    ast "И даже должна, определять их тип!"
    $ ccg("e7","b4","m1")
    ast "Когда я буду использовать его."
    m "Оно пригодится тебе при поиске золота?"
    $ ccg("e7","b4","m4")
    ast "..."
    $ ccg("e7","b1","m4")
    ast "Просто открывай книгу, Дамби."
    call nar(">Ты и Астория читали книгу до поздней ночи, время от времени задаваясь вопросами...")
    $ ccg("e0","b2","m0")
    ast "Тьфу... это конец заклинания..."
    $ ccg("e7","b0","m1")
    ast "Может, тогда позовем сюда Сьюзан?"
    m "Наверное, нет... уже несколько поздно..."
    $ ccg("e7","b4","m1")
    ast "Мы не можем сейчас это сделать?"
    m "Я не думаю, что она придет."
    $ ccg("e6","b2","m4")
    ast "Хорошо... Мы сможем попробовать его позже."
    $ ccg("e7","b2","m3")
    ast "Спокушечки, Дамби..."
    m "Доброй ночи, Астория."
    call nar("С уставшим лицом, Астория слезает с твоих коленей и покидает кабинет.")

    return



#
label astoria_lap_sit_1_1:
    call nar(">Астория радостно прыгает к тебе на колени, желая начать чтение.")
    $ ccg("e7","b0","m1")
    ast "Давай, Дамби, давай начнем уже ее читать!"
    m "Разумеется..."
    call nar("Ты и Астория переворачиваете страницу и начинаете читать новое заклинание.")
    $ ccg("e0","b1","m1")
    ast "Согласно руководству, это называется Imperio Tempus..."
    $ ccg("e7","b0","m0")
    ast "Оно позволяет устанавливать постоянные команды для человека, на которого его накладывают..."
    m "Это кажется полезным!"
    $ ccg("e7","b0","m2")
    ast "И веселым!"
    $ ccg("e0","b1","m1")
    ast "Хмммм... Оно выглядит более сложным, чем последнее, хотя..."
    m "Как ты думаешь, мы сможем создать его?"
    $ ccg("e7","b4","m1")
    ast "Конечно, Дамби! Мне просто потребуется время, что бы изучить его..."
    m "Хорошо..."
    call nar(">Ты и Астория медленно читаете книгу, ты чувствуешь, как твои глаза закрываются...")
    $ ccg("e7","b4","m1")
    ast "Проснись, Дамби!"
    m "Чур, я сверху!"
    $ ccg("e7","b4","m4")
    ast "*хмпф* Я думаю, что ты слишком устал, думая о больших сиськах Сьюзан, не так ли?"
    m "Я сейчас..."
    $ ccg("e7","b4","m1")
    ast "Да перестань!"
    $ ccg("e0","b1","m4")
    ast "Ты должен сосредоточиться на заклинании, эта часть кажется довольно сложной.."
    m "Может, продолжим завтра?"
    $ ccg("e7","b1","m4")
    ast "Что случилось, Дамби? Устали от того, что весь день сидели в своем кресле?"
    m "Собственно говоря, так и есть."
    $ ccg("e6","b4","m4")
    ast "Пффф, возраст."
    $ ccg("e7","b4","m1")
    ast "Хорошо, отдыхай, старик. Я надеюсь, что в следующий раз ты сможешь потянуть свою часть!"
    m "Тьфу..."
    call nar("С дразнящим лицом, Астория спрыгивает с твоих коленей и выходит из кабинета.")

    return

label astoria_lap_sit_1_2:
    call nar(">Астория медленно забирается к тебе на колени, тихо открывая книгу.")
    $ ccg("e0","b2","m3")
    m "В чем дело? Ты выглядишь немного уставшей."
    $ ccg("e7","b4","m1")
    ast "Нет!"
    $ ccg("e6","b1","m4")
    ast "Просто у меня был длинный день..."
    ast "Профессор Спраут заставила нас потратить целый день на сбор мандрагоры, что бы сделать сок..."
    $ ccg("e2","b4","m1")
    ast "Их действительно трудно вытащить!"
    m "Держу пари..."
    m "Если ты устала, мы вполне можем продолжить завтра."
    $ ccg("e7","b4","m1")
    ast "Я не устала!"
    m "Раз ты так говоришь..."
    call nar(">Вы начинаете читать про сложное заклинание.. Астории требуется гораздо больше времени, что бы прочесть страницу...")
    $ ccg("e2","b1","m4")
    ast "..."
    m "Ты готова начать следующую страницу?"
    $ ccg("e0","b1","m4")
    ast "Да..."
    $ ccg("e2","b2","m3")
    call nar(">Когда ты переворачиваешь страницу, то чувствуешь, как тело Астории медленно мякнет на твоих коленях.")
    m "Хммм... Бедняжка..."
    call nar(">Ты слегка подтолкнул Асторию в спину.")
    $ ccg("e5","b4","m4")
    ast "Ч-что... Убери от меня свои руки, старик!"
    m "Пуф-ф... Думаю, тебе пора ложиться спать."
    $ ccg("e2","b2","m1")
    ast "Я говорила тебе, что я не *зевок* устала..."
    m "..."
    $ ccg("e6","b2","m4")
    ast "Хорошо... я думаю, мы сможем продолжить читать завтра."
    $ ccg("e7","b2","m4")
    ast "Спокушки, Дамби..."
    m "Доброй ночи, Астория."
    call nar("С усталостью на лице, Астория слезает с твоих колен и выходит из кабинета.")

    return

label astoria_lap_sit_1_3:
    call nar(">Астория без особых усилий запрыгивает на колени, желая начать читать про заключительную часть заклинания.")
    $ ccg("e7","b0","m1")
    ast "Давай, Дамби! Мы почти закончили!"
    m "Хорошо..."
    call nar("Ты и Астория открываете одну из последних страниц и продолжаете читать с того места, на котором остановились.")
    $ ccg("e0","b1","m4")
    ast "Хммм... нам придется немного вернуться..."
    m "Почему?"
    $ ccg("e6","b1","m4")
    ast "Я действительно не помню этого..."
    $ ccg("e3","b1","m5")
    ast "Возможно, в прошлый раз я немного заснула..."
    m "Ты же говорила, что не устала?"
    $ ccg("e6","b4","m1")
    ast "Помолчи Дамби, никому не нравятся умники!"
    m "Ты говорила мне..."
    call nar(">Ты и Астория перелистываете на несколько страниц назад и продолжаете читать...")
    $ ccg("e1","b0","m2")
    ast "Ну вот!"
    m "Наконец..."
    $ ccg("e7","b4","m1")
    ast "*Хммм* Мы бы могли и быстрее, если бы ты, не спрашивал меня о значении каждого второго слова!"
    m "Я просто проверял тебя..."
    $ ccg("e6","b4","m4")
    ast "Пфффф!"
    $ ccg("e7","b4","m1")
    ast "Я даже не представляю, как вы стали директором, не зная, что делает Wingardium Leviosa..."
    m "Ооохх, моя работа здесь, в основном, административная..."
    ast "Больше похоже на администрирование вашей грубости на девушках!"
    m "Кстати говоря... Что на счет Сьюзан Боунс?"
    $ ccg("e7","b5","m1")
    ast "В такой час?"
    $ ccg("e7","b4","m1")
    ast "Я не уверена, Дамби..."
    m "Угх... Хватит..."
    call nar("Астория слезает с твоих коленей.")

    return



#
label astoria_lap_sit_2_1:
    call nar(">Астория быстро запрыгивает к тебе на колени.")
    $ ccg("e7","b0","m1")
    ast "Погнали, Дамби!"
    m "Хорошо..."
    call nar("Ты и Астория переворачиваете страницу и начинаете читать окончание о заклинании Imperio.")
    $ ccg("e1","b0","m1")
    ast "Вау... это даст нам полный контроль над любым..."
    m "Чем это отличается от обычного?"
    $ ccg("e7","b4","m1")
    ast "Ты говоришь глупость! Обычный Imperio только контролирует чей-то ум..."
    ast "И, он не длится вечно..."
    $ ccg("e1","b1","m1")
    ast "А это, видимо, позволяет изменить то, как \'воспринимается мир\'..."
    $ ccg("e6","b0","m1")
    ast "Все это значит... И к тому же, оно действует вечно!"
    m "Так что это нам позволит сделать что угодно со Сьюзан..."
    $ ccg("e7","b4","m1")
    ast "Все, что я хочу!"
    m "Не могу ли я получ-"
    $ ccg("e3","b0","m0")
    ast "Нет! Давай продолжим читать..."
    call nar(">Ты и Астория, вчитываетесь в книгу, Астории, кажется, нужно перечитывать несколько страниц, чтобы полностью понять их...")
    $ ccg("e0","b1","m4")
    ast "Это выглядит довольно сложным..."
    $ ccg("e2","b1","m4")
    ast "Я бы хотела, что бы моя латынь была лучше."
    m "Давай я прочту это для тебя."
    $ ccg("e7","b5","m1")
    ast "Ты умеешь читать на латыни?"
    m "Конечно! Я был там, когда ее изобрели!"
    $ ccg("e3","b5","m0")
    ast "Вау... Ты действительно очень стар!"
    m "Ты не представляешь, на сколько..."
    $ ccg("e6","b0","m1")
    ast "Можешь прочесть мне и позже, я обещала Пэнси Паркинсон, что потусуюсь с ней сегодня вечером."
    m "Хорошо, тогда..."
    call nar("Ты закрываешь книгу, а Астория слезает с твоих колен и уходит из кабинета.")

    return

label astoria_lap_sit_2_2:
    call nar(">Астория взбирается к тебе на колени, ерзая своей маленькой попкой, что бы по-удобней устроиться.")
    $ ccg("e7","b0","m1")
    ast "Давай, Дамби, давай уже закончим с этим заклинанием, что бы уже можно было его испробовать!"
    $ ccg("e3","b0","m1")
    ast "Я даже немного попрактиковалась в латыни!"
    m "*зевок* секунду..."
    $ ccg("e7","b4","m4")
    ast "Что случилось, Дамби, ты ведь не собираешься заснуть?"
    m "Нет... Просто мисс Грейнджер меня сегодня, немного утомила..."
    $ ccg("e7","b5","m1")
    ast "Вы имеете в виду... Гермиона?"
    m "Забудь то, что я сказал."
    $ ccg("e6","b1","m4")
    ast "Хмм, хорошо.... Старик, давай просто почитаем книгу."
    call nar(">Ты и Астория начинаете читать про сложное заклинание. Твое знание латыни оказалось очень важным для обучения маленькой ведьмы.")
    $ ccg("e7","b4","m1")
    ast "Это не настоящее слово!"
    m "Да, это..."
    $ ccg("e6","b4","m4")
    ast "Пфффт... тот, кто придумал этот глупый язык, тупее чем ты, Дамби!"
    m "Тьфу..."
    call nar(">Ты и Астория возвращаетесь к книге...")
    $ ccg("e0","b4","m1")
    ast "Угрх.. Тот, кто написал эту книгу, обладал ужасным почерком!"
    m "Хорошо. Я думаю, нам лучше закончить сегодня."
    $ ccg("e7","b4","m1")
    ast "*хм* Что? Почему?!"
    m "Мне кажется, кто-то немного переутомлся..."
    $ ccg("e2","b4","m1")
    ast "Не я!"
    $ ccg("e7","b4","m1")
    ast "Ты переутомился!"
    m "Угу.. В любом случае, мы можем продолжить чтение в следующий раз..."
    $ ccg("e6","b4","m3")
    ast "Хорошо... Но, проблема только в тебе!"
    m "...."
    $ ccg("e2","b4","m4")
    call nar("Надувшись, Астория спрыгивает с твоих колен и выходит из кабинета.")

    return

label astoria_lap_sit_2_3:
    call nar(">Астория запрыгивает к тебе на колени, будто ты Санта-Клаус в Рождество...")
    $ ccg("e7","b0","m1")
    ast "Давай начнем, Дамби! Мы почти подошли к концу!"
    m "Почти..."
    $ ccg("e0","b0","m0")
    call nar(">Ты и Астория открываете книгу на закладке и начинаете читать последние страницы заклинания.")
    $ ccg("e3","b0","m0")
    ast "Вау.. Я думаю, что я, наконец, стала хороша в латыни!"
    m "Ты в порядке..."
    $ ccg("e3","b0","m2")
    ast "Я лучшая!"
    m "Угу..."
    m "Тогда почему бы тебе не прочесть следующую страницу вслух?"
    $ ccg("e6","b4","m1")
    ast "Отлично!"
    call nar(">Ты с Асторией медленно читаете следующие несколько страниц, Астория спотыкается на каждом втором слове...")
    $ ccg("e3","b0","m2")
    ast "Готово! Я же говорила, что я лучшая, Дамби!"
    m "Ты, конечно, доказала это мне..."
    $ ccg("e6","b4","m4")
    ast "*Хммм*"
    m "Не хочешь сейчас попрактиковаться?"
    $ ccg("e7","b4","m1")
    ast "Мы могли бы, если бы ты смог прочитать последнюю страницу менее, чем за час!"
    $ ccg("e6","b2","m3")
    ast "Уже слишком поздно..."
    m "Ты читала последнюю страницу!"
    $ ccg("e2","b4","m1")
    ast "Это не важно, в любом случае, я хочу спать."
    m "Хорошо... Я полагаю, что уже достаточно поздно."
    $ ccg("e7","b0","m0")
    ast "По крайней мере, ты еще видишь время на часах!"
    call nar(">С дразнящим взглядом, Астория спрыгивает с твоих коленей и уходит из кабинета.")

    return

