label __init_variables:
    if not hasattr(renpy.store,'shea'): #important!
        $ shea = 0 #Shows how many times you went on a date with your stepsister Shea.
    if not hasattr(renpy.store,'shea_waifu'): #important!
        $ shea_waifu = False #Turns True if you finish the book with Shea.
    if not hasattr(renpy.store,'complited_shea_already'): #important!
        $ complited_shea_already = False #Turns TRUE when you finish with Shea once. Need so that when you finish with Shea again you don get +1 Imagination.
    
    if not hasattr(renpy.store,'victoria'): #important!
        $ victoria = 0
    if not hasattr(renpy.store,'victoria_waifu'): #important!
        $ victoria_waifu = False #Turns True if you finish the book with ms.Victoria.
    if not hasattr(renpy.store,'complited_stevens_already'): #important!
        $ complited_stevens_already = False #Turns TRUE when you finish with Ms.Stevens once. Need so that when you finish with Shea again you don get +1 Imagination.
    
    if not hasattr(renpy.store,'leena'): #important!
        $ leena = 0
    if not hasattr(renpy.store,'leena_waifu'): #important!
        $ leena_waifu = False #Completed the book with Leena.
    if not hasattr(renpy.store,'complited_leena_already'): #important!
        $ complited_leena_already = False #Turns TRUE when you finish with Leena once. Need so that when you finish with Shea again you don get +1 Imagination.
    
    if not hasattr(renpy.store,'waifu_book_completed'): #important!
        $ waifu_book_completed = False #Turns TRUE when you unlock the harem ending.
    
    $ waifu_chapters = [
        "{size=-2}Вы подросток, который делит свой дом со своей милой сводной сестрой Ши. Чем бы вы хотели заняться после школы сегодня?{/size}",
        "{size=-2}Во время занятий, мисс Стивенс говорит о чем то. Вы смотрите на ее грудь, что бы не уснуть. Она слишком горяченькая для учителя.{/size}",
        "{size=-2}Вы встречаете свою сводную сестру в школе. В отличие от вас, Ши довольно популярна среди одноклассников и поэтому она отрицает ваше существование.{/size}",
        "{size=-2}Вы столкнулись с девушкой в коридоре, она носит очки с толстыми линзами и очень застенчива. Она извиняется и быстро убегает, она тоже учится в этой школе?{/size}",
        "{size=-2}Мисс Стивенс устроила внеклассные мероприятия сегодня. Вы решаете проявить себя, чтобы получить хорошую репутацию.{/size}",
        "{size=-2}Хулиган отбирает ваши деньги на обед. Позже Ши приводит хулигана, он извиняется и возвращает тебе, твои обеденные деньги. Ши может быть опасной девчонкой...{/size}",
        "{size=-2}Другой скучный урок. Вы полностью игнорируете учителя и мечтаете о получении степени в искусстве, чтобы стать художником по хентай-манге.{/size}",
        "{size=-2}Еще один ужасный школьный день, Мисс Стивенс одета в скромный зеленый костюм, скрывающий ее привлекательную фигуру. Вы не можете сосредоточиться на ее уроке.{/size}" ,
        "{size=-2}Вы сорвали занятие и бродите по пустынным школьным коридорам, делая вид, что вы единственный оставшийся в живых из-за какого-то смертельного вируса. Дворник замечает вас, вероятно он заражен! Вы убегаете дабы выжить.{/size}" ,
        "{size=-2}Хулиган вновь отбирает у вас деньги. Час спустя скорая забирает в парке перед школой парня со сломанной рукой. Вы узнаете в нем хулигана... Это Ши сделала такое с ним?{/size}",
        "{size=-2}Еще один день в школе. После инцидента с хулиганом люди смотрят на Вас странно, но они, кажется, обожают Ши больше, чем когда-либо. Как у нее это получается?{/size}",
        "{size=-2}У вас сегодня нет занятий с Мисс Стивенс . Так зачем беспокоится? Вы засыпаете за своим столом.{/size}",
        "{size=-2}Все ваши одноклассники взволнованы предстоящим выпускным, но вам кажется это полной глупостью.{/size}",
        "{size=-2}Еще один скучный урок. Вы выглядываете из окна и замечаете подозрительно выглядящий черный фургон с тонированными окнами, припаркованный рядом со зданием школьной библиотеки. Зачем?{/size}",
        "{size=-2}Вы подслушали, как ваши одноклассники говорили о \"фан-клубе мисс Стивенс\". Не очень удивительно, при том, какая она привлекательная.{/size}",
        "{size=-2}С каждым днем все вокруг все больше волнуются из-за выпускного. Вы подумываете о том, чтобы пригласить кого-то, но вы слишком стеснительны для такого.{/size}" ,
        "{size=-2}Мисс Стивенс снова надела обтягивающий костюм сегодня. Все парни стараются лучше учиться, а девчонки сильно обижены.{/size}",
        "{size=-2}Выпускной завтра. все очень взволнованы, но вы просто хотите, что бы день поскорее закончился.{/size}",
        "{size=-2}Сегодня выпускной. вы видите своих одноклассников очень взволнованных перед церемонией, но вам все равно.{/size}",
        "{size=-2}Выпускной будет сегодня вечером. У вас нет планов на сегодня, ни по дому, ни домашнего задания... Так вот каково это-быть свободным?!{/size}"
     ]

    ### DATES ### 
    $ shea_dates = [
        "{size=-2}Вы входите в дом и идете в ванну, где сейчас находится Ши. Вы пялитесь на ее сиськи, в то время, как она пытается вытолкнуть вас.{/size}",
        "{size=-2}Дома Ши готовит для тебя ужин. Вы мельком замечаете ее трусики, и она снова вырубает вас одним из своих фирменных ударов.{/size}",
        "{size=-2}Вы возвращаетесь домой и понимаете, что дома никого. Вы решаете посмотреть какое-нибудь порно в гостиной. Ши возвращается с прогулки и видит вас. Она опять начинает бить вас.{/size}",
        "{size=-2}Сегодня погода на улице очень испортилась. Началась гроза. Ши, испугавшись залезает в вашу постель. Упираясь в ваш твердый член, она замечает это и вырубает вас одним из своих фирменных ударов.{/size}",
        "{size=-2}В качестве предложения к перемирию, вы решили убраться в комнате Ши. Она не ценит такое вторжение в частную жизнь и ныносит еще один из своих фирменных ударов, который вырубает вас.{/size}",
        "{size=-2}Дома никого нет. Вы решаете посмотреть порнуху в гостиной. Внезапно Ши возвращается с прогулки. Вы ожидаете, что она начнет вас бить, но нет, она просто убегает{/size}",
        "{size=-2}Вы решаете извиниться и идете в комнату Ши. На ней надета прелестная ночнушка. Вы извиняетесь, у тебя встает во время извинений, но она принимает ваши извинения, хоть и слегка краснея.{/size}" ,
        "{size=-2}Снова на улице портится погода. Ши опять залазит вам в кровать. Она целует вас и просит вас лишить ее анальной девственности. Вы занимаетесь анальным сексом со своей сестренкой.{/size}",
        "{size=-2}Ши проскальзывает в вашу комнату. В то время, как ваши родители заканчивают ужинать внизу, вы бурите сладкую попку своей сестренки, которая с радостью принимает вас.{/size}"
     ]

    $ victoria_dates = [
        "{size=-2}Вы решаете побродить вокруг школы. Мисс Стивенс сидит в одном из классов и вы решаете тайно за ней понаблюдать.{/size}",
        "{size=-2}Вы видите как мисс Стивенс опять работает в пустом классе. На этот раз она замечает вас, и вы должны быстро свалить отсюда, но у вас ничего не выходит. Она дает вам большое домашнее задание.{/size}",
        "{size=-2}Мисс Стивенс находит вас бродящим по пустым коридорам школы. Вы не выполнили ее задание, но она добавила к нему следующее. Пока что она презирает вас.{/size}",
        "{size=-2}Вы снова натыкаетесь на мисс Стивенс. Похоже она преследует вас. Она снова дает вам еще одно задание. Вы потихоньку начинаете ненавидеть эту женщину.{/size}",
        "{size=-2}Вы пытаетесь избежать мисс Стивенс, но неудачно. Она снова дает вам задание и начинает причитать о том, что бывает в жизни с такими \"плохими учениками как вы\".{/size}",
        "{size=-2}Мисс Стивенс снова читает вам лекции. При этом она случайно проливает чай вам на колени. После этого она использует салфетку, чтобы вытереть его, хотя вы возбуждаетесь от того, что она притворяется, что не замечает этого.{/size}",
        "{size=-2}Мисс Стивенс снова читает вам лекции. Вдруг она целует вас в губы и тут же извиняется. Она просит вас держать это в секрете. Вы очень смущены и возвращаетесь домой.{/size}",
        "{size=-2}Вы решаете побродить у школы, в надежде встретить мисс Стивенс. Но ее нигде нет...{/size}",
        "{size=-2}Мисс Стивенс вызывает вас к себе. В момент она хватает вас за член и начинает его ласкать, после чего просто отпускает вас. Домой вы возвращаетесь в изумлении.{/size}"
     ]

    $ leena_dates = [
        "{size=-2}Вы идете в библиотеку. Вы замечаете темноволосую девушку в очках, возможно она просто посетитель. Остаток времени вы проводите за чтением научно-фантастической литературы.{/size}",
        "{size=-2}Вы пришли в библиотеку. Опять эта девушка в очках. Вы читаете свои научные книги и замечаете, как девушка смотрит на вас. У нее какие-то проблемы?{/size}",
        "{size=-2}Похоже, что та девушка постоянно здесь. В этот раз вы всматриваетесь в нее более детально: длинные темные волосы, очки, отличное тело. Она довольно милая, но вдруг она ловит ваш взгляд на себе.{/size}",
        "{size=-2}Та девушка как обычно здесь. Она вероятно застенчива, тут вы решаете заговорить с ней, но она игнорирует вас и просто уходит. Она очень странная.{/size}",
        "{size=-2}Сегодня той девушки нет. Вы занимаете свое обычное место и находите от нее записку. Она извиняется и признается, что влюблена в вас и просит прощения за тот раз.{/size}",
        "{size=-2}Вы снова здесь. Девушки, как и записки от нее, нет. Вы не можете вспомнить, видели ли вы эту красивую застенчивую девчушку ранее, кроме того раза.{/size}",
        "{size=-2}Ты пытаешься прочитать свой научно-фантастический роман, но не можешь сосредоточиться. Вдруг рядом с вами садится та загадочная девушка. Вы ждете объяснений, но она притворяется, что просто читает.{/size}",
        "{size=-2}Ты притворяешься, что читаешь, пока ждешь девушку. Она снова занимает место рядом с Вами и начинает массировать ваш член под столом. Что с ней случилось?!{/size}",
        "{size=-2}Как только ты появляешься, девушка тащит тебя за книжную полку и умоляет трахнуть ее. Вы кончаете, наполняя ее своей спермой, и она возвращается к своему столу, в то время как вы просто продолжаете стоять там же, в растерянности.{/size}"   
     ]

    ### RANDOM ### 
    $ random_home = [
        "{size=-2}Вы вернулись домой. Дом пуст. Вы решили поиграть в видеоигры до вечера.{/size}",
        "{size=-2}Вы вернулись домой. Дом пуст. Вы решили смотреть фильмы для взрослых в гостинной.{/size}",
        "{size=-2}Вы вернулись домой. Ваш отец дома. Вы решаете пойти на пробежку, что бы уйти от неудобных вопросов про вашу личную жизнь.{/size}",
        "{size=-2}Вы вернулись домой. Ваша мачеха дома. Вы слушаете, как она говорит и говорит о чем-то банальном и не понимаете почему отец решил женится на ней.{/size}",
        "{size=-2}Вы вернулись домой. Дом пуст. Вы решили воспользоваться моментом, что бы вздремнуть.{/size}"
     ]
        
    $ random_school = [
        "{size=-2}Вы идете на школьный стадион, что бы расслабиться на трибунах, пока вы наблюдаете за чирлидершами из далека...{/size}",
        "{size=-2}Вы проникаете в свое секретное место на школьной крыше, и смотрите на надвигающиеся тяжелые тучи в далеке, в надежде что сегодня пойдет дождь.{/size}",
        "{size=-2}Вы бродите по пустым коридорам школы и видите дворника. Он бросает на вас подозрительный взгляд и уходит по своим делам. Вы отправляетесь домой.{/size}" ,
        "{size=-2}Вы покупаете плитку шоколада, а затем проникаете в один из пустых классов, что бы почитать свою любимую книгу по научной фантастике.{/size}",
        "{size=-2}Вы бродите по пустым школьным коридорам некоторое время . Начинается дождь. Ваша сводная сестра Ши боится грома и вы надеетесь, что ночью будет шторм.{/size}"
     ]

    $ random_library = [
        "{size=-2}Вы возвращаетесь в школьную библиотеку и обращаете внимания на мужчину в черном костюме у входа. Вы пытаетесь пройти, он игнорирует вас.{/size}",
        "{size=-2}Вы провели остаток дня сидя в библиотеке, читая вашу научно-фантастическую книгу, вздремнули, купили конфет из автомата, а затем почитали еще немного. Жизнь прекрасна!{/size}",
        "{size=-2}Вы просматриваете древние на вид книжные полки, надеясь найти давно забытые книги заклинаний или чего-то еще, но вам становится скучно и вы уходите домой.{/size}",
        "{size=-2}Библиотека пуста, так что вы прячетесь за книжными полками и дрочите, представляя, как Мисс Стивенс читает лекцию в нижнем белье.{/size}",
        "{size=-2}Вы услышали голоса и спрятались за книжной полкой. Оттуда вы видите чирлидершу сразу с двумя спортсменами, вы решаете уйти что бы не попасть в неприятности.{/size}"
     ]

    return

label waifu:
    $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", waifu_chapters[Dear_Wifu_OBJ.progress-1])
    if Dear_Wifu_OBJ.progress < 20:
        if Dear_Wifu_OBJ.progress == 1 and not complited_leena_already and not complited_stevens_already and not complited_shea_already:
            m "Ох, это одна из \"тех\" книг. Хорошо, поглядим..."
        call school_ended 
    elif Dear_Wifu_OBJ.progress == 20:
        if complited_leena_already and complited_shea_already and complited_stevens_already and victoria >= 1 and shea >= 1 and leena >= 1:
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решаете пойти на выпускной и с удивлением увидели \"библиотекаршу\" здесь. Она приглашает вас на танец и целует. Вы заметили Ши смотрящую на вас с недоверием.{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}\"Библиотекарша\" выводит вас на улицу. Она начинает целовать вас и, хватая ваш член, начинает дрочить вам. Вдруг из-за угла появляется Ши.{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши злится и начинает кричать на девушку, которая все еще дрочит вам. На крики Ши, прибегает мисс Стивенс и видит вас со спущенными штанами.{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Смущаясь, вы натягиваете свои брюки. Она спокойно обходит свою машину и зовет всех вас. Вы садитесь и она увозит вас в мотель. Она снова замечает ваши спущенные брюки и показывает на них.{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}В комнате она хватает вас за член и начинает дрочить его. В это время Ши стоит в шоке, а \"библиотекарша\" начинает вас целовать.{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Неохотно Ши присоединяется к вам. Вы решаете трахнуть в первую очередь свою сводную сестренку, конечно же в попку. \"Библиотекарша\" будет следующей, а за ней и мисс Стивенс{/size}"
            "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда вы просыпаетесь, то обнаруживаете, что все, кроме Ши ушли. Ваша сестренка еще спит. Вы раздвигаете ее попку и вставляете свой утренний стояк в ее сладкую попку. -Конец-{/size}"
            "\"Эпилог\"" "{size=-2}Спустя год. Мисс Стивенс все так же работает в школе и встречается с темноволосой девушкой... у вас нет предположений, что с ней стало.{/size}"
            "\"Эпилог\"" "{size=-2}Вы и Ши вместе учитесь в одном университете...{/size}"
            "\"Эпилог\"" "{size=-2}Вы были вместе в том отеле, но вам нужно хранить это в секрете. Единственное, что вас заботит, так это бешеный аппетит вашей сестренки к анальному сексу. -КОНЕЦ-{/size}"
            "\"Эпилог\"" "{size=-2}-Концовка 05 из 05-{/size}" #HAREM IS ENDING # 5.
            return
        else:
            menu:
                "Что бы вы хотели сделать в оставшуюся часть дня?"
                "- Бродить около школы (Страница 78) -":
                    if victoria >= 7:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}" 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы говорите мисс Стивенс о своем решении пропустить выпускной. Она злится, хватает вас за промежность и шепчет, что позволит кончит ей на лицо если вы передумаете.{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вечером того же дня вы приходите на выпускной. Вы танцуете с мисс Стивенс, она отводит вас к шкавчику дворника и начинает дрочить вам. Вы кончаете ей на лицо.{/size}"
                        $ victoria_waifu = True #Completed the book with ms.Stevens.
                        "\"Эпилог\"" "{size=-2}Спустя год... Вы пытались оставатся в контакте с мисс Стивенс, но похоже после того как вы перестали быть ее учеником она потеряла к вам интерес.{/size}"
                        "\"Эпилог\"" "{size=-2}Но этот опыт мотивировал вас следовать за своей мечтой стать художником в журнале для взрослых. Теперь вы посещаете школу искусств и вы счастливы.{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 03 из 05-{/size}" #Ms.Stevens IS ENDING # 3.
                        return
                    if victoria >= 4:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Мисс Стивенс глава комитета и кажется она, очень сильно занята.{/size}" 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она замечает вас. Вы говорите ей о своем решении пропустить выпускной, но ее видимо это совсем не заботит.{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue 
                        return
                    if victoria < 4:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Школьный спортзал полон всевозможных украшений. Нашли время...{/size}" 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы возращаетесь домой и пораньше ложитесь спать.{/size}"
                        call epilogue 
                        return
                "- Остаться дома (Страница 51) -":
                    if shea >= 8: #1
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению, Ши тоже осталась дома. Затем внезапно она приглашает вас пойти с ней на выпускной.{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Выпускной проходит в общем нормально. Вы танцуете со сводной сестрой и все вокруг думают, что это потому, что она сжалилась над вами.{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Когда выпускной заканчивается вы с Ши возвращаетесь домой. Этой ночью вы лишили свою сестренку девственности. Так же вам повезло и она попросила испробовать ее попку.{/size}"
                        "\"Эпилог\"" "{size=-2}Спустя год. Вы и Ши пошли в один и тот же университ, хотя вы и выбрали разные специальности, но вы попрежнему вместе и счастливы. -КОНЕЦ-{/size}"
                        $ shea_waifu = True #Completed the book with Shea.
                        "\"Эпилог\"" "{size=-2}-Концовка 02 из 05-{/size}" #SHEA IS ENDING # 2.
                        return
                    if shea >= 4:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома, к вашему удивлению Ши тоже осталась дома. Ваш генератор идей предлагает вам позвать ее на выпускной, но вы не способны на это.{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Ши идет на выпускной с другим парнем, а вы остаетесь дома.{/size}"
                        call epilogue 
                        return
                    if shea < 4:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы решили остаться дома и не ходить на выпускной.{/size}"
                        call epilogue 
                        return
                "- Бродить вокруг библиотеки (Страница 97) -":
                    if leena >= 8:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Вы идете к своему обычному месту. Вы удивлены увидев брюнетку под своим столом.{/size}" 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Двое мужчин в черных костюмах появляются как раз тогда, когда она засовывает твой член себе в рот. Они забирают ее, а ты просто стоишь там ошеломленный и запутавшийся со спущенными штанами. Какого черта?{/size}"
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Рано утром на вашем пороге появляется девушка. Она говорит, что находится под программой защиты свидетелей, но из-за вас ее прикрытие под угрозой.{/size}"
                        $ leena_waifu = True #Completed the book with Leena.
                        "\"Эпилог\"" "{size=-2}Спустя два года. Вы и \"девушка из библиотеки\" поженились. Вы живете в пляжном домике, в секретном месте, с новыми именами.{/size}" 
                        "\"Эпилог\"" "{size=-2}Вы очень ее любите и оставили ради нее, все свое прошлое позади, она так благодарна вам, что часто делает вам потрясающий минет. -Конец-{/size}"
                        "\"Эпилог\"" "{size=-2}-Концовка 04 из 05-{/size}" #LEENA IS ENDING # 4.
                        return
                    if leena >= 4:
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Внезапно появляется девушка из неоткуда и садится рядом с вами.{/size}" 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Она начинает говорить с вами, говорит что ее зовут Лина, но вдруг появляются двое мужчин в черных костюмах. Вы видете страх в ее глазах, когда они забирают ее. Вы хотели бы сделать что-то...{/size}"
                        call epilogue 
                        return
                    if leena < 4: 
                        "\"Глава [Dear_Wifu_OBJ.progress]\"" "{size=-2}Вы игнорируете выпускной и идете в библиотеку. Там пусто и вы садитесь за обычное место. Через некоторое время вы уходите домой и ложитесь спать.{/size}"
                        call epilogue 
                        return
    return


label school_ended:
    $ page_01 = renpy.random.randint(1, 30)  
    $ page_02 = renpy.random.randint(31, 60) 
    $ page_03 = renpy.random.randint(61, 100) 
    menu:
        "\"Глава [Dear_Wifu_OBJ.progress]\"""{size=-2}Школьные занятия закончены. Как бы вы хотели провести остаток дня?{/size}"
        "- Бродить у школы (Страница [page_03]) -":
            if Dear_Wifu_OBJ.progress in [1,4,6,7,10,13,15,16,18,20]:
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", victoria_dates[victoria])
                if victoria < len(victoria_dates)-1:
                    $ victoria += 1
            else:
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", random_school[renpy.random.randint(0, 4)])
                
        "- Идти домой (Страница [page_01]) -":
            if Dear_Wifu_OBJ.progress in [1,2,6,9,10,12,14,15,17,20]:
                if Dear_Wifu_OBJ.progress == 20:
                    "ASS"
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", shea_dates[shea])
                if shea < len(shea_dates)-1:
                    $ shea += 1
            else:
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", random_home[renpy.random.randint(0, 4)])

        "- Идти к библиотеке (Страница [page_02]) -":
            if Dear_Wifu_OBJ.progress in [4,6,7,8,10,12,13,16,18,20]:
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", leena_dates[leena])
                if leena < len(leena_dates)-1:
                    $ leena += 1
            else:
                $ renpy.say("\"Глава [Dear_Wifu_OBJ.progress]\"", random_library[renpy.random.randint(0, 4)])
    return

### EPILOGUE
label epilogue:
    "\"Эпилог\"" "{size=-2}Многое произошло за этот год. Вы поступили в университет за рубежом и вам нравится учиться, так что вы редко думаете о прошлом и возлагаете большие надежды на будущее.{/size}"
    "\"Эпилог\"" "{size=-2}-Концовка 01 из 04-{/size}"
        
        
### HAREM ###
label waifu_completed:
    if complited_leena_already and complited_shea_already and complited_stevens_already and victoria >= 1 and shea >= 1 and leena >= 1: #Harem ending. The DAHR's ticket.
        m "Ух ты! Какая замечательная книга! Это было круто!"
        
        #m "No, I mean it! What a great peace of fiction! That Akabur dude must be a genius!"
        if not found_dahrs_ticket_once:
            m "Хм...?"
            m "А это что такое?... Закладка?"
            call give_reward(">Ты нашел ваучер ДАХРа","images/store/06.png")
            m "Хм..."
            $ vouchers += 1 #Shows the amount of DAHR's vouchers in your possession.
            $ found_dahrs_ticket_once = True # Turns TRUE after you complete "My Dear Waifu" with the harem ending and "Dahr's voucher" fall out.
            $ Dear_Wifu_OBJ.done = True
            $ waifu_book_completed = True
    elif shea_waifu and shea >= 8: 
        if not complited_shea_already: #Finished with Shea for the first time.
            m "Не плохо. Я действительно вырос, чтобы заботиться о той девочке Ши..."
            g9 "Ну... о ней и ее анальной дырочке..."
            $ complited_shea_already = True
        else: #Finished with Shea for the second time.
            m "Значит, я снова встречаюсь с Ши, да?"
            m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"
    elif victoria_waifu and victoria >= 7:
        if not complited_stevens_already: #Finished with Ms.Stevens for the first time.
            m "Не плохо, не плохо. Эта леди, мисс Стивенс оказалась такой развратной шлюхой..."
            $ complited_stevens_already = True
        else: #Finished with Shea for the second time.
            m "Так я снова оказался с мисс Стивенс?"
            m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"
    elif leena_waifu and leena >= 8:
        if not complited_leena_already: #Finished with Leena for the first time.
            g9 "Мило! Обожаю счастливые развязки!"
            $ complited_leena_already = True
        else: #Finished with Shea for the second time.
            m "Значит, я снова оказался с этой блондинкой?"
            m "Хм... Может, в следующий раз мне стоит сделать другой выбор...?"

    else:
        m "Хм... Какой разочаровывающий финал..."
        #m "Maybe I should read it again sometime."
    
    if not dear_waifu_completed_once:
        $ dear_waifu_completed_once = True # Turns TRUE when complete the book for the first time with any ending. Makes sure you get +1 imagination only once.
        $ renpy.play('sounds/win_04.mp3')   #Not loud.
        hide screen notes
        show screen notes
        ">Ваше воображение улучшилось."
        $ imagination +=1
    $ Dear_Wifu_OBJ.progress = 0 #RESTING THE BOOK FOR ANOTHER PLAYTHORUGH.
    $ shea = 0 #RESETING SHEA'S POINTS FOR THE NEXT PLAYTHOURGH.
    $ victoria = 0
    $ leena = 0
    
    if fire_in_fireplace:
        hide screen reading_near_fire
    else:
        hide screen reading
    
    if daytime:
        jump night_start
    else: 
        jump day_start